[
    {
        "chunk": 63,
        "pos": 0,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 1,
        "terrain": "O",
        "features": "Bubbling Maelstrom",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 2,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 3,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 4,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 5,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 6,
        "terrain": "H",
        "features": "Elevated Outcrop",
        "encounter": "Rockspire enchantresses have left deserted troll bridge beneath a cluster of wildflowers.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 7,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 8,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 9,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 10,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 11,
        "terrain": "O",
        "features": "Calm Billow",
        "encounter": "The area is marked by a(n) helm of underwater action, hinting at the tales of kelpies.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 12,
        "terrain": "O",
        "features": "Calm Seamount",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 13,
        "terrain": "H",
        "features": "Nestled Pinnacle",
        "encounter": "The area is marked by old stone sundial, a testament to harpies and their tales.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 14,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 15,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 16,
        "terrain": "H",
        "features": "Golden Foot",
        "encounter": "You're captivated by a(n) stone altar, which seem(s) to have ties with stone sentinel rogues.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 17,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 18,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 19,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 20,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 21,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 22,
        "terrain": "O",
        "features": "Placid Gulf",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 23,
        "terrain": "H",
        "features": "Scenic Bluff",
        "encounter": "You overhear tales of hillshade druidesses that are singing songs that alter time from within a patch of heather.",
        "history": [
            "Hello! How can I assist you in your adventure today?"
        ]
    },
    {
        "chunk": 63,
        "pos": 24,
        "terrain": "O",
        "features": "Vibrant Reef",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 25,
        "terrain": "H",
        "features": "Breezy Dale",
        "encounter": "You see the abandoned tannery suggesting past activities of bouldershade paladins.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 26,
        "terrain": "H",
        "features": "Pastoral Foot",
        "encounter": "The juniper trees hides a(n) elixir of mountain breath, which are said to be linked to hillshade druidesses and their amazement.You notice hillshade druidesses that seem to be guiding lost members home.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 27,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 28,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 29,
        "terrain": "O",
        "features": "",
        "encounter": "The ground bears forgotten sea fortress from past encounters with pelagic pixies.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 30,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 31,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 32,
        "terrain": "H",
        "features": "Steep Spur",
        "encounter": "You're warned of muddy paths ahead, where hillside harpists often are basking in the sun.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 33,
        "terrain": "H",
        "features": "Eroded Elevation",
        "encounter": "Among the wild thyme, you find a(n) lantern of tracking used by hillfolk rangers that resonate with reverence.",
        "history": [
            "- To the northwest, the Eroded Elevation slopes downward, leading to the calm waters of the Placid Gulf. The hillfolk rangers often use this path to reach the coast, their lanterns of tracking lighting the way.\n- Northeast of the Eroded Elevation, the terrain rises to form the Scenic Bluff. It's said that hillshade druidesses gather there, their songs echoing through the hills and altering the flow of time.\n- Directly west, the terrain continues to rise, forming the Steep Spur. The muddy paths are often occupied by hillside harpists, their music blending with the sounds of nature.\n- To the east, the hills give way to the lush greenery of the Verdant Vale. Among the foliage, one might find the remnants of broken enchanted mirrors, left behind by caterpillars.\n- Southwest, the terrain dips into a Knoll-like Vale. Here, crumbled statues bear witness to the gatherings of rockspire enchantresses, their ethereal meetings shrouded in mystery.\n- Finally, to the southeast, the Wild Drumlin looms. An old well stands as a silent sentinel, its depths holding untold secrets.",
            "- To the northwest, the Eroded Elevation slopes downward, leading to the calm waters of the Placid Gulf. The hillfolk rangers often use this path to reach the coast, their lanterns of tracking lighting the way.\n- Northeast of the Eroded Elevation, the terrain rises to form the Scenic Bluff. It's said that hillshade druidesses gather there, their songs echoing through the hills and altering the flow of time.\n- Directly west, the terrain continues to rise, forming the Steep Spur. The muddy paths are often occupied by hillside harpists, their music blending with the sounds of nature.\n- To the east, the hills give way to the lush greenery of the Verdant Vale. Among the foliage, one might find the remnants of broken enchanted mirrors, left behind by caterpillars.\n- Southwest, the terrain dips into a Knoll-like Vale. Here, crumbled statues bear witness to the gatherings of rockspire enchantresses, their ethereal meetings shrouded in mystery.\n- Finally, to the southeast, the Wild Drumlin looms. An old well stands as a silent sentinel, its depths holding untold secrets."
        ]
    },
    {
        "chunk": 63,
        "pos": 34,
        "terrain": "F",
        "features": "Verdant Vale",
        "encounter": "Caterpillars have left broken enchanted mirror behind a mask of stone.",
        "history": [
            "Hello! How can I assist you in your adventure today?",
            "- Northwest: The Scenic Bluff, a hillside area known for its breathtaking views, is home to druidesses who sing songs that alter time. Their melodies carry across the hills, reaching the Verdant Vale.\n- Northeast: A Vibrant Reef lies off the coast, its colorful underwater life contrasting with the lush greenery of the Verdant Vale. The reef's existence hints at the possibility of underwater passages connecting the islands.\n- West: The Eroded Elevation, another hilly region, is home to hillfolk rangers who use lanterns of tracking that resonate with reverence. These lanterns may have been used to navigate through the Verdant Vale in the past.\n- East: The Stony Zigzag is a rugged mountainous area echoing with the celestial chorus of stoneclaw rogues. Their songs resonate from an abandoned tent, adding an eerie ambiance to the otherwise serene Verdant Vale.\n- Southwest: The Wild Drumlin, a hilly region with an old well, shares a mysterious connection with the Verdant Vale. The well may hold secrets about the magical catastrophe that tore the continent apart.\n- Southeast: The Rural Valley is a peaceful area where prairie dogs burrow near damp reeds by a pond. Their burrows may lead to underground passages that connect to the Verdant Vale.",
            "The enchanted mirror left behind by the caterpillars in the Verdant Vale could be a remnant of the hillshade druidesses' time-altering songs from the Scenic Bluff to the northwest. The songs, when reflected off the mirror, may have caused a ripple in time that led to the mirror's enchantment breaking."
        ]
    },
    {
        "chunk": 63,
        "pos": 35,
        "terrain": "H",
        "features": "Stony Zigzag",
        "encounter": "Sounds of stoneclaw rogues engaging in a celestial chorus emerge from within an old, abandoned tent.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 36,
        "terrain": "H",
        "features": "Nestled Down",
        "encounter": "Whispers suggest terrace tamers are carving sculptures from wood within a circle of protective stones.",
        "history": [
            "You didn't ask anything in the southeast adjacent hex.",
            "There is no recorded history for the southeast adjacent hex, the Craggy Bluff.",
            "Yes, there is now a history recorded for the southeast adjacent hex, the Craggy Bluff. The history tells of hillfolk scouts who were heard listening to the wind.",
            "You didn't make any specific requests in the southeast adjacent hex, the Craggy Bluff.",
            "Hello! How can I assist you in your adventure today?"
        ]
    },
    {
        "chunk": 63,
        "pos": 37,
        "terrain": "P",
        "features": "Calm Basin",
        "encounter": "You come across the pool showing reflections of another world that speak(s) of steppe serpents and their tales.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 38,
        "terrain": "F",
        "features": "Enchanted Thicket",
        "encounter": "You're filled with awe upon discovering a(n) ukulele of charm linked to bobcats.",
        "history": [
            "- The ukulele is said to be crafted from the wood of an ancient tree, a tree that was once the home of a powerful bobcat spirit. \n- When played, the ukulele emits a melody that is said to mimic the calls of the bobcats that once roamed these lands. \n- Legend tells that bobcats would gather around the player, entranced by the music, and lend their strength and cunning to the player's cause. \n- It is believed that the bobcats played a significant role in the grand catastrophe that shattered the continent, and their essence is still imbued within the ukulele. \n- The bobcats, now long gone, are said to still watch over the islands through the eyes of the ukulele's player, their spirits linked to the instrument."
        ]
    },
    {
        "chunk": 63,
        "pos": 39,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 40,
        "terrain": "O",
        "features": "",
        "encounter": "The area is marked by kept-away kelp kingdom, hinting at the presence of wave wranglers.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 41,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 42,
        "terrain": "H",
        "features": "Knoll-like Vale",
        "encounter": "You're drawn to a(n) crumbled statue, only to find signs of rockspire enchantresses holding a gathering of the ethereal.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 43,
        "terrain": "H",
        "features": "Wild Drumlin",
        "encounter": "You stumble upon the old well.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 44,
        "terrain": "P",
        "features": "Rural Valley",
        "encounter": "A strong scent of damp reeds by a pond leads you towards burrowing prairie dogs.",
        "history": [
            "- Northwest: Verdant Vale, a lush green valley filled with enchanted caterpillars and a mysterious stone mask hiding a broken mirror.\n- Northeast: Stony Zigzag, a rugged mountainous area echoing with the celestial chorus of stoneclaw rogues from an abandoned tent.\n- West: Wild Drumlin, a hilly region with an old well waiting to be explored.\n- East: Mossy Embankment, a hillside covered in moss where hillfolk mystic warriors craft tools near bridges made of light.\n- Southwest: Majestic Tableland, a flat, elevated area where wind dancers and a prairie mage work to stop a magical anomaly.\n- Southeast: Rolling Ridge, a hilly landscape where ridgeback enchanters are constructing a shelter within a circle of ancient runes.",
            "- Northwest: Caterpillars have left a broken enchanted mirror behind a mask of stone in Verdant Vale.\n- Northeast: Sounds of stoneclaw rogues engaging in a celestial chorus emerge from within an old, abandoned tent in Stony Zigzag.\n- West: An old well is waiting to be explored in Wild Drumlin.\n- East: Hillfolk mystic warriors are known to be crafting tools from stones near bridges made of light on Mossy Embankment.\n- Southwest: Wind dancers and a prairie mage are working to stop a magical anomaly in Majestic Tableland.\n- Southeast: Ridgeback enchanters are constructing a shelter from within a circle of ancient runes in Rolling Ridge."
        ]
    },
    {
        "chunk": 63,
        "pos": 45,
        "terrain": "H",
        "features": "Mossy Embankment",
        "encounter": "You're cautioned about hillfolk mystic warriors that are known to be crafting tools from stones near bridges made of light.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 46,
        "terrain": "H",
        "features": "Craggy Bluff",
        "encounter": "You hear the distant sound of hillfolk scouts listening to the wind.",
        "history": [
            "Hello! How can I assist you in your adventure today?"
        ]
    },
    {
        "chunk": 63,
        "pos": 47,
        "terrain": "P",
        "features": "Quiescent Wold",
        "encounter": "You're cautioned about wildflower nymphs that are known to be whispering secrets of the soil near a field with plants that stick to anything.",
        "history": [
            "- To the northwest, the Calm Basin reflects tales of steppe serpents from another world. The serpents' stories whisper of a time when the islands were a united continent, their scales shimmering with the magical power that once was.\n- Northeast, an Enchanted Thicket beckons. A charming ukulele linked to bobcats resonates with the same magic that once held the continent together. It's said that the bobcats played a role in the grand catastrophe that shattered the land.\n- Westward, the Craggy Bluff overlooks the Quiescent Wold. Hillfolk scouts listen to the wind here, their ears tuned to the whispers of the wildflower nymphs from the wold below.\n- East, the Lonely Steppe is home to time-warping flowers. These flowers mark the gathering place of vast vultures, who celebrate the solstice with rituals that echo the ancient magic of the continent.\n- To the southwest, the Limitless Flatland is marked by the ghostly outline of a massive beast's footprint. This is a legacy of wind-woven wraiths, their tales intertwined with the history of the grand catastrophe.\n- Southeast lies the Scenic Dale, where a stone circle imbued with old magic stands. This site is a testament to the nomadic traders who once roamed the continent, their magic now a part of the land itself."
        ]
    },
    {
        "chunk": 63,
        "pos": 48,
        "terrain": "P",
        "features": "Lonely Steppe",
        "encounter": "The path is littered with a patch of time-warping flowers, a testament to vast vultures gathering for a solstice celebration.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 49,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 50,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 51,
        "terrain": "O",
        "features": "Tranquil Vortex",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 52,
        "terrain": "H",
        "features": "Wavy Butte",
        "encounter": "Among the starfall strawberries, you find a(n) scepter of hill dominion that resonate with adventure.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 53,
        "terrain": "H",
        "features": "Sloping Incline",
        "encounter": "The dense wild chives seems to whisper tales of bouldershade panthers and their assist a village in setting up hillside rainwater harvesting.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 54,
        "terrain": "P",
        "features": "Majestic Tableland",
        "encounter": "There's a legend about wind dancers that aid a prairie mage in stopping a magical anomaly in this area.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 55,
        "terrain": "H",
        "features": "Rolling Ridge",
        "encounter": "You overhear tales of ridgeback enchanters that are constructing a shelter from within a circle of ancient runes.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 56,
        "terrain": "H",
        "features": "Wooded Slope",
        "encounter": "You stumble upon the ruined floating library that hint at burrow goblin chiefs and their quest to assist a village in setting up a hillside zip line.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 57,
        "terrain": "P",
        "features": "Limitless Flatland",
        "encounter": "The area is marked by the ghostly outline of a massive beast's footprint, a legacy of wind-woven wraiths and their tales.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 58,
        "terrain": "P",
        "features": "Scenic Dale",
        "encounter": "You're guided by freshly ground grain, leading to a site with stone circle imbued with old magic of nomadic traders.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 59,
        "terrain": "H",
        "features": "Eroded Bluff",
        "encounter": "The ground bears deserted farmstead from past encounters with hillshade lurkers.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 60,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 61,
        "terrain": "O",
        "features": "Emerald Deep",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 62,
        "terrain": "H",
        "features": "Illuminated Crag",
        "encounter": "Your journey is interrupted by ground that resonates with eerie music, with traces of terrace gnome sorcerers nearby.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 63,
        "terrain": "H",
        "features": "Flourishing Terrace",
        "encounter": "Sounds of bouldershade paladins chasing the northern lights emerge from behind a cluster of wild rose bushes.",
        "history": [
            "Hello! How can I assist you in your adventure today?"
        ]
    },
    {
        "chunk": 63,
        "pos": 64,
        "terrain": "P",
        "features": "Barren Dale",
        "encounter": "The path is littered with signs of golden-maned lions and their interactions with a(n) wand of wonder made from a prairie flower's stem.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 65,
        "terrain": "H",
        "features": "Mounded Crag",
        "encounter": "You're warned of sudden snowfall ahead, where hillcrest druids often are migrating to a higher peak.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 66,
        "terrain": "H",
        "features": "Pleasant Climb",
        "encounter": "You find a(n) discarded scarf that seems out of place, exuding a sense of humility.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 67,
        "terrain": "P",
        "features": "Illuminated Scarp",
        "encounter": "The path is littered with signs of vultures and their interactions with a(n) umbrella of weather protection.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 68,
        "terrain": "P",
        "features": "Dewy Tableland",
        "encounter": "You discover a(n) luminous firefly lantern that seems out of place, hinting at fate-forged foxes.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 69,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 70,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 71,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 72,
        "terrain": "H",
        "features": "Knoll-like Highland",
        "encounter": "A trail of wet stone suggests that rockspire enchantresses were here recently.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 73,
        "terrain": "H",
        "features": "Rolling Bluff",
        "encounter": "Among the starlight clover, a(n) lantern of tracking used by hillfolk rangers catch(es) your eye, exuding a sense of exhilaration.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 74,
        "terrain": "P",
        "features": "Wild Barrens",
        "encounter": "You discover a(n) yew bow carved with symbols of the open sky that seems out of place, hinting at sunlit serpents.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 75,
        "terrain": "H",
        "features": "Wild Highland",
        "encounter": "The primroses hides a(n) gem of earthly clarity, which are said to be linked to bouldershade paladins and their exhilaration.You notice bouldershade paladins that seem to be mourning a lost member.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 76,
        "terrain": "H",
        "features": "Stony Escarpment",
        "encounter": "The path is littered with signs of terracotta warriors and their interactions with a(n) gauntlets of ogre power from a hill giant's stash.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 77,
        "terrain": "P",
        "features": "Dry Depression",
        "encounter": "You stumble upon the ruins of a theater that hint at savannah spirits and their quest to recover the staff of the stormcaller, a weapon of elemental fury.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 78,
        "terrain": "P",
        "features": "Shadowed Veld",
        "encounter": "You sense vulnerability under the open sky as you discover a(n) ornate bone comb linked to grassland giants.",
        "history": [
            "Hello! How can I assist you in your adventure today?"
        ]
    },
    {
        "chunk": 63,
        "pos": 79,
        "terrain": "H",
        "features": "Elevated Bump",
        "encounter": "The ground bears ruined library from past encounters with ridgeview oracles.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 80,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 81,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 82,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 83,
        "terrain": "H",
        "features": "Fringed Foot",
        "encounter": "The scent of honeyed clover fills the air, making you feel resilience.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 84,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 85,
        "terrain": "T",
        "features": "Mystmarina",
        "encounter": "The area is marked by a(n) cloth sack, hinting at the tales of minstrels.",
        "history": [
            "- The cloth sack is intricately embroidered with symbols and scenes that tell a story. Each stitch is a note in a minstrel's song, each image a verse in their tale.\n- The sack contains a variety of items: a broken lute string, a faded songbook, a quill and inkpot. These are the tools of a minstrel, suggesting that one may have passed through or lived here.\n- The sack is found near the Mystmarina, a place known for its enchanting acoustics. Minstrels often come here to compose and perform, their music echoing off the water and stone.\n- The cloth sack may have been left behind by a minstrel as a marker or a memento, a piece of their story left for others to find."
        ]
    },
    {
        "chunk": 63,
        "pos": 86,
        "terrain": "H",
        "features": "Scenic Ravine",
        "encounter": "You're cautioned about turbulent river crossings ahead, where hillshade sprites are known to be studying the stars.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 87,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 88,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 89,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 90,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 91,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 92,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 93,
        "terrain": "H",
        "features": "Thicketed Peak",
        "encounter": "You're filled with vulnerability upon spotting a(n) instrument of the bards echoing hill songs.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 94,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 95,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 96,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 97,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 98,
        "terrain": "O",
        "features": "",
        "encounter": "You feel hopefulness as neptune's nymphs are nestling in nautical nooks near a(n) whirlpool whistle.",
        "history": []
    },
    {
        "chunk": 63,
        "pos": 99,
        "terrain": "O",
        "features": "",
        "encounter": "",
        "history": []
    }
]