[
    {
        "pos": 0,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 1,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 2,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 3,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 4,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 5,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 6,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 7,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 8,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 9,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 10,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 11,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 12,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 13,
        "terrain": "M",
        "features": "Serrated Gorge",
        "encounter": "Strange a shattered and toppled mountain stone archway lie scattered, painting a tale of a family of harpies nesting on rocky ledges that crafting intricate jewelry and ornaments."
    },
    {
        "pos": 14,
        "terrain": "M",
        "features": "Expansive Volcano",
        "encounter": "Navigating through a swarm of voracious mountain locusts devouring vegetation, you're surprised to find a network of tunnels dug by underground creatures filled with a set of worn and weathered standing stones.As you journey forward, you come across a weathered and ancient treasure map, with traces of the tangy aroma of a mountain barbecue feast around them."
    },
    {
        "pos": 15,
        "terrain": "M",
        "features": "Ancient Peak",
        "encounter": "You encounter a band of skilled yeti hunters which are mining precious gemstones and metals."
    },
    {
        "pos": 16,
        "terrain": "M",
        "features": "Snow-capped Peak",
        "encounter": "Ahead, there is a treacherous, hidden mountain crevasse blocking your path. Perhaps it's related to your quest to hunt down a legendary and elusive mountain creature.."
    },
    {
        "pos": 17,
        "terrain": "M",
        "features": "Gleaming Divide",
        "encounter": "A sudden gust brings with it the musky smell of damp moss on mountain rocks. You spot a group of reclusive cloud giants in their mountain fortress that seem to be searching for lost relics and ancient artifacts."
    },
    {
        "pos": 18,
        "terrain": "M",
        "features": "Massive Sierra",
        "encounter": "Surrounded by a field of cotton plants with fluffy bolls at high altitudes, a series of a concealed entrance to a hidden valley reveal traces of a crumbling and overgrown mountain temple entrance, and the distant the soft rustle of mountain pines in the alpine breeze hint at more to discover."
    },
    {
        "pos": 19,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 20,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 21,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 22,
        "terrain": "H",
        "features": "Looming Roll",
        "encounter": "You find a hint leading you to protect a sacred grove from being desecrated by loggers.. But be wary, for a clan of hill giants known for their stone-throwing abilities lurk nearby."
    },
    {
        "pos": 23,
        "terrain": "M",
        "features": "Craggy Crag",
        "encounter": "The presence of a colony of territorial, burrowing mountain rodents makes it difficult to proceed. Perhaps the a pack of ferocious snow wolves nearby can help."
    },
    {
        "pos": 24,
        "terrain": "H",
        "features": "Eroded Tumulus",
        "encounter": "You feel an overwhelming sense of joy as you tread upon a crumbling and half-buried tower, hinting at a tale of a group of elusive elves living in the deep forested hills."
    },
    {
        "pos": 25,
        "terrain": "H",
        "features": "Wild Heights",
        "encounter": "With investigate the theft of valuable minerals from a mining operation. On your mind, the sudden appearance of a massive, carnivorous plant lurking in the grass accompanied by the distant roll of thunder echoing across the hills becomes a challenging diversion."
    },
    {
        "pos": 26,
        "terrain": "M",
        "features": "Sacred Bluff",
        "encounter": "A mysterious the smoky scent of a campfire in the mountain night envelops you, drawing you towards a concealed hideout within a mountain forest where a tribe of gnomish inventors with curious contraptions are blessing the land with fertility and abundance."
    },
    {
        "pos": 27,
        "terrain": "H",
        "features": "Fertile Rise",
        "encounter": "You stumble upon a scene where a family of wild boars foraging for food are engaged in climbing steep slopes to reach their nests around a collection of ancient manuscripts, seemingly crucial for solve the mystery of disappearing livestock in a farming community.."
    },
    {
        "pos": 28,
        "terrain": "H",
        "features": "Hazy Peak",
        "encounter": "From the shadows of the a hidden cache of valuable gemstones and minerals, you sense the presence of a pride of ferocious mountain lions."
    },
    {
        "pos": 29,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 30,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 31,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 32,
        "terrain": "H",
        "features": "Pleasant Highland",
        "encounter": "Trails of a partially buried and cracked sundial wind through the wildflowers in vibrant colors, revealing the past actions of a clan of hill giants known for their stone-throwing abilities."
    },
    {
        "pos": 33,
        "terrain": "H",
        "features": "Barren Mound",
        "encounter": "Surrounded by a grove of birch trees, a series of a hidden tunnel leading to a secluded cavern reveal traces of a collapsed and overgrown homestead, and the distant the rustling of grasses in the hillside breeze hint at more to discover."
    },
    {
        "pos": 34,
        "terrain": "P",
        "features": "Grassy Horizon",
        "encounter": "Peering through the dense a stand of fragrant eucalyptus trees, you catch sight of a bundle of dried and aromatic sage. But be cautious, the gentle rustling of grass in the wind suggest a herd of gentle, woolly sheep tended by shepherds are near."
    },
    {
        "pos": 35,
        "terrain": "H",
        "features": "Bare Slope",
        "encounter": "The a grove of birch trees rustles, revealing a herd of surefooted mountain goats that are embarking on spiritual journeys to sacred peaks."
    },
    {
        "pos": 36,
        "terrain": "H",
        "features": "Misty Climb",
        "encounter": "A herd of surefooted mountain goats gives you a quest to retrieve a stolen tribal totem from a rival clan.In your path lies a piece of exquisite hand-blown glass surrounded by clusters of pine cones on the ground."
    },
    {
        "pos": 37,
        "terrain": "P",
        "features": "Dry Acres",
        "encounter": "You feel an overwhelming sense of gentleness as you tread upon a forgotten, tumbledown windmill, hinting at a tale of a band of itinerant traders and merchants."
    },
    {
        "pos": 38,
        "terrain": "P",
        "features": "Elevated Ridge",
        "encounter": "A sudden gust brings with it the pungent odor of sagebrush on a hot day. You spot a band of itinerant traders and merchants that seem to be exploring ancient ruins and archaeological sites."
    },
    {
        "pos": 39,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 40,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 41,
        "terrain": "O",
        "features": "",
        "encounter": "The ground is littered with the remnants of a ship's broken figurehead. It appears ship-eating barnacles were here recently."
    },
    {
        "pos": 42,
        "terrain": "H",
        "features": "Panoramic Mound",
        "encounter": "Navigating through a treacherous, slippery mudflat, you're surprised to find a concealed chamber within a rocky outcrop filled with a toppled and shattered stone monolith.As you journey forward, you come across a bundle of rare and colorful feathers, with traces of the scent of wild herbs carried on the wind around them."
    },
    {
        "pos": 43,
        "terrain": "H",
        "features": "Rich Slope",
        "encounter": "Among the dense a stand of tall pine trees, you discover a set of exquisite and valuable paintings. You can't shake the feeling of elation."
    },
    {
        "pos": 44,
        "terrain": "P",
        "features": "Breezy Grove",
        "encounter": "A trail of a collapsed, long-abandoned homestead suggests that a flock of colorful, exotic birds with mesmerizing plumage have passed through here on a quest to solve the mystery of disappearing livestock in a farming community.."
    },
    {
        "pos": 45,
        "terrain": "H",
        "features": "Leafy Dell",
        "encounter": "Navigating through a sudden and intense thunderstorm, you're surprised to find a well-hidden alcove in a canyon wall filled with a collapsed and overgrown homestead.As you journey forward, you come across a set of finely crafted pottery, with traces of the crisp scent of frost on a winter morning around them."
    },
    {
        "pos": 46,
        "terrain": "H",
        "features": "Harsh Embankment",
        "encounter": "You see a set of intricate musical instruments that could be useful in your quest to escort a group of settlers to establish a new village in the hills.. But it's guarded by a herd of agile and horned antelopes."
    },
    {
        "pos": 47,
        "terrain": "P",
        "features": "Unspoiled Breadth",
        "encounter": "You hear the chirping of crickets in the warm evening air coming from a camouflaged pit trap with a wooden cover."
    },
    {
        "pos": 48,
        "terrain": "F",
        "features": "Teeming Fern",
        "encounter": "You find a hint leading you to hunt down a legendary and elusive forest creature.. But be wary, for a family of raccoons exploring the underbrush lurk nearby."
    },
    {
        "pos": 49,
        "terrain": "O",
        "features": "Tempestuous ['Main']",
        "encounter": ""
    },
    {
        "pos": 50,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 51,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 52,
        "terrain": "H",
        "features": "Verdant Dale",
        "encounter": "You uncover a fallen and forgotten wind chime that tell a story of a time when a clan of centaurs known for their archery skills pursued investigate the theft of valuable minerals from a mining operation.."
    },
    {
        "pos": 53,
        "terrain": "H",
        "features": "Solitary Knoll",
        "encounter": "You feel optimism as the chirping of grasshoppers in tall grass echo in the distance. Perhaps it's a sign of what's to come."
    },
    {
        "pos": 54,
        "terrain": "P",
        "features": "Undulating Terrace",
        "encounter": "You're guided by the soft the distant yipping of coyotes under a full moon. As you follow, you encounter a group of skilled animal trainers and tamers in the midst of galloping freely across the open plains."
    },
    {
        "pos": 55,
        "terrain": "H",
        "features": "Echoing Climb",
        "encounter": "Deep in thought about retrieve a rare and valuable plant for an ailing herbalist., you're startled by the humming of insects on a warm day. It seems a colony of rock gnomes with intricate underground tunnels are near."
    },
    {
        "pos": 56,
        "terrain": "H",
        "features": "Remote Pinnacle",
        "encounter": "Ahead, there is a maze-like network of burrows created by creatures blocking your path. Perhaps it's related to your quest to track down a missing scouting party lost in the highland forests.."
    },
    {
        "pos": 57,
        "terrain": "F",
        "features": "Thorny Underbrush",
        "encounter": "You come across a tumbledown and forgotten forest barn of an old campsite, the scent of the spicy aroma of wild forest herbs in the air still lingering."
    },
    {
        "pos": 58,
        "terrain": "F",
        "features": "Rugged Woodland",
        "encounter": "Surrounded by clusters of wild berries in the underbrush, a series of a concealed hideout within a dense forest thicket reveal traces of a half-buried and mossy forest stone well, and the distant the gentle whistling of the wind through the trees hint at more to discover."
    },
    {
        "pos": 59,
        "terrain": "O",
        "features": "",
        "encounter": "You stumble upon a rusted, half-buried cutlass indicating past battles."
    },
    {
        "pos": 60,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 61,
        "terrain": "O",
        "features": "Tempestuous ['Mangrove']",
        "encounter": ""
    },
    {
        "pos": 62,
        "terrain": "H",
        "features": "Rich Mound",
        "encounter": "From the shadows of the a burrow in the side of a hill where a reclusive hermit dwells, you sense the presence of a herd of agile and horned antelopes."
    },
    {
        "pos": 63,
        "terrain": "H",
        "features": "Panoramic Brae",
        "encounter": "Hidden among tall and slender stalks of bamboo, you spot a well-preserved ancient weapon glinting in the sunlight."
    },
    {
        "pos": 64,
        "terrain": "P",
        "features": "Mystical Grove",
        "encounter": "Strange a crumbling, half-buried tower lie scattered, painting a tale of a pack of clever and stealthy coyotes that training and honing their combat skills."
    },
    {
        "pos": 65,
        "terrain": "H",
        "features": "Inviting Hillock",
        "encounter": "You see a set of intricately carved runes that could be useful in your quest to investigate reports of strange lights and sounds at an ancient burial mound.. But it's guarded by a family of griffins soaring over the hills."
    },
    {
        "pos": 66,
        "terrain": "H",
        "features": "Windswept Peak",
        "encounter": "You stumble upon a scene where a herd of surefooted mountain goats are engaged in engaging in diplomacy and negotiations with other clans around a piece of ancient pottery with intricate patterns, seemingly crucial for protect a sacred grove from being desecrated by loggers.."
    },
    {
        "pos": 67,
        "terrain": "P",
        "features": "Dry Hollow",
        "encounter": "The whisper of the soft purring of a contented cat is accompanied by the distinct aroma of the sweet scent of ripening fruit in an orchard. It seems a clan of nomadic gnomes skilled in earth magic are involved in engaging in friendly competition and games."
    },
    {
        "pos": 68,
        "terrain": "F",
        "features": "Temperate Meadow",
        "encounter": "Every step forward is met with the increasing intensity of the sweet scent of fresh forest honey in the wild, suggesting the presence of a group of forest-dwelling witches."
    },
    {
        "pos": 69,
        "terrain": "O",
        "features": "Azure ['Swirl']",
        "encounter": ""
    },
    {
        "pos": 70,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 71,
        "terrain": "O",
        "features": "",
        "encounter": "Strange the remnants of a ship's broken mast lie scattered, painting a tale of sarcastic cephalopod that healing wounded sea creatures."
    },
    {
        "pos": 72,
        "terrain": "H",
        "features": "Silhouetted Heights",
        "encounter": "Surrounded by tumbleweeds rolling across the plains, a series of a concealed entrance to a treasure-filled cavern reveal traces of a shattered and ancient mosaic floor, and the distant the distant bleating of sheep in the pasture hint at more to discover."
    },
    {
        "pos": 73,
        "terrain": "H",
        "features": "Secluded Embankment",
        "encounter": "The way forward is blocked by a clan of territorial centaurs blocking passage, but you notice a concealed cave entrance obscured by vines that might lead around it."
    },
    {
        "pos": 74,
        "terrain": "T",
        "features": "Dragon's Roar Port",
        "encounter": "The way forward is blocked by a treacherous, slippery town street, but you notice a secret passage beneath the town's bakery that might lead around it."
    },
    {
        "pos": 75,
        "terrain": "H",
        "features": "Elevated Plateau",
        "encounter": "You see a set of finely crafted pottery that could be useful in your quest to help a tribe of forest creatures negotiate a truce with a rival clan.. But it's guarded by a colony of rock gnomes with intricate underground tunnels."
    },
    {
        "pos": 76,
        "terrain": "H",
        "features": "Panoramic Highland",
        "encounter": "You feel curiosity as the soft rustling of leaves in the gentle breeze echo in the distance. Perhaps it's a sign of what's to come."
    },
    {
        "pos": 77,
        "terrain": "P",
        "features": "Timeless Tundra",
        "encounter": "You spot a weathered and ancient stone obelisk nestled among a carpet of clover beneath oak trees, but the unsettling feeling of curiosity makes you wary."
    },
    {
        "pos": 78,
        "terrain": "P",
        "features": "Flat Pasture",
        "encounter": "Your way is impeded by a wide and treacherous chasm. As you contemplate a way around, you hear the gentle gurgling of a babbling brook from the shadows."
    },
    {
        "pos": 79,
        "terrain": "H",
        "features": "Picturesque Highland",
        "encounter": "Among the dense thick patches of clover, you discover a stack of hand-drawn maps and parchments. You can't shake the feeling of unity."
    },
    {
        "pos": 80,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 81,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 82,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 83,
        "terrain": "H",
        "features": "Alluring Escarpment",
        "encounter": "You notice a stand of tall, ancient redwoods moving subtly. Upon closer inspection, you see a clan of wise and reclusive hermit wizards that are participating in grand feasts and celebrations."
    },
    {
        "pos": 84,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 85,
        "terrain": "H",
        "features": "Lonely Heights",
        "encounter": "A sudden the chirping of grasshoppers in tall grass breaks the silence, making the nearby prairie grasses with seed heads quiver."
    },
    {
        "pos": 86,
        "terrain": "H",
        "features": "Secluded Ascent",
        "encounter": "Navigating through a maze-like network of burrows created by creatures, you're surprised to find a hidden hollow beneath a field of wildflowers filled with a crumbling and half-buried tower.As you journey forward, you come across a bundle of rare and colorful feathers, with traces of the sweet fragrance of wild herbs on the wind around them."
    },
    {
        "pos": 87,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 88,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 89,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 90,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 91,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 92,
        "terrain": "O",
        "features": "Majestic ['Tide']",
        "encounter": ""
    },
    {
        "pos": 93,
        "terrain": "H",
        "features": "Golden Plateau",
        "encounter": "Surrounded by clusters of yucca plants, a series of a concealed chamber within a windswept hill reveal traces of a crumbling and overgrown temple entrance, and the distant the rustling of small mammals in the underbrush hint at more to discover."
    },
    {
        "pos": 94,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 95,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 96,
        "terrain": "H",
        "features": "Leafy Bank",
        "encounter": "The low-lying moss and lichen rustles, revealing a tribe of gnomish inventors with curious contraptions that are embarking on long migrations to find fertile lands."
    },
    {
        "pos": 97,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 98,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 99,
        "terrain": "O",
        "features": "",
        "encounter": ""
    }
]