[
    {
        "pos": 0,
        "terrain": "O",
        "features": "Roaring ['Estuary']",
        "encounter": ""
    },
    {
        "pos": 1,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 2,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 3,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 4,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 5,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 6,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 7,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 8,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 9,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 10,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 11,
        "terrain": "O",
        "features": "",
        "encounter": "You see a message in a bottle that could be useful in your quest to investigate a series of shipwrecks caused by a vengeful ghost ship.. But it's guarded by tidal wave elementals."
    },
    {
        "pos": 12,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 13,
        "terrain": "H",
        "features": "Slopey Descent",
        "encounter": "You stumble upon a shattered and ancient mosaic floor indicating past battles."
    },
    {
        "pos": 14,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 15,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 16,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 17,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 18,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 19,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 20,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 21,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 22,
        "terrain": "H",
        "features": "Serrated Plateau",
        "encounter": "Your journey leads you to a a vast, scorching desert with no water in sight. As you approach, a tribe of friendly centaurs skilled in herbalism nurturing their young and teaching them survival skills."
    },
    {
        "pos": 23,
        "terrain": "H",
        "features": "Sparse Elevation",
        "encounter": "The ground is littered with a set of fading and illegible inscriptions. It appears a nomadic tribe of goat herders were here recently."
    },
    {
        "pos": 24,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 25,
        "terrain": "H",
        "features": "Dominant Mound",
        "encounter": "Your journey leads you to a a vast, open plain with no cover from the sun. As you approach, a family of giant hawks nesting in the cliffs trading valuable resources with neighboring tribes."
    },
    {
        "pos": 26,
        "terrain": "H",
        "features": "Silhouetted Foothill",
        "encounter": "You encounter a family of griffins soaring over the hills which are honoring their ancestors through ceremonial rituals."
    },
    {
        "pos": 27,
        "terrain": "P",
        "features": "Stony Downs",
        "encounter": "A trail of a ruined, overgrown castle wall suggests that a family of giant armadillos rolling through the grasslands have passed through here on a quest to help a group of hunters take down a dangerous beast that threatens the plains.."
    },
    {
        "pos": 28,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 29,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 30,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 31,
        "terrain": "H",
        "features": "Hazy Mound",
        "encounter": "An eerie the soft sigh of the wind through rocky hills resonates from a hidden grotto behind a curtain of cascading water, and the scent of the smoky scent of a blacksmith's forge fills the air."
    },
    {
        "pos": 32,
        "terrain": "H",
        "features": "Serrated Knoll",
        "encounter": "The presence of a massive, ancient burial mound makes it difficult to proceed. Perhaps the a family of giant hawks nesting in the cliffs nearby can help."
    },
    {
        "pos": 33,
        "terrain": "H",
        "features": "Imposing Bank",
        "encounter": "From the shadows of the a network of tunnels dug by creatures beneath the hills, you sense the presence of a group of skilled miners extracting precious minerals."
    },
    {
        "pos": 34,
        "terrain": "T",
        "features": "Seahaven Shoreline Village",
        "encounter": "Hidden among clusters of dandelions in town meadows, you spot a dusty and ancient town map glinting in the sunlight."
    },
    {
        "pos": 35,
        "terrain": "H",
        "features": "Shaded Embankment",
        "encounter": "The air is filled with the smell of the pungent odor of sagebrush in the breeze. You feel a sense of contentment."
    },
    {
        "pos": 36,
        "terrain": "P",
        "features": "Rich Breadth",
        "encounter": "You stumble upon a scene where a herd of gentle, woolly sheep tended by shepherds are engaged in participating in grand feasts and celebrations around a traditional hunting spear, seemingly crucial for help a struggling farming family protect their crops from pests.."
    },
    {
        "pos": 37,
        "terrain": "P",
        "features": "Vast Range",
        "encounter": "You find a hint leading you to help a group of hunters take down a dangerous beast that threatens the plains.. But be wary, for a family of giant tortoises slowly moving across the plains lurk nearby."
    },
    {
        "pos": 38,
        "terrain": "O",
        "features": "",
        "encounter": "The ground is littered with a damaged, half-buried treasure map scroll. It appears giant clams were here recently."
    },
    {
        "pos": 39,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 40,
        "terrain": "M",
        "features": "Ancient Gorge",
        "encounter": "You feel unity as the bubbling of a crystal-clear mountain spring echo in the distance. Perhaps it's a sign of what's to come."
    },
    {
        "pos": 41,
        "terrain": "M",
        "features": "Towering Gorge",
        "encounter": "Your senses are overwhelmed by simplicity as you uncover a bundle of rare and magical scrolls hidden within dense, knee-high alpine ferns."
    },
    {
        "pos": 42,
        "terrain": "M",
        "features": "Dramatic Saddle",
        "encounter": "The ground is littered with a half-buried and mossy mountain stone well. It appears a tribe of centaurs skilled in herbalism were here recently."
    },
    {
        "pos": 43,
        "terrain": "H",
        "features": "Shaded Pinnacle",
        "encounter": "A distant the distant barking of a watchful dog draws your attention. Following it, you discover a decaying and half-buried anchor of a past event."
    },
    {
        "pos": 44,
        "terrain": "P",
        "features": "Vast Savannah",
        "encounter": "You're guided by the soft the buzz of bees collecting nectar from wildflowers. As you follow, you encounter a family of giant tortoises slowly moving across the plains in the midst of blessing the land with fertility and abundance."
    },
    {
        "pos": 45,
        "terrain": "H",
        "features": "High Ridge",
        "encounter": "Strange a shattered and toppled watchtower lie scattered, painting a tale of a group of crafty goblins hiding in rocky caves that taming and riding surefooted mountain goats."
    },
    {
        "pos": 46,
        "terrain": "M",
        "features": "Formidable Apex",
        "encounter": "Your senses are overwhelmed by fascination as you uncover a carved wooden totem adorned with feathers hidden within clusters of ferns in the shade of mountain forests."
    },
    {
        "pos": 47,
        "terrain": "H",
        "features": "Unspoiled Hillock",
        "encounter": "The whisper of the gentle splashing of water in a hillside stream is accompanied by the distinct aroma of the smoky scent of a blacksmith's forge. It seems a clan of wise and reclusive hermit wizards are involved in foraging for edible plants and herbs."
    },
    {
        "pos": 48,
        "terrain": "P",
        "features": "Windswept Vista",
        "encounter": "Strange a shattered, toppled stone archway lie scattered, painting a tale of a group of mysterious druids performing rituals that blessing the land with fertility and abundance."
    },
    {
        "pos": 49,
        "terrain": "H",
        "features": "Panoramic Crest",
        "encounter": "A mysterious the earthy smell of petrichor after a storm envelops you, drawing you towards a burrow in the side of a hill where a reclusive hermit dwells where a flock of colorful and exotic birds with vibrant plumage are foraging for edible plants and herbs."
    },
    {
        "pos": 50,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 51,
        "terrain": "M",
        "features": "Harsh Saddle",
        "encounter": "Among the dense a grove of alpine birch trees, you discover a stack of ancient and mysterious scrolls. You can't shake the feeling of eagerness."
    },
    {
        "pos": 52,
        "terrain": "M",
        "features": "Sky-high Trench",
        "encounter": "You feel reverence as the rhythmic croak of frogs near a highland pond echo in the distance. Perhaps it's a sign of what's to come."
    },
    {
        "pos": 53,
        "terrain": "H",
        "features": "Bare Ascent",
        "encounter": "Navigating through a treacherous, sinking bog, you're surprised to find a well-hidden alcove in a canyon wall filled with a collapsed and overgrown homestead.As you journey forward, you come across a collection of finely crafted jewelry, with traces of the smoky aroma of a campfire at night around them."
    },
    {
        "pos": 54,
        "terrain": "P",
        "features": "Idyllic Stretch",
        "encounter": "From the shadows of the a concealed opening in a dense hedge, you sense the presence of centaur warriors patrolling their territory."
    },
    {
        "pos": 55,
        "terrain": "H",
        "features": "Panoramic Knoll",
        "encounter": "You find a hint leading you to retrieve a stolen tribe artifact from a rival nomadic group.. But be wary, for a clan of centaurs known for their archery skills lurk nearby."
    },
    {
        "pos": 56,
        "terrain": "H",
        "features": "Rising Pinnacle",
        "encounter": "Ahead, there is a herd of territorial and aggressive bison blocking your path. Perhaps it's related to your quest to retrieve a stolen tribe artifact from a rival nomadic group.."
    },
    {
        "pos": 57,
        "terrain": "P",
        "features": "Picturesque Steppe",
        "encounter": "A wise and ancient treant protecting the forest's edge emerge from the a concealed tunnel leading to a secret chamber, their intent focused on a set of hand-carved wooden figurines."
    },
    {
        "pos": 58,
        "terrain": "P",
        "features": "Rich Land",
        "encounter": "Trails of a tattered and forgotten battle flag wind through the clusters of ferns in the shade, revealing the past actions of a family of giant armadillos rolling through the grasslands."
    },
    {
        "pos": 59,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 60,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 61,
        "terrain": "M",
        "features": "Misty Base",
        "encounter": "Your senses are overwhelmed by curiosity as you uncover a set of intricate musical instruments hidden within tall, slender blades of marsh grass in alpine wetlands."
    },
    {
        "pos": 62,
        "terrain": "M",
        "features": "Stony Saddle",
        "encounter": "You encounter a family of alpine dwarves known for their mining which are guarding their territory from intruders."
    },
    {
        "pos": 63,
        "terrain": "H",
        "features": "Fertile Embankment",
        "encounter": "You feel serenity as the soft murmur of a hidden stream echo in the distance. Perhaps it's a sign of what's to come."
    },
    {
        "pos": 64,
        "terrain": "P",
        "features": "Endless Vale",
        "encounter": "A path surrounded by clusters of pine cones on the ground leads to a clearing with a partially buried, ancient treasure chest, indicating a colony of burrowing creatures building underground tunnels have been here."
    },
    {
        "pos": 65,
        "terrain": "H",
        "features": "Dominant Roll",
        "encounter": "A trail of a shattered and toppled stone archway suggests that a group of nomadic merchants trading rare goods have passed through here on a quest to help a group of hunters take down a dangerous beast threatening the hills.."
    },
    {
        "pos": 66,
        "terrain": "M",
        "features": "Picturesque Cirque",
        "encounter": "Ahead, there is a dense swarm of stinging mountain insects blocking your path. Perhaps it's related to your quest to protect a rare and valuable gemstone deposit from poachers.."
    },
    {
        "pos": 67,
        "terrain": "P",
        "features": "Breezy Pasture",
        "encounter": "Hidden among a field of sunflowers, you spot a primitive map marked with enigmatic symbols glinting in the sunlight."
    },
    {
        "pos": 68,
        "terrain": "H",
        "features": "Rugged Peak",
        "encounter": "Your way is impeded by a deep, hidden pit trap. As you contemplate a way around, you hear the soft purring of a contented cat from the shadows."
    },
    {
        "pos": 69,
        "terrain": "M",
        "features": "Elevated Notch",
        "encounter": "The whisper of the soft sigh of the wind through high mountain peaks is accompanied by the distinct aroma of the sweet fragrance of alpine wildflowers. It seems a tribe of goliaths living in high-altitude villages are involved in flying gracefully through mountain valleys."
    },
    {
        "pos": 70,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 71,
        "terrain": "M",
        "features": "Sky-high Vista",
        "encounter": "The whisper of the distant drumming of a woodpecker is accompanied by the distinct aroma of the tangy scent of a mountain creek or stream. It seems a herd of surefooted mountain ibex are involved in mining valuable minerals from the mountains."
    },
    {
        "pos": 72,
        "terrain": "M",
        "features": "Resilient Col",
        "encounter": "You stumble upon a fallen and forgotten mountain wind chime indicating past battles."
    },
    {
        "pos": 73,
        "terrain": "P",
        "features": "Golden Tundra",
        "encounter": "The wildflowers in vibrant colors rustles, revealing a colony of giant, burrowing insects with crystalline exoskeletons that are galloping freely across the open plains."
    },
    {
        "pos": 74,
        "terrain": "P",
        "features": "Wild Pasture",
        "encounter": "A wise old owl with the gift of prophecy gives you a quest to retrieve a lost artifact hidden deep within a dangerous canyon.In your path lies a weathered and ancient stone obelisk surrounded by moss-covered rocks."
    },
    {
        "pos": 75,
        "terrain": "F",
        "features": "Muggy Den",
        "encounter": "A clan of forest nymphs dancing in the moonlight emerge from the a hidden path through dense ferns in the woods, their intent focused on a collection of finely crafted forest weapons."
    },
    {
        "pos": 76,
        "terrain": "M",
        "features": "Barren Base",
        "encounter": "A path surrounded by a grove of tall, thin cypress trees at high altitudes leads to a clearing with a set of decaying mountain fence posts, indicating a clan of mountain giants known for their strength have been here."
    },
    {
        "pos": 77,
        "terrain": "P",
        "features": "Vibrant Ridge",
        "encounter": "Surrounded by thick patches of clover, a series of a camouflaged pit trap with a wooden cover reveal traces of a faded and illegible gravestone, and the distant the gentle gurgling of a babbling brook hint at more to discover."
    },
    {
        "pos": 78,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 79,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 80,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 81,
        "terrain": "M",
        "features": "Green Summit",
        "encounter": "Blocked by a towering and impassable mountain cliff wall, your attention is caught by the soft splashing of water along a high-altitude river. Upon investigating, you discover a concealed opening in a thicket of mountain herbs with a bundle of rare and aromatic alpine herbs inside."
    },
    {
        "pos": 82,
        "terrain": "M",
        "features": "Lush Cirque",
        "encounter": "You see a collection of ancient manuscripts that could be useful in your quest to help a reclusive mountain hermit find a rare and elusive herb.. But it's guarded by a majestic dragon nesting high in the peaks."
    },
    {
        "pos": 83,
        "terrain": "H",
        "features": "Harsh Knoll",
        "encounter": "Your way is impeded by a field of tall, swaying grasses concealing dangers. As you contemplate a way around, you hear the rustling of grasses in the hillside breeze from the shadows."
    },
    {
        "pos": 84,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 85,
        "terrain": "P",
        "features": "Arid Downs",
        "encounter": "The ground trembles slightly, and the humming of insects in the heat of the day grow louder. It seems a family of giant tortoises slowly moving across the plains are on the move."
    },
    {
        "pos": 86,
        "terrain": "M",
        "features": "Untamed Butte",
        "encounter": "A group of agile mountain goats navigating steep cliffs emerge from the a submerged entrance to an underground crystal grotto, their intent focused on a bundle of rare and magical scrolls."
    },
    {
        "pos": 87,
        "terrain": "O",
        "features": "Idyllic ['Shore']",
        "encounter": ""
    },
    {
        "pos": 88,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 89,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 90,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 91,
        "terrain": "M",
        "features": "Dominant Butte",
        "encounter": "A mysterious the fresh, green scent of an alpine pine forest envelops you, drawing you towards a hidden valley surrounded by towering peaks where a tribe of friendly mountain elves skilled in archery are conducting elaborate mating displays and rituals."
    },
    {
        "pos": 92,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 93,
        "terrain": "M",
        "features": "Solitary Bowl",
        "encounter": "Your journey leads you to a a sudden and intense mountain blizzard. As you approach, a colony of territorial marmots with intricate burrows conducting elaborate mating displays and rituals."
    },
    {
        "pos": 94,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 95,
        "terrain": "H",
        "features": "Dominant Dune",
        "encounter": "The way forward is blocked by a vast, unforgiving salt flat, but you notice a concealed entrance to a hidden cave behind a waterfall that might lead around it."
    },
    {
        "pos": 96,
        "terrain": "O",
        "features": "Tempestuous ['Estuary']",
        "encounter": ""
    },
    {
        "pos": 97,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 98,
        "terrain": "O",
        "features": "Unfathomable ['Harbor']",
        "encounter": "Navigating through a coral reef with sharp, hidden edges, you're surprised to find a labyrinthine coral labyrinth with hidden treasures filled with the remnants of a ship's wheel half-buried in the sand.As you journey forward, you come across a sunken ship's anchor, with traces of fishy odor of the ocean depths around them."
    },
    {
        "pos": 99,
        "terrain": "O",
        "features": "",
        "encounter": ""
    }
]