[
    {
        "pos": 0,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 1,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 2,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 3,
        "terrain": "O",
        "features": "Endless ['Wave']",
        "encounter": ""
    },
    {
        "pos": 4,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 5,
        "terrain": "O",
        "features": "Windswept ['Bay']",
        "encounter": ""
    },
    {
        "pos": 6,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 7,
        "terrain": "O",
        "features": "Turbulent ['Passage']",
        "encounter": ""
    },
    {
        "pos": 8,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 9,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 10,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 11,
        "terrain": "O",
        "features": "",
        "encounter": "Your way is impeded by a tidal wave approaching with destructive force. As you contemplate a way around, you hear murmuring of merfolk singing in harmony from the shadows."
    },
    {
        "pos": 12,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 13,
        "terrain": "H",
        "features": "Idyllic Crest",
        "encounter": "You encounter a clan of nomadic halflings traveling in hillside caravans which are engaging in friendly competitions and games."
    },
    {
        "pos": 14,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 15,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 16,
        "terrain": "H",
        "features": "Towering Knoll",
        "encounter": "Strange a crumbling and abandoned well lie scattered, painting a tale of a colony of burrowing creatures with intricate tunnel systems that guarding their territory from intruders."
    },
    {
        "pos": 17,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 18,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 19,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 20,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 21,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 22,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 23,
        "terrain": "H",
        "features": "Echoing Heights",
        "encounter": "A path surrounded by a grove of twisted juniper trees leads to a clearing with a crumbling and abandoned well, indicating a flock of colorful and exotic birds with vibrant plumage have been here."
    },
    {
        "pos": 24,
        "terrain": "O",
        "features": "",
        "encounter": "You uncover a partially buried, broken spyglass that tell a story of a time when tidal wave elementals pursued retrieve a lost, enchanted trident from a sunken temple.."
    },
    {
        "pos": 25,
        "terrain": "H",
        "features": "Ancient Heights",
        "encounter": "A mysterious the crisp scent of fallen leaves in autumn envelops you, drawing you towards a hidden path through dense thickets and shrubs where a colony of rock-dwelling bats are hunting for elusive game in the rocky terrain."
    },
    {
        "pos": 26,
        "terrain": "T",
        "features": "Marinatown Pointe",
        "encounter": "The air is filled with the smell of the floral fragrance of town flower shops. You feel a sense of excitement."
    },
    {
        "pos": 27,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 28,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 29,
        "terrain": "O",
        "features": "Roaring ['Plateau']",
        "encounter": ""
    },
    {
        "pos": 30,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 31,
        "terrain": "O",
        "features": "",
        "encounter": "The presence of a sandbar hiding just below the water's surface makes it difficult to proceed. Perhaps the sea witches nearby can help."
    },
    {
        "pos": 32,
        "terrain": "H",
        "features": "Idyllic Decline",
        "encounter": "A path surrounded by clusters of yucca plants leads to a clearing with a shattered and ancient mosaic floor, indicating a band of hill giants causing trouble for nearby villages have been here."
    },
    {
        "pos": 33,
        "terrain": "H",
        "features": "Secluded Peak",
        "encounter": "The ground trembles slightly, and the soft sigh of the wind through rocky hills grow louder. It seems a band of itinerant herbalists and healers are on the move."
    },
    {
        "pos": 34,
        "terrain": "P",
        "features": "Distant Vale",
        "encounter": "You stumble upon a shattered, long-abandoned watchtower indicating past battles."
    },
    {
        "pos": 35,
        "terrain": "H",
        "features": "Golden Tumulus",
        "encounter": "A mysterious the sweet, vanilla-like scent of cedarwood envelops you, drawing you towards a concealed hideaway among ancient stone ruins where a pack of elusive timberwolves are engaging in friendly competitions and games."
    },
    {
        "pos": 36,
        "terrain": "H",
        "features": "Imposing Brae",
        "encounter": "The air is filled with the smell of the musky smell of damp moss on rocks. You feel a sense of gentleness."
    },
    {
        "pos": 37,
        "terrain": "P",
        "features": "Rippling Breadth",
        "encounter": "You notice clusters of ferns in the shade moving subtly. Upon closer inspection, you see a tribe of friendly and nature-loving elves that are tending to their herds of domesticated animals."
    },
    {
        "pos": 38,
        "terrain": "P",
        "features": "Lonely Knoll",
        "encounter": "You see a stack of handwoven baskets that could be useful in your quest to investigate the theft of a valuable cattle herd by rustlers.. But it's guarded by a group of mysterious druids performing rituals."
    },
    {
        "pos": 39,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 40,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 41,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 42,
        "terrain": "H",
        "features": "Solitary Terrace",
        "encounter": "A pack of territorial mountain lions emerge from the a hidden path through dense thickets and shrubs, their intent focused on a bundle of aromatic and healing plants."
    },
    {
        "pos": 43,
        "terrain": "H",
        "features": "Remote Ridge",
        "encounter": "You find a hint leading you to retrieve a stolen tribe artifact from a rival nomadic group.. But be wary, for a nomadic tribe of goat herders lurk nearby."
    },
    {
        "pos": 44,
        "terrain": "F",
        "features": "Boundless Canopy",
        "encounter": "The way forward is blocked by a sudden and unpredictable forest sinkhole, but you notice a concealed entrance to an ancient forest labyrinth that might lead around it."
    },
    {
        "pos": 45,
        "terrain": "H",
        "features": "Ancient Rise",
        "encounter": "A mysterious the pungent odor of sagebrush in the breeze envelops you, drawing you towards a concealed cave entrance obscured by vines where a herd of agile and horned antelopes are trading valuable resources with neighboring tribes."
    },
    {
        "pos": 46,
        "terrain": "H",
        "features": "Looming Summit",
        "encounter": "The presence of a dense, choking fog shrouding the landscape makes it difficult to proceed. Perhaps the a band of traveling bards and minstrels nearby can help."
    },
    {
        "pos": 47,
        "terrain": "P",
        "features": "Pleasant Dell",
        "encounter": "You see a collection of rare and colorful feathers that could be useful in your quest to escort a group of pilgrims to a sacred site in the plains.. But it's guarded by a band of traveling minstrels and bards."
    },
    {
        "pos": 48,
        "terrain": "P",
        "features": "Fresh Dale",
        "encounter": "You encounter a friendly clan of halfling farmers which are nurturing their young and teaching them survival skills."
    },
    {
        "pos": 49,
        "terrain": "O",
        "features": "",
        "encounter": "Every step forward is met with the increasing intensity of rich, earthy scent of wet sand, suggesting the presence of giant sea turtles."
    },
    {
        "pos": 50,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 51,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 52,
        "terrain": "H",
        "features": "Towering Summit",
        "encounter": "Navigating through a colony of venomous spiders weaving webs, you're surprised to find a concealed chamber within a windswept hill filled with a set of worn and weathered standing stones.As you journey forward, you come across a collection of polished gemstones, with traces of the sweet scent of fresh honey in the hills around them."
    },
    {
        "pos": 53,
        "terrain": "H",
        "features": "Eroded Dell",
        "encounter": "The way forward is blocked by a sudden and intense thunderstorm, but you notice a hidden campsite in the midst of a highland forest that might lead around it."
    },
    {
        "pos": 54,
        "terrain": "P",
        "features": "Breezy Moor",
        "encounter": "Your path is illuminated by the glint of a collection of tribal tattoos and body art. However, a clan of nomadic halfling herbalists stand guard, their intentions unknown."
    },
    {
        "pos": 55,
        "terrain": "H",
        "features": "Hazy Roll",
        "encounter": "You encounter a family of hill dwarves skilled in blacksmithing which are searching for lost relics and ancient artifacts."
    },
    {
        "pos": 56,
        "terrain": "H",
        "features": "Humped Hillock",
        "encounter": "You're guided by the soft the soft splashing of water at a river's edge. As you follow, you encounter a reclusive hermit living in a hidden hillside cottage in the midst of singing traditional songs and sharing stories around a campfire."
    },
    {
        "pos": 57,
        "terrain": "P",
        "features": "Bountiful Grove",
        "encounter": "You feel reverence as the distant mooing of cattle echo in the distance. Perhaps it's a sign of what's to come."
    },
    {
        "pos": 58,
        "terrain": "P",
        "features": "Serene Savannah",
        "encounter": "You stumble upon a set of decaying, wooden fence posts indicating past battles."
    },
    {
        "pos": 59,
        "terrain": "O",
        "features": "Unspoiled ['Estuary']",
        "encounter": ""
    },
    {
        "pos": 60,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 61,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 62,
        "terrain": "H",
        "features": "Dappled Brae",
        "encounter": "Strange a tumbledown and forgotten barn lie scattered, painting a tale of a wise and ancient treant guarding a sacred grove that practicing their magical abilities in secluded groves."
    },
    {
        "pos": 63,
        "terrain": "H",
        "features": "Rich Pinnacle",
        "encounter": "Strange a toppled and vine-covered statue lie scattered, painting a tale of a group of nomadic merchants trading rare goods that foraging for edible plants and herbs."
    },
    {
        "pos": 64,
        "terrain": "P",
        "features": "Ancient Breadth",
        "encounter": "Every step forward is met with the increasing intensity of the earthy smell of animal fur, suggesting the presence of a flock of colorful, exotic birds with mesmerizing plumage."
    },
    {
        "pos": 65,
        "terrain": "H",
        "features": "Verdant Crest",
        "encounter": "A sudden the crackling of leaves underfoot in the forest breaks the silence, making the nearby a field of sunflowers quiver."
    },
    {
        "pos": 66,
        "terrain": "H",
        "features": "Eroded Heights",
        "encounter": "You uncover a crumbling and overgrown temple entrance that tell a story of a time when a herd of agile and horned antelopes pursued help a group of hunters take down a dangerous beast threatening the hills.."
    },
    {
        "pos": 67,
        "terrain": "P",
        "features": "Sparse Prairie",
        "encounter": "Your senses are overwhelmed by calmness as you uncover a stack of intricately woven tapestries hidden within clusters of aromatic herbs."
    },
    {
        "pos": 68,
        "terrain": "P",
        "features": "Vast Acres",
        "encounter": "You notice a stand of fragrant eucalyptus trees moving subtly. Upon closer inspection, you see a group of wise and reclusive hermit wizards that are conducting elaborate mating displays and rituals."
    },
    {
        "pos": 69,
        "terrain": "O",
        "features": "Limitless ['Jetty']",
        "encounter": "A trail of barnacle-covered remnants of a wooden chest suggests that giant sea turtles have passed through here on a quest to search for a hidden cove rumored to contain pirate treasure.."
    },
    {
        "pos": 70,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 71,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 72,
        "terrain": "H",
        "features": "Foggy Slope",
        "encounter": "Your senses are overwhelmed by freedom as you uncover a bundle of rare and magical scrolls hidden within a field of sunflowers."
    },
    {
        "pos": 73,
        "terrain": "H",
        "features": "Rugged Summit",
        "encounter": "Strange a decaying and half-buried anchor lie scattered, painting a tale of a clan of wise and reclusive hermit wizards that engaging in diplomacy and negotiations with other clans."
    },
    {
        "pos": 74,
        "terrain": "F",
        "features": "Wet Ravine",
        "encounter": "Navigating through a colony of territorial, burrowing woodland rodents, you're surprised to find a hidden grove surrounded by towering trees filled with a moss-covered and ancient forest altar.As you journey forward, you come across a bundle of enchanted forest crystals, with traces of the sweet aroma of forest herbs on the breeze around them."
    },
    {
        "pos": 75,
        "terrain": "H",
        "features": "Tranquil Ascent",
        "encounter": "You're guided by the soft the soft splashing of water at a river's edge. As you follow, you encounter a clan of hardy dwarves mining deep in the hills in the midst of constructing sturdy hillside homes and fortifications."
    },
    {
        "pos": 76,
        "terrain": "H",
        "features": "Undulating Ascent",
        "encounter": "Ahead, there is a treacherous, hidden crevasse blocking your path. Perhaps it's related to your quest to defend a peaceful group of forest creatures from an encroaching threat.."
    },
    {
        "pos": 77,
        "terrain": "P",
        "features": "Sparse Land",
        "encounter": "Your path is illuminated by the glint of a ceremonial staff adorned with feathers and beads. However, a wise and ancient treant protecting the forest's edge stand guard, their intentions unknown."
    },
    {
        "pos": 78,
        "terrain": "P",
        "features": "Distant Expanse",
        "encounter": "You see a carved totem animal figurine that could be useful in your quest to help a struggling farming family protect their crops from pests.. But it's guarded by a herd of majestic unicorns grazing peacefully."
    },
    {
        "pos": 79,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 80,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 81,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 82,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 83,
        "terrain": "H",
        "features": "Rich Hillock",
        "encounter": "You uncover a decaying and half-buried anchor that tell a story of a time when a group of nomadic merchants trading rare goods pursued rescue a group of trapped miners in a collapsed tunnel.."
    },
    {
        "pos": 84,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 85,
        "terrain": "H",
        "features": "Dominant Dale",
        "encounter": "You stumble upon a scene where a pack of wily coyotes scavenging for food are engaged in hunting for elusive game in the rocky terrain around a well-preserved set of animal bones, seemingly crucial for defend a village from an approaching swarm of locusts.."
    },
    {
        "pos": 86,
        "terrain": "H",
        "features": "Harsh Slope",
        "encounter": "You see a set of finely crafted climbing gear that could be useful in your quest to rescue a kidnapped child taken by a clan of underground dwellers.. But it's guarded by a pack of territorial mountain lions."
    },
    {
        "pos": 87,
        "terrain": "O",
        "features": "Daunting ['Gulf']",
        "encounter": ""
    },
    {
        "pos": 88,
        "terrain": "O",
        "features": "Soothing ['Reef']",
        "encounter": "You uncover the remnants of a sunken merchant ship's cargo that tell a story of a time when underwater nomads pursued search for a hidden cove rumored to contain pirate treasure.."
    },
    {
        "pos": 89,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 90,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 91,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 92,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 93,
        "terrain": "O",
        "features": "Majestic ['Tide']",
        "encounter": ""
    },
    {
        "pos": 94,
        "terrain": "O",
        "features": "",
        "encounter": "You find a hint leading you to help a stranded sailor repair their ship and return home.. But be wary, for sea anemone sorcerers lurk nearby."
    },
    {
        "pos": 95,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 96,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 97,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 98,
        "terrain": "O",
        "features": "Silent ['Spring']",
        "encounter": ""
    },
    {
        "pos": 99,
        "terrain": "O",
        "features": "",
        "encounter": ""
    }
]