[
    {
        "pos": 0,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 1,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 2,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 3,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 4,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 5,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 6,
        "terrain": "H",
        "features": "Inviting Rise",
        "encounter": "Blocked by a patch of quicksand hidden beneath the surface, your attention is caught by the bubbling of a natural spring. Upon investigating, you discover a secret tunnel leading to an underground chamber with a collection of mysterious fossils inside."
    },
    {
        "pos": 7,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 8,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 9,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 10,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 11,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 12,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 13,
        "terrain": "H",
        "features": "Slopey Roll",
        "encounter": "You hear the soft purring of a contented cat coming from a burrow in the side of a hill where a reclusive hermit dwells."
    },
    {
        "pos": 14,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 15,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 16,
        "terrain": "H",
        "features": "Low Decline",
        "encounter": "A colony of rock-dwelling bats gives you a quest to escort a group of pilgrims to a sacred site in the hills.In your path lies a collection of mysterious fossils surrounded by dense, knee-high ferns."
    },
    {
        "pos": 17,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 18,
        "terrain": "O",
        "features": "",
        "encounter": "With investigate reports of disappearing ships in a cursed sea. On your mind, the sudden appearance of a sandbar hiding just below the water's surface accompanied by seagulls cawing in the distance becomes a challenging diversion."
    },
    {
        "pos": 19,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 20,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 21,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 22,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 23,
        "terrain": "H",
        "features": "Rugged Crest",
        "encounter": "You notice prairie grasses with seed heads moving subtly. Upon closer inspection, you see a herd of agile and horned antelopes that are conducting trade with traveling merchants and caravans."
    },
    {
        "pos": 24,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 25,
        "terrain": "H",
        "features": "Barren Embankment",
        "encounter": "Your journey leads you to a a vast, open plain with no cover from the sun. As you approach, a group of crafty goblins hiding in rocky caves foraging for edible plants and herbs."
    },
    {
        "pos": 26,
        "terrain": "H",
        "features": "Majestic Bank",
        "encounter": "Hidden among a dense canopy of oak trees, you spot a bundle of rare and colorful feathers glinting in the sunlight."
    },
    {
        "pos": 27,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 28,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 29,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 30,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 31,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 32,
        "terrain": "H",
        "features": "Hazy Roll",
        "encounter": "You find a hint leading you to solve the mystery of a cursed meadow that kills all plant life.. But be wary, for a clan of hill giants known for their stone-throwing abilities lurk nearby."
    },
    {
        "pos": 33,
        "terrain": "H",
        "features": "Tree-covered Knoll",
        "encounter": "Deep in thought about solve the mystery of disappearing travelers on a dangerous road., you're startled by the chirping of young birds in their nests. It seems a family of wild boars foraging for food are near."
    },
    {
        "pos": 34,
        "terrain": "P",
        "features": "Pleasant Prairie",
        "encounter": "You come across a half-buried, mossy stone well of an old campsite, the scent of the spicy aroma of wild cinnamon still lingering."
    },
    {
        "pos": 35,
        "terrain": "H",
        "features": "Resplendent Pinnacle",
        "encounter": "The whisper of the soothing sound of a bubbling brook is accompanied by the distinct aroma of the musky smell of damp moss on rocks. It seems a reclusive hermit living in a hidden hillside cottage are involved in trading valuable resources with neighboring tribes."
    },
    {
        "pos": 36,
        "terrain": "H",
        "features": "Rocky Upland",
        "encounter": "You come across a toppled and shattered stone monolith of an old campsite, the scent of the tangy scent of sun-warmed rocks still lingering."
    },
    {
        "pos": 37,
        "terrain": "F",
        "features": "Alive Grove",
        "encounter": "You feel an overwhelming sense of eagerness as you tread upon a collapsed and overgrown forest monastery, hinting at a tale of a family of enchanted talking animals."
    },
    {
        "pos": 38,
        "terrain": "T",
        "features": "Marine Haven",
        "encounter": "The ground is littered with a crumbling town watchtower overlooking the town. It appears a wise town sage dispensing advice were here recently."
    },
    {
        "pos": 39,
        "terrain": "H",
        "features": "Towering Terrace",
        "encounter": "You come across a broken and moss-covered wagon wheel of an old campsite, the scent of the musky odor of a hidden animal den still lingering."
    },
    {
        "pos": 40,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 41,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 42,
        "terrain": "H",
        "features": "Golden Brae",
        "encounter": "You notice sparse patches of desert scrub moving subtly. Upon closer inspection, you see a herd of surefooted mountain goats that are climbing steep slopes to reach their nests."
    },
    {
        "pos": 43,
        "terrain": "H",
        "features": "Unspoiled Pinnacle",
        "encounter": "From the shadows of the a concealed entrance to a treasure-filled cavern, you sense the presence of a family of griffins soaring over the hills."
    },
    {
        "pos": 44,
        "terrain": "P",
        "features": "Rolling Valley",
        "encounter": "The dandelions scattered in the breeze rustles, revealing a wise and ancient treant protecting the forest's edge that are seeking guidance from wise and ancient elders."
    },
    {
        "pos": 45,
        "terrain": "H",
        "features": "Vibrant Pinnacle",
        "encounter": "Ahead, there is a wide and treacherous chasm blocking your path. Perhaps it's related to your quest to escort a group of settlers to establish a new village in the hills.."
    },
    {
        "pos": 46,
        "terrain": "H",
        "features": "Shaded Climb",
        "encounter": "Hidden among sparse patches of desert wildflowers, you spot a set of intricately beaded necklaces glinting in the sunlight."
    },
    {
        "pos": 47,
        "terrain": "P",
        "features": "Expansive Land",
        "encounter": "The ground is littered with a ruined, overgrown castle wall. It appears a group of reclusive and contemplative monks were here recently."
    },
    {
        "pos": 48,
        "terrain": "F",
        "features": "Enchanted Vale",
        "encounter": "The ground trembles slightly, and the rustling of forest animals in the underbrush grow louder. It seems a group of sentient forest creatures are on the move."
    },
    {
        "pos": 49,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 50,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 51,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 52,
        "terrain": "H",
        "features": "Rolling Crest",
        "encounter": "Your way is impeded by a steep and rocky cliffside. As you contemplate a way around, you hear the bubbling of a natural spring from the shadows."
    },
    {
        "pos": 53,
        "terrain": "H",
        "features": "Dappled Bank",
        "encounter": "The a stand of tall, ancient redwoods rustles, revealing a herd of woolly mountain sheep that are blessing the land with fertility and abundance."
    },
    {
        "pos": 54,
        "terrain": "P",
        "features": "Bright Horizon",
        "encounter": "You stumble upon a scene where a flock of colorful, exotic birds with mesmerizing plumage are engaged in hunting for rare and exotic creatures around a leather-bound journal filled with sketches and notes, seemingly crucial for help a group of hunters take down a dangerous beast that threatens the plains.."
    },
    {
        "pos": 55,
        "terrain": "H",
        "features": "Rising Dell",
        "encounter": "Trails of a tattered and forgotten battle banner wind through the dandelions scattered in the breeze, revealing the past actions of a nomadic band of skilled hunters and trappers."
    },
    {
        "pos": 56,
        "terrain": "H",
        "features": "Majestic Decline",
        "encounter": "Blocked by a colony of venomous spiders weaving webs, your attention is caught by the soft hush of falling snow in winter. Upon investigating, you discover a concealed entrance to a nomadic tribe's camp with a piece of rare and valuable meteorite inside."
    },
    {
        "pos": 57,
        "terrain": "P",
        "features": "Ancient Expanse",
        "encounter": "Your way is impeded by a swarm of voracious locusts devouring vegetation. As you contemplate a way around, you hear the distant mooing of cattle from the shadows."
    },
    {
        "pos": 58,
        "terrain": "P",
        "features": "Undulating Clearing",
        "encounter": "The ground is littered with a fallen, weathered totem pole. It appears a pack of swift and cunning pronghorns were here recently."
    },
    {
        "pos": 59,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 60,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 61,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 62,
        "terrain": "H",
        "features": "Dense Highland",
        "encounter": "The clusters of aromatic herbs rustles, revealing a group of crafty goblins hiding in rocky caves that are searching for hidden caves and treasure troves."
    },
    {
        "pos": 63,
        "terrain": "H",
        "features": "Receding Pinnacle",
        "encounter": "A flock of colorful and exotic birds with vibrant plumage gives you a quest to track down a legendary and elusive beast in the highlands.In your path lies a bundle of rare and aromatic herbs surrounded by sparse patches of desert scrub."
    },
    {
        "pos": 64,
        "terrain": "P",
        "features": "Parched Rise",
        "encounter": "An eerie the soft purring of a contented cat resonates from a secret tunnel leading to a hidden chamber, and the scent of the earthy smell of animal fur fills the air."
    },
    {
        "pos": 65,
        "terrain": "H",
        "features": "Lonely Decline",
        "encounter": "A path surrounded by clumps of prickly pear cacti leads to a clearing with a tattered and forgotten battle banner, indicating a pack of elusive timberwolves have been here."
    },
    {
        "pos": 66,
        "terrain": "H",
        "features": "Idyllic Plateau",
        "encounter": "You see a piece of an ancient and powerful relic that could be useful in your quest to defend a remote settlement from an approaching pack of wolves.. But it's guarded by a colony of rock-dwelling bats."
    },
    {
        "pos": 67,
        "terrain": "P",
        "features": "Green Downs",
        "encounter": "An eerie the chirping of young birds in a nest resonates from a network of underground tunnels used by creatures, and the scent of the pungent smell of a skunk in the distance fills the air."
    },
    {
        "pos": 68,
        "terrain": "F",
        "features": "Fragrant Ravine",
        "encounter": "With protect a herd of rare and endangered forest animals. On your mind, the sudden appearance of a treacherous, sinking forest bog accompanied by the rustling of forest animals in the underbrush becomes a challenging diversion."
    },
    {
        "pos": 69,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 70,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 71,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 72,
        "terrain": "H",
        "features": "Lush Highland",
        "encounter": "The way forward is blocked by a vast, scorching desert with no water in sight, but you notice a hidden cache of valuable gemstones and minerals that might lead around it."
    },
    {
        "pos": 73,
        "terrain": "H",
        "features": "Pleasant Highland",
        "encounter": "Ahead, there is a sudden and intense thunderstorm blocking your path. Perhaps it's related to your quest to retrieve a lost expedition's supplies from a remote canyon.."
    },
    {
        "pos": 74,
        "terrain": "P",
        "features": "Unending Land",
        "encounter": "You come across a partially buried, ancient treasure chest of an old campsite, the scent of the spicy aroma of wild herbs drying in the sun still lingering."
    },
    {
        "pos": 75,
        "terrain": "H",
        "features": "Unspoiled Dale",
        "encounter": "Ahead, there is a wide and treacherous chasm blocking your path. Perhaps it's related to your quest to retrieve a stolen tribal totem from a rival clan.."
    },
    {
        "pos": 76,
        "terrain": "H",
        "features": "Breathtaking Peak",
        "encounter": "The ground trembles slightly, and the distant call of a solitary hawk soaring above grow louder. It seems a family of griffins soaring over the hills are on the move."
    },
    {
        "pos": 77,
        "terrain": "P",
        "features": "Rugged Meadow",
        "encounter": "Strange a forgotten, weathered scarecrow lie scattered, painting a tale of a family of giant tortoises slowly moving across the plains that blessing the land with fertility and abundance."
    },
    {
        "pos": 78,
        "terrain": "P",
        "features": "Unending Pasture",
        "encounter": "Trails of a partially buried, ancient treasure chest wind through the dandelions scattered in the breeze, revealing the past actions of a friendly clan of halfling farmers."
    },
    {
        "pos": 79,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 80,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 81,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 82,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 83,
        "terrain": "H",
        "features": "Wild Incline",
        "encounter": "Trails of a half-buried and rotting rowboat wind through the clusters of pine cones on the ground, revealing the past actions of a family of griffins soaring over the hills."
    },
    {
        "pos": 84,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 85,
        "terrain": "H",
        "features": "Low Slope",
        "encounter": "Strange a set of decaying wooden fence posts lie scattered, painting a tale of a clan of hardy dwarves mining deep in the hills that honoring their ancestors through ceremonial rituals."
    },
    {
        "pos": 86,
        "terrain": "H",
        "features": "Resplendent Foothill",
        "encounter": "Your senses are overwhelmed by peacefulness as you uncover a set of finely crafted climbing gear hidden within low-lying ferns along a riverbank."
    },
    {
        "pos": 87,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 88,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 89,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 90,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 91,
        "terrain": "O",
        "features": "Pristine ['Main']",
        "encounter": ""
    },
    {
        "pos": 92,
        "terrain": "O",
        "features": "",
        "encounter": "The presence of a massive, floating tree trunk in the ship's path makes it difficult to proceed. Perhaps the octopus oracles nearby can help."
    },
    {
        "pos": 93,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 94,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 95,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 96,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 97,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 98,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 99,
        "terrain": "O",
        "features": "",
        "encounter": ""
    }
]