[
    {
        "pos": 0,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 1,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 2,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 3,
        "terrain": "O",
        "features": "Silent ['Whirlpool']",
        "encounter": ""
    },
    {
        "pos": 4,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 5,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 6,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 7,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 8,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 9,
        "terrain": "O",
        "features": "Crystal-clear ['Trough']",
        "encounter": ""
    },
    {
        "pos": 10,
        "terrain": "O",
        "features": "",
        "encounter": "You come across the remnants of a shipwrecked sailor's journal of an old campsite, the scent of smoky scent of grilled seafood still lingering."
    },
    {
        "pos": 11,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 12,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 13,
        "terrain": "H",
        "features": "Dappled Pinnacle",
        "encounter": "Your senses are overwhelmed by enthusiasm as you uncover a collection of ancient coins hidden within clusters of yucca plants."
    },
    {
        "pos": 14,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 15,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 16,
        "terrain": "H",
        "features": "Layered Escarpment",
        "encounter": "Trails of a shattered and toppled watchtower wind through the dandelions scattered in the breeze, revealing the past actions of a nomadic band of skilled hunters and trappers."
    },
    {
        "pos": 17,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 18,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 19,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 20,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 21,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 22,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 23,
        "terrain": "H",
        "features": "Secluded Mound",
        "encounter": "Ahead, there is a vast, scorching desert with no water in sight blocking your path. Perhaps it's related to your quest to escort a group of settlers to establish a new village in the hills.."
    },
    {
        "pos": 24,
        "terrain": "O",
        "features": "Timeless ['Plateau']",
        "encounter": ""
    },
    {
        "pos": 25,
        "terrain": "H",
        "features": "Rocky Terrace",
        "encounter": "A family of griffins soaring over the hills emerge from the a concealed entrance to a hidden valley, their intent focused on a set of finely crafted climbing gear."
    },
    {
        "pos": 26,
        "terrain": "H",
        "features": "Remote Embankment",
        "encounter": "You hear the rhythmic dripping of water in a cave coming from a hidden glen in the midst of rolling hills."
    },
    {
        "pos": 27,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 28,
        "terrain": "O",
        "features": "",
        "encounter": "Deep in thought about help a stranded sea serpent find its way back to the open sea., you're startled by buzzing of bioluminescent creatures in the depths. It seems oceanic alchemists are near."
    },
    {
        "pos": 29,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 30,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 31,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 32,
        "terrain": "H",
        "features": "Layered Ridge",
        "encounter": "A path surrounded by a field of lavender in bloom leads to a clearing with a ruined and overgrown castle wall, indicating a group of skilled miners extracting precious minerals have been here."
    },
    {
        "pos": 33,
        "terrain": "H",
        "features": "Bare Crest",
        "encounter": "Peering through the dense dandelions scattered in the breeze, you catch sight of a hunting horn adorned with intricate designs. But be cautious, the distant drumming of a woodpecker suggest a group of friendly and nature-loving wood elves are near."
    },
    {
        "pos": 34,
        "terrain": "F",
        "features": "Damp Canopy",
        "encounter": "You stumble upon a decayed and overgrown forest dock on dry land indicating past battles."
    },
    {
        "pos": 35,
        "terrain": "H",
        "features": "Dewy Foothill",
        "encounter": "You notice low-lying ferns along a riverbank moving subtly. Upon closer inspection, you see a herd of surefooted mountain goats that are mining valuable gemstones and metals."
    },
    {
        "pos": 36,
        "terrain": "H",
        "features": "Bare Peak",
        "encounter": "Trails of a forgotten and tattered flagpole wind through the low-lying ferns along a riverbank, revealing the past actions of a reclusive hermit living in a hidden hillside cottage."
    },
    {
        "pos": 37,
        "terrain": "F",
        "features": "Deciduous Clearing",
        "encounter": "Blocked by a vast, scorching forest desert with no water in sight, your attention is caught by the rhythmic croaking of forest frogs. Upon investigating, you discover a secret passage beneath a forest riverbank with a bundle of rare and enchanted forest trinkets inside."
    },
    {
        "pos": 38,
        "terrain": "P",
        "features": "Boundless Meadow",
        "encounter": "The whisper of the soothing sound of a gentle stream is accompanied by the distinct aroma of the rich scent of fertile, damp soil. It seems a family of giant armadillos rolling through the grasslands are involved in mining valuable minerals and gemstones."
    },
    {
        "pos": 39,
        "terrain": "T",
        "features": "Sapphire Shores",
        "encounter": "You come across a set of crumbling town ruins by the river of an old campsite, the scent of the savory scent of a town's street vendors still lingering."
    },
    {
        "pos": 40,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 41,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 42,
        "terrain": "H",
        "features": "High Summit",
        "encounter": "A distant the distant call of a solitary hawk soaring above draws your attention. Following it, you discover a cracked and abandoned millstone of a past event."
    },
    {
        "pos": 43,
        "terrain": "H",
        "features": "Serrated Dell",
        "encounter": "Ahead, there is a massive, carnivorous plant lurking in the grass blocking your path. Perhaps it's related to your quest to investigate the sudden disappearance of a local hermit sage.."
    },
    {
        "pos": 44,
        "terrain": "P",
        "features": "Bright Rise",
        "encounter": "You stumble upon a crumbling, old bridge leading to nowhere indicating past battles."
    },
    {
        "pos": 45,
        "terrain": "H",
        "features": "Eroded Foothill",
        "encounter": "The ground trembles slightly, and the distant braying of donkeys on a farm grow louder. It seems a group of nomadic merchants trading rare goods are on the move."
    },
    {
        "pos": 46,
        "terrain": "H",
        "features": "Harsh Roll",
        "encounter": "Hidden among low-lying ferns along a riverbank, you spot a hunting horn adorned with intricate designs glinting in the sunlight."
    },
    {
        "pos": 47,
        "terrain": "P",
        "features": "Sprawling Clearing",
        "encounter": "You hear the soothing sound of a gentle stream coming from a secret tunnel leading to a hidden chamber."
    },
    {
        "pos": 48,
        "terrain": "F",
        "features": "Primeval Waterfall",
        "encounter": "You hear the soothing hum of insects on a summer day coming from a hidden grotto behind a curtain of cascading forest water."
    },
    {
        "pos": 49,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 50,
        "terrain": "O",
        "features": "Silent ['Trench']",
        "encounter": ""
    },
    {
        "pos": 51,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 52,
        "terrain": "H",
        "features": "Majestic Knoll",
        "encounter": "You're guided by the soft the distant drumming of a woodpecker. As you follow, you encounter a tribe of friendly centaurs skilled in herbalism in the midst of farming and cultivating crops in terraced fields."
    },
    {
        "pos": 53,
        "terrain": "H",
        "features": "Stony Decline",
        "encounter": "A path surrounded by dense, knee-high ferns leads to a clearing with a fallen and shattered totem pole, indicating a pack of territorial mountain lions have been here."
    },
    {
        "pos": 54,
        "terrain": "P",
        "features": "Lush Wold",
        "encounter": "Ahead, there is a sudden and intense thunderstorm blocking your path. Perhaps it's related to your quest to help a reclusive hermit find a rare and elusive plant for his studies.."
    },
    {
        "pos": 55,
        "terrain": "H",
        "features": "Grassy Heights",
        "encounter": "Deep in thought about investigate the theft of valuable minerals from a mining operation., you're startled by the distant yipping of coyotes in the night. It seems a family of hill dwarves skilled in blacksmithing are near."
    },
    {
        "pos": 56,
        "terrain": "H",
        "features": "Imposing Brae",
        "encounter": "With retrieve a lost merchant's cargo from a treacherous mountain pass. On your mind, the sudden appearance of a clan of territorial centaurs blocking passage accompanied by the distant roll of thunder echoing across the hills becomes a challenging diversion."
    },
    {
        "pos": 57,
        "terrain": "P",
        "features": "Harmonious Horizon",
        "encounter": "You notice a grove of birch trees moving subtly. Upon closer inspection, you see a pride of powerful and regal lions that are searching for lost relics and sacred artifacts."
    },
    {
        "pos": 58,
        "terrain": "P",
        "features": "Undulating Sward",
        "encounter": "Among the dense sparse patches of desert scrub, you discover a traditional hunting spear. You can't shake the feeling of hope."
    },
    {
        "pos": 59,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 60,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 61,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 62,
        "terrain": "H",
        "features": "Inviting Incline",
        "encounter": "Hidden among tall, swaying grasses, you spot a collection of ancient coins glinting in the sunlight."
    },
    {
        "pos": 63,
        "terrain": "H",
        "features": "Inviting Tumulus",
        "encounter": "You uncover a shattered and toppled stone archway that tell a story of a time when a group of friendly and nature-loving wood elves pursued retrieve a lost expedition's supplies from a remote canyon.."
    },
    {
        "pos": 64,
        "terrain": "P",
        "features": "Flowering Grassland",
        "encounter": "You feel bliss as the chirping of young birds in a nest echo in the distance. Perhaps it's a sign of what's to come."
    },
    {
        "pos": 65,
        "terrain": "H",
        "features": "Eroded Dell",
        "encounter": "You encounter a family of hill dwarves skilled in blacksmithing which are searching for lost relics and ancient artifacts."
    },
    {
        "pos": 66,
        "terrain": "H",
        "features": "Humped Brae",
        "encounter": "Your senses are overwhelmed by anticipation as you uncover a bundle of aromatic and healing plants hidden within tall, slender blades of marsh grass."
    },
    {
        "pos": 67,
        "terrain": "P",
        "features": "Shimmering Flats",
        "encounter": "Your path is illuminated by the glint of a rare and exotic animal pelt. However, a flock of colorful, exotic birds with mesmerizing plumage stand guard, their intentions unknown."
    },
    {
        "pos": 68,
        "terrain": "P",
        "features": "Windswept Pasture",
        "encounter": "Your path is illuminated by the glint of a stack of intricately woven tapestries. However, a herd of graceful, horned antelopes stand guard, their intentions unknown."
    },
    {
        "pos": 69,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 70,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 71,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 72,
        "terrain": "H",
        "features": "Resplendent Ascent",
        "encounter": "You stumble upon a scene where a colony of rock gnomes with intricate underground tunnels are engaged in building underground burrows for shelter around a set of delicate and ornate rings, seemingly crucial for solve the mystery of disappearing livestock in a farming community.."
    },
    {
        "pos": 73,
        "terrain": "H",
        "features": "Dominant Embankment",
        "encounter": "Hidden among a grove of birch trees, you spot a well-preserved set of animal bones glinting in the sunlight."
    },
    {
        "pos": 74,
        "terrain": "P",
        "features": "Secluded Meadow",
        "encounter": "A path surrounded by golden wheat fields leads to a clearing with a moss-covered, toppled stone obelisk, indicating a group of skilled animal trainers and tamers have been here."
    },
    {
        "pos": 75,
        "terrain": "H",
        "features": "Weathered Plateau",
        "encounter": "Peering through the dense a field of cotton plants with fluffy bolls, you catch sight of a well-preserved ancient weapon. But be cautious, the distant barking of a watchful dog suggest a band of traveling bards and minstrels are near."
    },
    {
        "pos": 76,
        "terrain": "H",
        "features": "Windswept Dale",
        "encounter": "A clan of hardy dwarves mining deep in the hills emerge from the a hidden glen in the midst of rolling hills, their intent focused on a bundle of mysterious and arcane artifacts."
    },
    {
        "pos": 77,
        "terrain": "P",
        "features": "Rich Range",
        "encounter": "You encounter a pack of clever and stealthy coyotes which are engaging in friendly competition and games."
    },
    {
        "pos": 78,
        "terrain": "P",
        "features": "Secluded Expanse",
        "encounter": "Your way is impeded by a sudden and intense thunderstorm. As you contemplate a way around, you hear the gentle gurgling of a babbling brook from the shadows."
    },
    {
        "pos": 79,
        "terrain": "O",
        "features": "",
        "encounter": "Your way is impeded by a massive, drifting iceberg with hidden dangers. As you contemplate a way around, you hear crackling of a bonfire on the beach from the shadows."
    },
    {
        "pos": 80,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 81,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 82,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 83,
        "terrain": "H",
        "features": "Whistling Terrace",
        "encounter": "A sudden the distant chattering of squirrels in the trees breaks the silence, making the nearby clusters of mushrooms on the forest floor quiver."
    },
    {
        "pos": 84,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 85,
        "terrain": "H",
        "features": "Tiered Decline",
        "encounter": "Deep in thought about escort a diplomatic envoy through hostile territory to negotiate peace., you're startled by the distant chattering of squirrels in the trees. It seems a clan of centaurs known for their archery skills are near."
    },
    {
        "pos": 86,
        "terrain": "H",
        "features": "Breathtaking Dale",
        "encounter": "You stumble upon a scene where a nomadic band of skilled hunters and trappers are engaged in hunting for game in the rocky terrain around a collection of polished gemstones, seemingly crucial for escort a diplomatic envoy through hostile territory to negotiate peace.."
    },
    {
        "pos": 87,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 88,
        "terrain": "O",
        "features": "",
        "encounter": "Peering through the dense mermaid's hair algae, you catch sight of a giant clamshell turned into a luxurious bed. But be cautious, clanging of bells on a buoy in choppy waters suggest cursed mermaids are near."
    },
    {
        "pos": 89,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 90,
        "terrain": "O",
        "features": "",
        "encounter": "Your journey leads you to a a sunken ship's wreckage causing navigation hazards. As you approach, dolphin companions convincing a shipwrecked sailor to join their crew."
    },
    {
        "pos": 91,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 92,
        "terrain": "O",
        "features": "Mesmerizing ['Bight']",
        "encounter": ""
    },
    {
        "pos": 93,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 94,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 95,
        "terrain": "O",
        "features": "",
        "encounter": "You notice sea palm kelp moving subtly. Upon closer inspection, you see coral golems that are navigating a treacherous whirlpool."
    },
    {
        "pos": 96,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 97,
        "terrain": "O",
        "features": "Pristine ['Bight']",
        "encounter": ""
    },
    {
        "pos": 98,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 99,
        "terrain": "O",
        "features": "",
        "encounter": ""
    }
]