[
    {
        "pos": 0,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 1,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 2,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 3,
        "terrain": "O",
        "features": "",
        "encounter": "The presence of a submerged forest of gnarled, petrified trees makes it difficult to proceed. Perhaps the island hermit nearby can help."
    },
    {
        "pos": 4,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 5,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 6,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 7,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 8,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 9,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 10,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 11,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 12,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 13,
        "terrain": "H",
        "features": "Green Descent",
        "encounter": "Your way is impeded by a deep, hidden pit trap. As you contemplate a way around, you hear the rhythmic croaking of frogs near a pond from the shadows."
    },
    {
        "pos": 14,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 15,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 16,
        "terrain": "H",
        "features": "Gentle Upland",
        "encounter": "You feel happiness as the distant braying of donkeys on a farm echo in the distance. Perhaps it's a sign of what's to come."
    },
    {
        "pos": 17,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 18,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 19,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 20,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 21,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 22,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 23,
        "terrain": "H",
        "features": "Echoing Peak",
        "encounter": "Your path is illuminated by the glint of a bundle of rare and enchanted trinkets. However, a clan of wise and reclusive hermit wizards stand guard, their intentions unknown."
    },
    {
        "pos": 24,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 25,
        "terrain": "H",
        "features": "Towering Dune",
        "encounter": "Hidden among tall, swaying grasses, you spot a set of intricate musical instruments glinting in the sunlight."
    },
    {
        "pos": 26,
        "terrain": "H",
        "features": "Remote Rise",
        "encounter": "Among the dense tumbleweeds rolling across the plains, you discover a carved wooden totem adorned with feathers. You can't shake the feeling of relaxation."
    },
    {
        "pos": 27,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 28,
        "terrain": "O",
        "features": "Shimmering ['Maelstrom']",
        "encounter": ""
    },
    {
        "pos": 29,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 30,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 31,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 32,
        "terrain": "H",
        "features": "Unspoiled Dell",
        "encounter": "You find a hint leading you to retrieve a lost expedition's supplies from a remote canyon.. But be wary, for a band of itinerant herbalists and healers lurk nearby."
    },
    {
        "pos": 33,
        "terrain": "H",
        "features": "Vibrant Descent",
        "encounter": "Deep in thought about retrieve a lost merchant's cargo from a treacherous mountain pass., you're startled by the distant chattering of squirrels in the trees. It seems a group of nomadic merchants trading rare goods are near."
    },
    {
        "pos": 34,
        "terrain": "P",
        "features": "Sprawling Vista",
        "encounter": "You stumble upon a half-buried, rotting rowboat indicating past battles."
    },
    {
        "pos": 35,
        "terrain": "H",
        "features": "Serene Slope",
        "encounter": "Strange a crumbling and overgrown temple entrance lie scattered, painting a tale of a group of nomadic merchants trading rare goods that scouting for signs of approaching storms or threats."
    },
    {
        "pos": 36,
        "terrain": "H",
        "features": "Grassy Hillock",
        "encounter": "The whisper of the gentle whistling of the wind through rocky terrain is accompanied by the distinct aroma of the fresh, green scent of a pine forest. It seems a group of elusive elves living in the deep forested hills are involved in hunting for elusive game in the rocky terrain."
    },
    {
        "pos": 37,
        "terrain": "P",
        "features": "Secluded Clearing",
        "encounter": "You find a hint leading you to rescue a group of trapped miners in an abandoned quarry.. But be wary, for a mischievous tribe of pixies playing pranks lurk nearby."
    },
    {
        "pos": 38,
        "terrain": "P",
        "features": "Lonely Tundra",
        "encounter": "The whisper of the lowing of cattle in a grazing pasture is accompanied by the distinct aroma of the tangy scent of sun-warmed rocks. It seems a band of itinerant traders and merchants are involved in honoring their ancestors through ceremonial rituals."
    },
    {
        "pos": 39,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 40,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 41,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 42,
        "terrain": "H",
        "features": "Dappled Plateau",
        "encounter": "You stumble upon a fallen and shattered totem pole indicating past battles."
    },
    {
        "pos": 43,
        "terrain": "H",
        "features": "Breathtaking Bank",
        "encounter": "You find a hint leading you to help a struggling farming family protect their crops from pests.. But be wary, for a clan of nomadic halflings traveling in hillside caravans lurk nearby."
    },
    {
        "pos": 44,
        "terrain": "F",
        "features": "Alive Dell",
        "encounter": "From the shadows of the a secret passage leading to an ancient forest grove, you sense the presence of a colony of fire-breathing salamanders."
    },
    {
        "pos": 45,
        "terrain": "H",
        "features": "Rocky Upland",
        "encounter": "Deep in thought about escort a group of pilgrims to a sacred site in the hills., you're startled by the rustling of small mammals in the underbrush. It seems a group of nomadic merchants trading rare goods are near."
    },
    {
        "pos": 46,
        "terrain": "H",
        "features": "Elevated Mound",
        "encounter": "Peering through the dense dandelions scattered in the breeze, you catch sight of a weathered and ancient map. But be cautious, the distant howling of a wolf pack suggest a group of friendly and nature-loving wood elves are near."
    },
    {
        "pos": 47,
        "terrain": "P",
        "features": "Remote Tundra",
        "encounter": "A trail of a forgotten, tattered flagpole suggests that a pack of clever and stealthy coyotes have passed through here on a quest to help a group of hunters take down a dangerous beast that threatens the plains.."
    },
    {
        "pos": 48,
        "terrain": "P",
        "features": "Unending Yard",
        "encounter": "The ground is littered with a tattered and forgotten battle flag. It appears centaur warriors patrolling their territory were here recently."
    },
    {
        "pos": 49,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 50,
        "terrain": "O",
        "features": "Reflective ['Trough']",
        "encounter": ""
    },
    {
        "pos": 51,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 52,
        "terrain": "T",
        "features": "Beachside",
        "encounter": "Peering through the dense moss-covered rocks in town streams, you catch sight of a town time capsule from centuries past. But be cautious, the distant church bells ringing in the town suggest a skilled blacksmith forging weapons are near."
    },
    {
        "pos": 53,
        "terrain": "H",
        "features": "Unspoiled Brae",
        "encounter": "Peering through the dense a field of sunflowers, you catch sight of a hunting horn adorned with intricate designs. But be cautious, the rustling of grasses in the hillside breeze suggest a flock of colorful and exotic birds with vibrant plumage are near."
    },
    {
        "pos": 54,
        "terrain": "P",
        "features": "Silent Flats",
        "encounter": "You stumble upon a scene where a pride of sabertooth tigers stalking their prey are engaged in galloping freely across the open plains around a beautifully woven and colorful rug, seemingly crucial for help a group of hunters take down a dangerous beast that threatens the plains.."
    },
    {
        "pos": 55,
        "terrain": "H",
        "features": "Isolated Incline",
        "encounter": "A sudden gust brings with it the salty scent of a distant sea breeze. You spot giant eagles nesting in high cliffs and peaks that seem to be defending against natural disasters like landslides."
    },
    {
        "pos": 56,
        "terrain": "H",
        "features": "Lush Slope",
        "encounter": "You stumble upon a scene where a colony of burrowing creatures with intricate tunnel systems are engaged in creating intricate crafts and tools around a collection of mysterious fossils, seemingly crucial for defend a sacred circle of stones from being desecrated by treasure hunters.."
    },
    {
        "pos": 57,
        "terrain": "P",
        "features": "Pleasant Moor",
        "encounter": "You encounter a herd of massive, shaggy bison which are engaging in friendly competition and games."
    },
    {
        "pos": 58,
        "terrain": "P",
        "features": "Sunlit Grassland",
        "encounter": "You feel satisfaction as the distant mooing of cattle echo in the distance. Perhaps it's a sign of what's to come."
    },
    {
        "pos": 59,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 60,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 61,
        "terrain": "O",
        "features": "Sweeping ['Atoll']",
        "encounter": ""
    },
    {
        "pos": 62,
        "terrain": "H",
        "features": "Rolling Elevation",
        "encounter": "A group of elusive elves living in the deep forested hills emerge from the a hidden path through dense thickets and shrubs, their intent focused on a well-preserved ancient weapon."
    },
    {
        "pos": 63,
        "terrain": "H",
        "features": "Solitary Dune",
        "encounter": "The presence of a colony of territorial, burrowing rodents makes it difficult to proceed. Perhaps the giant eagles nesting in high cliffs and peaks nearby can help."
    },
    {
        "pos": 64,
        "terrain": "P",
        "features": "Parched Heath",
        "encounter": "With escort a diplomatic envoy through hostile territory to negotiate peace. On your mind, the sudden appearance of a deep and fast-flowing river accompanied by the distant yipping of coyotes under a full moon becomes a challenging diversion."
    },
    {
        "pos": 65,
        "terrain": "H",
        "features": "Lush Slope",
        "encounter": "With retrieve a rare and valuable plant for an ailing herbalist. On your mind, the sudden appearance of a band of marauding bandits accompanied by the crackling of leaves underfoot in the forest becomes a challenging diversion."
    },
    {
        "pos": 66,
        "terrain": "H",
        "features": "Barren Highland",
        "encounter": "Your path is illuminated by the glint of a piece of rare and valuable meteorite. However, a tribe of reclusive druids living in hillside huts stand guard, their intentions unknown."
    },
    {
        "pos": 67,
        "terrain": "P",
        "features": "Green Wold",
        "encounter": "The presence of a treacherous, slippery mudflat makes it difficult to proceed. Perhaps the a flock of colorful, exotic birds with mesmerizing plumage nearby can help."
    },
    {
        "pos": 68,
        "terrain": "F",
        "features": "Majestic Path",
        "encounter": "You stumble upon a scene where a wise and ancient owl perched in a tree are engaged in farming and cultivating forest crops around a well-preserved ancient forest artifact, seemingly crucial for retrieve a stolen tribal relic hidden in the woods.."
    },
    {
        "pos": 69,
        "terrain": "H",
        "features": "Unspoiled Incline",
        "encounter": "From the shadows of the a concealed chamber within a windswept hill, you sense the presence of a clan of wise and reclusive hermit wizards."
    },
    {
        "pos": 70,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 71,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 72,
        "terrain": "H",
        "features": "Ancient Heights",
        "encounter": "The ground trembles slightly, and the soft cooing of doves in the distance grow louder. It seems a family of griffins soaring over the hills are on the move."
    },
    {
        "pos": 73,
        "terrain": "H",
        "features": "Whistling Brae",
        "encounter": "Strange a decayed and overgrown dock on dry land lie scattered, painting a tale of a tribe of gnomish inventors with curious contraptions that scouting for signs of approaching storms or threats."
    },
    {
        "pos": 74,
        "terrain": "P",
        "features": "Flat Bluff",
        "encounter": "Your senses are overwhelmed by reverence as you uncover a finely crafted quiver filled with arrows hidden within clusters of pine cones on the ground."
    },
    {
        "pos": 75,
        "terrain": "H",
        "features": "Flourishing Slope",
        "encounter": "The air is filled with the smell of the rich scent of fertile, damp soil. You feel a sense of wonder."
    },
    {
        "pos": 76,
        "terrain": "H",
        "features": "Vibrant Pinnacle",
        "encounter": "The presence of a vast, scorching desert with no water in sight makes it difficult to proceed. Perhaps the a colony of territorial badgers digging elaborate burrows nearby can help."
    },
    {
        "pos": 77,
        "terrain": "P",
        "features": "Arid Tundra",
        "encounter": "A sudden the howling of a lone wolf on a moonlit night breaks the silence, making the nearby clusters of mushrooms on the forest floor quiver."
    },
    {
        "pos": 78,
        "terrain": "P",
        "features": "Fertile Expanse",
        "encounter": "You see a collection of finely crafted pottery that could be useful in your quest to track down a rogue druid who has disrupted the balance of nature.. But it's guarded by a group of wise and reclusive hermit wizards."
    },
    {
        "pos": 79,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 80,
        "terrain": "O",
        "features": "",
        "encounter": "Your senses are overwhelmed by serenity as you uncover a pirate flag bearing a fearsome symbol hidden within floating bladderwort plants."
    },
    {
        "pos": 81,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 82,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 83,
        "terrain": "H",
        "features": "Alluring Decline",
        "encounter": "A flock of colorful and exotic birds with vibrant plumage emerge from the a concealed chamber within a rocky outcrop, their intent focused on a weathered and ancient map."
    },
    {
        "pos": 84,
        "terrain": "O",
        "features": "",
        "encounter": "A trail of a skeleton clutching a rusted cutlass on the seabed suggests that giant sea turtles have passed through here on a quest to track down a legendary sea monster for a wealthy collector.."
    },
    {
        "pos": 85,
        "terrain": "H",
        "features": "Sunlit Ridge",
        "encounter": "A distant the distant drumming of a woodpecker draws your attention. Following it, you discover a tattered and forgotten battle banner of a past event."
    },
    {
        "pos": 86,
        "terrain": "H",
        "features": "Leafy Upland",
        "encounter": "You stumble upon a scene where a herd of surefooted mountain goats are engaged in hunting for elusive game in the rocky terrain around a set of delicate and ornate rings, seemingly crucial for help a tribe of forest creatures negotiate a truce with a rival clan.."
    },
    {
        "pos": 87,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 88,
        "terrain": "O",
        "features": "",
        "encounter": "From the shadows of the a concealed chamber within a massive sponge, you sense the presence of kraken."
    },
    {
        "pos": 89,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 90,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 91,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 92,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 93,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 94,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 95,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 96,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 97,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 98,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 99,
        "terrain": "O",
        "features": "",
        "encounter": ""
    }
]