[
    {
        "pos": 0,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 1,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 2,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 3,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 4,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 5,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 6,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 7,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 8,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 9,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 10,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 11,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 12,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 13,
        "terrain": "H",
        "features": "Green Heights",
        "encounter": "The air is filled with the smell of the earthy scent of moss growing on rocks. You feel a sense of unity."
    },
    {
        "pos": 14,
        "terrain": "O",
        "features": "",
        "encounter": "You hear seagulls cawing in the distance coming from a concealed merfolk palace hidden behind a waterfall."
    },
    {
        "pos": 15,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 16,
        "terrain": "H",
        "features": "Tiered Upland",
        "encounter": "The clusters of pine cones on the ground rustles, revealing a clan of hill giants known for their stone-throwing abilities that are honoring their ancestors through ceremonial rituals."
    },
    {
        "pos": 17,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 18,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 19,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 20,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 21,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 22,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 23,
        "terrain": "H",
        "features": "Majestic Embankment",
        "encounter": "You encounter a clan of wise and reclusive hermit wizards which are nurturing their young and teaching them survival skills."
    },
    {
        "pos": 24,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 25,
        "terrain": "H",
        "features": "Silhouetted Peak",
        "encounter": "Surrounded by a grove of birch trees, a series of a well-hidden alcove in a canyon wall reveal traces of a shattered and toppled watchtower, and the distant the soft splashing of water at a river's edge hint at more to discover."
    },
    {
        "pos": 26,
        "terrain": "H",
        "features": "Tiered Terrace",
        "encounter": "You encounter a nomadic band of skilled hunters and trappers which are conducting trade with traveling merchants and caravans."
    },
    {
        "pos": 27,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 28,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 29,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 30,
        "terrain": "O",
        "features": "Teeming ['Flats']",
        "encounter": ""
    },
    {
        "pos": 31,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 32,
        "terrain": "H",
        "features": "Humped Climb",
        "encounter": "A path surrounded by clusters of yucca plants leads to a clearing with a partially buried and cracked sundial, indicating a wise and ancient treant guarding a sacred grove have been here."
    },
    {
        "pos": 33,
        "terrain": "H",
        "features": "Undulating Incline",
        "encounter": "A mysterious the smoky aroma of a cooking pot over a campfire envelops you, drawing you towards a hidden tunnel leading to a secluded cavern where a group of crafty goblins hiding in rocky caves are hunting for rare and mystical herbs."
    },
    {
        "pos": 34,
        "terrain": "P",
        "features": "Barren Field",
        "encounter": "The presence of a vast, open plain with no cover from the sun makes it difficult to proceed. Perhaps the a colony of giant ants with a complex social structure nearby can help."
    },
    {
        "pos": 35,
        "terrain": "H",
        "features": "Eroded Summit",
        "encounter": "Your senses are overwhelmed by bliss as you uncover a bundle of rare and exotic spices hidden within clusters of wild berries."
    },
    {
        "pos": 36,
        "terrain": "H",
        "features": "Echoing Crest",
        "encounter": "Your senses are overwhelmed by anticipation as you uncover a piece of exquisite hand-blown glass hidden within a stand of tall, ancient redwoods."
    },
    {
        "pos": 37,
        "terrain": "P",
        "features": "Rich Horizon",
        "encounter": "A trail of a toppled and shattered stone monolith suggests that a friendly clan of halfling farmers have passed through here on a quest to track down a legendary white stag for its valuable antlers.."
    },
    {
        "pos": 38,
        "terrain": "P",
        "features": "Natural Pasture",
        "encounter": "Navigating through a dense, choking fog shrouding the landscape, you're surprised to find a hidden oasis within a vast desert plain filled with a faded and illegible gravestone.As you journey forward, you come across a finely crafted quiver filled with arrows, with traces of the sweet scent of a patch of clover around them."
    },
    {
        "pos": 39,
        "terrain": "O",
        "features": "",
        "encounter": "Blocked by a whirlpool leading to a mysterious underwater realm, your attention is caught by chattering of crabs on a rocky shore. Upon investigating, you discover a sunken, ghostly ship hidden in a fog bank with a coral crown adorned with precious gems inside."
    },
    {
        "pos": 40,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 41,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 42,
        "terrain": "H",
        "features": "Imposing Dune",
        "encounter": "The whisper of the gentle splashing of water in a hillside stream is accompanied by the distinct aroma of the spicy aroma of wild herbs drying in the sun. It seems a nomadic tribe of goat herders are involved in farming and cultivating crops in terraced fields."
    },
    {
        "pos": 43,
        "terrain": "H",
        "features": "Whistling Highland",
        "encounter": "You stumble upon a scene where a flock of colorful and exotic birds with vibrant plumage are engaged in harvesting rare minerals from the hills around a bundle of rare and magical scrolls, seemingly crucial for track down a legendary and elusive beast in the highlands.."
    },
    {
        "pos": 44,
        "terrain": "F",
        "features": "Damp Brook",
        "encounter": "Surrounded by bushy sagebrush in the woods, a series of a secret passage beneath a forest riverbank reveal traces of a toppled and overgrown forest fountain, and the distant the distant hooting of a forest owl hint at more to discover."
    },
    {
        "pos": 45,
        "terrain": "H",
        "features": "Tiered Slope",
        "encounter": "Deep in thought about retrieve a stolen tribe artifact from a rival nomadic group., you're startled by the distant howling of a wolf pack. It seems giant eagles nesting in high cliffs and peaks are near."
    },
    {
        "pos": 46,
        "terrain": "H",
        "features": "Cultivated Roll",
        "encounter": "The ground is littered with a toppled and shattered stone monolith. It appears a family of wild boars foraging for food were here recently."
    },
    {
        "pos": 47,
        "terrain": "P",
        "features": "Radiant Dale",
        "encounter": "You stumble upon a toppled and shattered stone monolith indicating past battles."
    },
    {
        "pos": 48,
        "terrain": "P",
        "features": "Uninhabited Pampas",
        "encounter": "A path surrounded by tall, slender blades of marsh grass leads to a clearing with a faded and illegible gravestone, indicating a clan of nomadic halfling herbalists have been here."
    },
    {
        "pos": 49,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 50,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 51,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 52,
        "terrain": "T",
        "features": "Golden Galleon Bay",
        "encounter": "You hear the distant chatter of children playing in a town park coming from a hidden chamber beneath a town's mansion."
    },
    {
        "pos": 53,
        "terrain": "H",
        "features": "Hazy Terrace",
        "encounter": "Surrounded by a grove of aspen trees, a series of a hidden tunnel leading to a secluded cavern reveal traces of a forgotten and tumbledown windmill, and the distant the gentle whistling of the wind through rocky terrain hint at more to discover."
    },
    {
        "pos": 54,
        "terrain": "P",
        "features": "Remote Downs",
        "encounter": "A path surrounded by a field of cotton plants with fluffy bolls leads to a clearing with a half-buried, broken cart axle, indicating a pack of majestic wolves with alpha leaders have been here."
    },
    {
        "pos": 55,
        "terrain": "H",
        "features": "Silhouetted Roll",
        "encounter": "You spot a weathered and ancient map nestled among prairie grasses with seed heads, but the unsettling feeling of admiration makes you wary."
    },
    {
        "pos": 56,
        "terrain": "H",
        "features": "Misty Dune",
        "encounter": "A distant the humming of insects on a warm day draws your attention. Following it, you discover a forgotten and weathered scarecrow of a past event."
    },
    {
        "pos": 57,
        "terrain": "P",
        "features": "Rugged Thicket",
        "encounter": "Every step forward is met with the increasing intensity of the spicy aroma of wild herbs drying in the sun, suggesting the presence of a wise old owl with the gift of prophecy."
    },
    {
        "pos": 58,
        "terrain": "P",
        "features": "Rolling Clearing",
        "encounter": "You're guided by the soft the soft hush of falling snow. As you follow, you encounter a pack of majestic wolves with alpha leaders in the midst of seeking guidance from wise and ancient elders."
    },
    {
        "pos": 59,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 60,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 61,
        "terrain": "O",
        "features": "Boundless ['Billow']",
        "encounter": ""
    },
    {
        "pos": 62,
        "terrain": "H",
        "features": "Steep Embankment",
        "encounter": "Deep in thought about hunt down a notorious bandit gang that has been hiding in the hills., you're startled by the gentle splashing of water in a hillside stream. It seems a herd of agile and horned antelopes are near."
    },
    {
        "pos": 63,
        "terrain": "H",
        "features": "Eroded Ridge",
        "encounter": "Your journey leads you to a a treacherous, sinking bog. As you approach, a family of owlbears making their home in the hills organizing athletic competitions and races."
    },
    {
        "pos": 64,
        "terrain": "P",
        "features": "Endless Flats",
        "encounter": "Among the dense a stand of tall pine trees, you discover a set of hand-carved wooden figurines. You can't shake the feeling of simplicity."
    },
    {
        "pos": 65,
        "terrain": "H",
        "features": "Flourishing Brae",
        "encounter": "You find a hint leading you to retrieve a stolen artifact hidden in a hillside tomb.. But be wary, for a pack of wily coyotes scavenging for food lurk nearby."
    },
    {
        "pos": 66,
        "terrain": "H",
        "features": "Tiered Incline",
        "encounter": "You're guided by the soft the soft murmur of a hidden stream. As you follow, you encounter a family of giant hawks nesting in the cliffs in the midst of tending to their herds of goats and sheep."
    },
    {
        "pos": 67,
        "terrain": "P",
        "features": "Verdant Breadth",
        "encounter": "Every step forward is met with the increasing intensity of the pungent smell of a skunk in the distance, suggesting the presence of a mischievous leprechaun guarding its hidden treasure."
    },
    {
        "pos": 68,
        "terrain": "F",
        "features": "Enveloping Underbrush",
        "encounter": "You stumble upon a set of decaying forest fence posts indicating past battles."
    },
    {
        "pos": 69,
        "terrain": "H",
        "features": "Undulating Highland",
        "encounter": "You hear the distant drumming of a woodpecker coming from a concealed opening in a thicket of thorns."
    },
    {
        "pos": 70,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 71,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 72,
        "terrain": "H",
        "features": "Rolling Dell",
        "encounter": "Your journey leads you to a a colony of venomous spiders weaving webs. As you approach, a band of traveling bards and minstrels crafting intricate jewelry and ornaments."
    },
    {
        "pos": 73,
        "terrain": "H",
        "features": "Mossy Pinnacle",
        "encounter": "A distant the chirping of crickets on a warm summer night draws your attention. Following it, you discover a broken and moss-covered wagon wheel of a past event."
    },
    {
        "pos": 74,
        "terrain": "P",
        "features": "Rippling Downs",
        "encounter": "You hear the distant braying of donkeys coming from a hidden meadow surrounded by rocky terrain."
    },
    {
        "pos": 75,
        "terrain": "H",
        "features": "Rugged Highland",
        "encounter": "The presence of a treacherous, rushing waterfall makes it difficult to proceed. Perhaps the a wise and ancient treant guarding a sacred grove nearby can help."
    },
    {
        "pos": 76,
        "terrain": "H",
        "features": "Leafy Terrace",
        "encounter": "You come across a shattered and ancient mosaic floor of an old campsite, the scent of the crisp scent of frost on a winter morning still lingering."
    },
    {
        "pos": 77,
        "terrain": "P",
        "features": "Boundless Land",
        "encounter": "The air is filled with the smell of the smoky aroma of a cooking pot over a campfire. You feel a sense of fascination."
    },
    {
        "pos": 78,
        "terrain": "P",
        "features": "Undulating Dale",
        "encounter": "From the shadows of the a concealed passage beneath a riverbank, you sense the presence of a herd of gentle, woolly sheep tended by shepherds."
    },
    {
        "pos": 79,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 80,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 81,
        "terrain": "O",
        "features": "",
        "encounter": "A path surrounded by floating mats of sargassum seaweed leads to a clearing with a sunken cannon half-buried in the coral, indicating sirens have been here."
    },
    {
        "pos": 82,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 83,
        "terrain": "H",
        "features": "Cultivated Plateau",
        "encounter": "Your senses are overwhelmed by happiness as you uncover a weathered and ancient map hidden within a stand of fragrant eucalyptus trees."
    },
    {
        "pos": 84,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 85,
        "terrain": "H",
        "features": "Barren Elevation",
        "encounter": "Navigating through a band of nomadic warriors guarding their territory, you're surprised to find a concealed entrance to a nomadic tribe's camp filled with a crumbling and abandoned bridge.As you journey forward, you come across a piece of ancient pottery with intricate patterns, with traces of the sweet, fruity scent of wild berries around them."
    },
    {
        "pos": 86,
        "terrain": "H",
        "features": "Tiered Summit",
        "encounter": "You notice tall and slender stalks of bamboo moving subtly. Upon closer inspection, you see a colony of rock-dwelling bats that are searching for lost relics and ancient artifacts."
    },
    {
        "pos": 87,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 88,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 89,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 90,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 91,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 92,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 93,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 94,
        "terrain": "O",
        "features": "Majestic ['Pinnacle']",
        "encounter": ""
    },
    {
        "pos": 95,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 96,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 97,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 98,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 99,
        "terrain": "O",
        "features": "",
        "encounter": ""
    }
]