[
    {
        "pos": 0,
        "terrain": "O",
        "features": "",
        "encounter": "You're guided by the soft creaking of a ship's rigging in the wind. As you follow, you encounter dolphin companions in the midst of plotting revenge against a rival pirate captain."
    },
    {
        "pos": 1,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 2,
        "terrain": "O",
        "features": "Calm ['Rift']",
        "encounter": ""
    },
    {
        "pos": 3,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 4,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 5,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 6,
        "terrain": "H",
        "features": "Rocky Pinnacle",
        "encounter": "Surrounded by clusters of wild berries, a series of a hidden path through a field of tall grass reveal traces of a partially buried and ancient treasure chest, and the distant the gentle splashing of water in a hillside stream hint at more to discover."
    },
    {
        "pos": 7,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 8,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 9,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 10,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 11,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 12,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 13,
        "terrain": "H",
        "features": "Isolated Terrace",
        "encounter": "Deep in thought about protect a sacred grove from being desecrated by loggers., you're startled by the soft sigh of the wind through rocky hills. It seems a family of giant hawks nesting in the cliffs are near."
    },
    {
        "pos": 14,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 15,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 16,
        "terrain": "T",
        "features": "Seawinds",
        "encounter": "You see a magical town wand with untapped potential that could be useful in your quest to escort a group of pilgrims to a sacred town location.. But it's guarded by a curious and talkative town crier."
    },
    {
        "pos": 17,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 18,
        "terrain": "O",
        "features": "Expansive ['Expanse']",
        "encounter": ""
    },
    {
        "pos": 19,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 20,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 21,
        "terrain": "O",
        "features": "Nautical ['Wave']",
        "encounter": ""
    },
    {
        "pos": 22,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 23,
        "terrain": "H",
        "features": "Golden Pinnacle",
        "encounter": "You see a collection of polished gemstones that could be useful in your quest to investigate strange occurrences at an ancient temple on a hilltop.. But it's guarded by a family of griffins soaring over the hills."
    },
    {
        "pos": 24,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 25,
        "terrain": "H",
        "features": "Rich Embankment",
        "encounter": "Navigating through a massive, ancient burial mound, you're surprised to find a concealed chamber within a windswept hill filled with a half-buried and forgotten mining cart.As you journey forward, you come across a set of intricately beaded necklaces, with traces of the sweet, fruity scent of wild berries around them."
    },
    {
        "pos": 26,
        "terrain": "H",
        "features": "Idyllic Pinnacle",
        "encounter": "You stumble upon a tumbledown and forgotten barn indicating past battles."
    },
    {
        "pos": 27,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 28,
        "terrain": "O",
        "features": "",
        "encounter": "Peering through the dense feather boa kelp, you catch sight of a magical conch shell that can summon sea creatures. But be cautious, churning of water as a whirlpool forms suggest storm giants are near."
    },
    {
        "pos": 29,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 30,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 31,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 32,
        "terrain": "H",
        "features": "Rising Roll",
        "encounter": "You feel an overwhelming sense of optimism as you tread upon a decaying and half-buried anchor, hinting at a tale of a band of hill giants causing trouble for nearby villages."
    },
    {
        "pos": 33,
        "terrain": "H",
        "features": "Elevated Peak",
        "encounter": "Deep in thought about explore a hidden underground labyrinth rumored to hold treasure., you're startled by the soft purring of a contented cat. It seems a colony of rock-dwelling bats are near."
    },
    {
        "pos": 34,
        "terrain": "F",
        "features": "Enveloping Stream",
        "encounter": "A sudden the distant rumble of thunder through the trees breaks the silence, making the nearby a thicket of forest willow trees quiver."
    },
    {
        "pos": 35,
        "terrain": "H",
        "features": "Leafy Terrace",
        "encounter": "You see a carved wooden totem adorned with feathers that could be useful in your quest to explore a hidden underground labyrinth rumored to hold treasure.. But it's guarded by a pride of ferocious mountain lions."
    },
    {
        "pos": 36,
        "terrain": "H",
        "features": "Secluded Summit",
        "encounter": "You feel an overwhelming sense of relaxation as you tread upon a fallen and shattered totem pole, hinting at a tale of a family of owlbears making their home in the hills."
    },
    {
        "pos": 37,
        "terrain": "P",
        "features": "Inviting Steppe",
        "encounter": "The air is filled with the smell of the smoky aroma of a cooking pot over a campfire. You feel a sense of tranquility."
    },
    {
        "pos": 38,
        "terrain": "P",
        "features": "Sprawling Downs",
        "encounter": "A wise and ancient treant protecting the forest's edge gives you a quest to investigate the theft of a valuable cattle herd by rustlers.In your path lies a carved totem animal figurine surrounded by small, gnarled shrubs."
    },
    {
        "pos": 39,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 40,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 41,
        "terrain": "O",
        "features": "Iridescent ['Pinnacle']",
        "encounter": ""
    },
    {
        "pos": 42,
        "terrain": "H",
        "features": "Dappled Elevation",
        "encounter": "Strange a toppled and shattered stone monolith lie scattered, painting a tale of a wise and ancient treant guarding a sacred grove that tending to their herds of goats and sheep."
    },
    {
        "pos": 43,
        "terrain": "H",
        "features": "Receding Plateau",
        "encounter": "Peering through the dense clusters of mushrooms on the forest floor, you catch sight of a stack of hand-drawn maps and parchments. But be cautious, the distant chattering of squirrels in the trees suggest a colony of rock gnomes with intricate underground tunnels are near."
    },
    {
        "pos": 44,
        "terrain": "P",
        "features": "Lush Field",
        "encounter": "The a stand of tall pine trees rustles, revealing a tribe of friendly and herbivorous lizardfolk that are training and honing their combat skills."
    },
    {
        "pos": 45,
        "terrain": "H",
        "features": "Mossy Peak",
        "encounter": "A trail of a toppled and shattered stone monolith suggests that a group of crafty goblins hiding in rocky caves have passed through here on a quest to protect a sacred grove from being desecrated by loggers.."
    },
    {
        "pos": 46,
        "terrain": "H",
        "features": "Verdant Decline",
        "encounter": "The air is filled with the smell of the clean, woody smell of the forest floor. You feel a sense of harmony."
    },
    {
        "pos": 47,
        "terrain": "P",
        "features": "Expansive Acres",
        "encounter": "Blocked by a steep and rocky cliffside, your attention is caught by the cawing of crows in the early morning. Upon investigating, you discover a concealed chamber beneath a mound of earth with a carved totem animal figurine inside."
    },
    {
        "pos": 48,
        "terrain": "F",
        "features": "Tranquil Glade",
        "encounter": "Trails of a forgotten and weathered forest scarecrow wind through the tall, slender blades of marsh grass in woodland wetlands, revealing the past actions of a clan of forest nymphs dancing in the moonlight."
    },
    {
        "pos": 49,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 50,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 51,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 52,
        "terrain": "H",
        "features": "Silhouetted Foothill",
        "encounter": "Deep in thought about defend a remote settlement from an approaching pack of wolves., you're startled by the distant call of a solitary hawk soaring above. It seems a clan of hardy dwarves mining deep in the hills are near."
    },
    {
        "pos": 53,
        "terrain": "H",
        "features": "Wild Knoll",
        "encounter": "The way forward is blocked by a maze-like network of burrows created by creatures, but you notice a hidden glen in the midst of rolling hills that might lead around it."
    },
    {
        "pos": 54,
        "terrain": "P",
        "features": "Fresh Lea",
        "encounter": "You're guided by the soft the gentle splashing of water at a riverbank. As you follow, you encounter a pack of swift and cunning pronghorns in the midst of offering sacrifices to nature deities."
    },
    {
        "pos": 55,
        "terrain": "H",
        "features": "Barren Rise",
        "encounter": "A distant the gentle whistling of the wind through rocky terrain draws your attention. Following it, you discover a half-buried and forgotten mining cart of a past event."
    },
    {
        "pos": 56,
        "terrain": "H",
        "features": "Gentle Climb",
        "encounter": "Hidden among a stand of fragrant eucalyptus trees, you spot a stack of ancient and mysterious scrolls glinting in the sunlight."
    },
    {
        "pos": 57,
        "terrain": "P",
        "features": "Grassy Valley",
        "encounter": "You stumble upon a scene where a group of skilled animal trainers and tamers are engaged in taming and riding wild beasts for transportation around a set of intricate tribal masks, seemingly crucial for hunt down a notorious bandit gang that has been terrorizing the grasslands.."
    },
    {
        "pos": 58,
        "terrain": "P",
        "features": "Distant Expanse",
        "encounter": "Your way is impeded by a relentless, unrelenting hailstorm. As you contemplate a way around, you hear the chirping of young birds in a nest from the shadows."
    },
    {
        "pos": 59,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 60,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 61,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 62,
        "terrain": "H",
        "features": "Serene Foothill",
        "encounter": "A distant the distant roll of thunder echoing across the hills draws your attention. Following it, you discover a tumbledown and forgotten barn of a past event."
    },
    {
        "pos": 63,
        "terrain": "H",
        "features": "Jagged Dell",
        "encounter": "You spot a piece of rare and valuable meteorite nestled among low-lying moss and lichen, but the unsettling feeling of tranquility makes you wary."
    },
    {
        "pos": 64,
        "terrain": "P",
        "features": "Inviting Grove",
        "encounter": "Strange a half-buried, broken cart axle lie scattered, painting a tale of a herd of graceful, horned antelopes that conducting elaborate mating displays and rituals."
    },
    {
        "pos": 65,
        "terrain": "H",
        "features": "Serrated Upland",
        "encounter": "A family of owlbears making their home in the hills emerge from the a hidden valley surrounded by steep cliffs, their intent focused on a well-preserved ancient weapon."
    },
    {
        "pos": 66,
        "terrain": "H",
        "features": "Serrated Embankment",
        "encounter": "The golden wheat fields rustles, revealing a family of hill dwarves skilled in blacksmithing that are singing traditional songs and sharing stories around a campfire."
    },
    {
        "pos": 67,
        "terrain": "P",
        "features": "Sprawling Vale",
        "encounter": "The way forward is blocked by a treacherous, rocky ravine, but you notice a rocky crevice concealed by moss and vines that might lead around it."
    },
    {
        "pos": 68,
        "terrain": "P",
        "features": "Shimmering Acres",
        "encounter": "A mysterious the pungent smell of a skunk in the distance envelops you, drawing you towards a concealed opening in a dense hedge where a family of talking rabbits with magical abilities are galloping freely across the open plains."
    },
    {
        "pos": 69,
        "terrain": "H",
        "features": "Barren Ridge",
        "encounter": "A trail of a tumbledown and forgotten barn suggests that giant eagles nesting in high cliffs and peaks have passed through here on a quest to explore a hidden underground labyrinth rumored to hold treasure.."
    },
    {
        "pos": 70,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 71,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 72,
        "terrain": "H",
        "features": "Green Knoll",
        "encounter": "Blocked by a steep and rocky cliffside, your attention is caught by the gentle whistling of the wind through the hills. Upon investigating, you discover a concealed crevice in the rocky terrain with a set of finely crafted weapons and armor inside."
    },
    {
        "pos": 73,
        "terrain": "H",
        "features": "Panoramic Ascent",
        "encounter": "Peering through the dense clusters of pine cones on the ground, you catch sight of a collection of ancient and powerful tomes. But be cautious, the distant drumming of a woodpecker suggest a nomadic tribe of goat herders are near."
    },
    {
        "pos": 74,
        "terrain": "P",
        "features": "Timeless Downs",
        "encounter": "You're guided by the soft the buzzing of cicadas on a hot summer day. As you follow, you encounter a pack of majestic wolves with alpha leaders in the midst of defending against natural disasters like wildfires or droughts."
    },
    {
        "pos": 75,
        "terrain": "H",
        "features": "Pleasant Crest",
        "encounter": "A path surrounded by a stand of tall, ancient redwoods leads to a clearing with a partially buried and ancient treasure chest, indicating a family of giant hawks nesting in the cliffs have been here."
    },
    {
        "pos": 76,
        "terrain": "H",
        "features": "Echoing Summit",
        "encounter": "Your path is illuminated by the glint of a bundle of rare and fragrant mushrooms. However, a flock of colorful and exotic birds with vibrant plumage stand guard, their intentions unknown."
    },
    {
        "pos": 77,
        "terrain": "F",
        "features": "Boundless Ravine",
        "encounter": "You stumble upon a partially buried and cracked forest sundial indicating past battles."
    },
    {
        "pos": 78,
        "terrain": "F",
        "features": "Eerie Woodland",
        "encounter": "Strange a decaying and half-buried forest anchor lie scattered, painting a tale of a clan of forest goblins causing mischief that fishing in forest streams and rivers."
    },
    {
        "pos": 79,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 80,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 81,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 82,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 83,
        "terrain": "H",
        "features": "Barren Tumulus",
        "encounter": "The way forward is blocked by a massive, ancient burial mound, but you notice a submerged entrance to an underground grotto that might lead around it."
    },
    {
        "pos": 84,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 85,
        "terrain": "H",
        "features": "Hazy Brae",
        "encounter": "You hear the chorus of birdsong welcoming the dawn coming from a concealed opening in a thicket of thorns."
    },
    {
        "pos": 86,
        "terrain": "H",
        "features": "Grassy Summit",
        "encounter": "The way forward is blocked by a labyrinthine network of winding canyons, but you notice a submerged entrance to an underground grotto that might lead around it."
    },
    {
        "pos": 87,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 88,
        "terrain": "O",
        "features": "",
        "encounter": "Ahead, there is a whirlpool leading to a mysterious underwater realm blocking your path. Perhaps it's related to your quest to rescue a group of trapped sailors from a sinking ship.."
    },
    {
        "pos": 89,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 90,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 91,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 92,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 93,
        "terrain": "O",
        "features": "",
        "encounter": "A path surrounded by bubbling hot seawater vents leads to a clearing with the remnants of a ship's anchor chain, indicating octopus oracles have been here."
    },
    {
        "pos": 94,
        "terrain": "O",
        "features": "",
        "encounter": "You see a ship's cannon with ornate engravings that could be useful in your quest to help a shipwrecked sailor construct a signal fire to call for rescue.. But it's guarded by kraken."
    },
    {
        "pos": 95,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 96,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 97,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 98,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 99,
        "terrain": "O",
        "features": "Choppy ['Fjord']",
        "encounter": ""
    }
]