[
    {
        "pos": 0,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 1,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 2,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 3,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 4,
        "terrain": "O",
        "features": "",
        "encounter": "Peering through the dense giant kelp with air-filled bladders, you catch sight of a ship's logbook with a mysterious route. But be cautious, low growling of a distant thunderstorm suggest kelpie are near."
    },
    {
        "pos": 5,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 6,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 7,
        "terrain": "H",
        "features": "Sunlit Decline",
        "encounter": "The clusters of ferns in the shade rustles, revealing a pack of territorial mountain lions that are engaging in diplomacy and negotiations with other clans."
    },
    {
        "pos": 8,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 9,
        "terrain": "O",
        "features": "",
        "encounter": "Strange the remnants of a fishing net tangled in the coral lie scattered, painting a tale of octopus oracles that navigating treacherous waters during a storm."
    },
    {
        "pos": 10,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 11,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 12,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 13,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 14,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 15,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 16,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 17,
        "terrain": "M",
        "features": "Immutable Cirque",
        "encounter": "Every step forward is met with the increasing intensity of the earthy scent of moss growing on mountain rocks, suggesting the presence of a band of traveling bards and minstrels."
    },
    {
        "pos": 18,
        "terrain": "M",
        "features": "Volcanic Gorge",
        "encounter": "You hear the soft rustle of mountain pines in the alpine breeze coming from a concealed opening in a thicket of mountain herbs."
    },
    {
        "pos": 19,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 20,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 21,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 22,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 23,
        "terrain": "O",
        "features": "Ethereal ['Flats']",
        "encounter": "You encounter sea anemone sorcerers which are harvesting pearls from giant clams."
    },
    {
        "pos": 24,
        "terrain": "F",
        "features": "Windless Ravine",
        "encounter": "Your path is illuminated by the glint of a carved wooden amulet with intricate forest symbols. However, a group of lost travelers seeking directions stand guard, their intentions unknown."
    },
    {
        "pos": 25,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 26,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 27,
        "terrain": "H",
        "features": "Dominant Summit",
        "encounter": "A band of traveling bards and minstrels emerge from the a concealed entrance to a treasure-filled cavern, their intent focused on a piece of ancient pottery with intricate patterns."
    },
    {
        "pos": 28,
        "terrain": "H",
        "features": "Vibrant Rise",
        "encounter": "Your way is impeded by a band of nomadic warriors guarding their territory. As you contemplate a way around, you hear the distant barking of a watchful dog from the shadows."
    },
    {
        "pos": 29,
        "terrain": "O",
        "features": "Boundless ['Lagoon']",
        "encounter": ""
    },
    {
        "pos": 30,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 31,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 32,
        "terrain": "H",
        "features": "Windswept Climb",
        "encounter": "You stumble upon a set of worn and forgotten gravestones indicating past battles."
    },
    {
        "pos": 33,
        "terrain": "H",
        "features": "Inviting Plateau",
        "encounter": "Blocked by a colony of venomous spiders weaving webs, your attention is caught by the gentle rustling of ferns in the forest. Upon investigating, you discover a hidden valley surrounded by steep cliffs with a set of enchanted crystals inside."
    },
    {
        "pos": 34,
        "terrain": "H",
        "features": "Sunny Hillock",
        "encounter": "Ahead, there is a treacherous, slippery mudflat blocking your path. Perhaps it's related to your quest to investigate strange occurrences at an ancient temple on a hilltop.."
    },
    {
        "pos": 35,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 36,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 37,
        "terrain": "H",
        "features": "Hazy Bank",
        "encounter": "A mysterious the tangy scent of sun-warmed rocks envelops you, drawing you towards a concealed hollow beneath a towering oak tree where a clan of hardy dwarves mining deep in the hills are tending to their herds of goats and sheep."
    },
    {
        "pos": 38,
        "terrain": "H",
        "features": "Wild Foothill",
        "encounter": "You notice clumps of prickly pear cacti moving subtly. Upon closer inspection, you see a family of wild boars foraging for food that are embarking on spiritual journeys to sacred peaks."
    },
    {
        "pos": 39,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 40,
        "terrain": "O",
        "features": "",
        "encounter": "The ground is littered with a torn and faded pirate's treasure map. It appears oceanic alchemists were here recently."
    },
    {
        "pos": 41,
        "terrain": "O",
        "features": "Shimmering ['Bay']",
        "encounter": ""
    },
    {
        "pos": 42,
        "terrain": "H",
        "features": "Elevated Peak",
        "encounter": "A path surrounded by a grove of fruit-bearing apple trees leads to a clearing with a shattered and toppled watchtower, indicating a tribe of gnomish inventors with curious contraptions have been here."
    },
    {
        "pos": 43,
        "terrain": "H",
        "features": "Tiered Summit",
        "encounter": "Hidden among low-lying ferns along a riverbank, you spot a collection of rare and valuable gemstones glinting in the sunlight."
    },
    {
        "pos": 44,
        "terrain": "F",
        "features": "Wild Pond",
        "encounter": "A mysterious the pungent smell of a skunk in the distant woods envelops you, drawing you towards a secret tunnel leading to a treasure-filled cavern where a colony of fire-breathing salamanders are gathering rare and magical herbs."
    },
    {
        "pos": 45,
        "terrain": "P",
        "features": "Timeless Expanse",
        "encounter": "Your path is illuminated by the glint of a collection of finely crafted pottery. However, a flock of colorful, exotic birds with mesmerizing plumage stand guard, their intentions unknown."
    },
    {
        "pos": 46,
        "terrain": "P",
        "features": "Parched Grassland",
        "encounter": "Among the dense golden wheat fields, you discover a rare and exotic animal pelt. You can't shake the feeling of tenderness."
    },
    {
        "pos": 47,
        "terrain": "H",
        "features": "Stony Dune",
        "encounter": "Among the dense a grove of tall, thin cypress trees, you discover a carved wooden totem adorned with feathers. You can't shake the feeling of joy."
    },
    {
        "pos": 48,
        "terrain": "M",
        "features": "Sparse Ravine",
        "encounter": "You see a pair of intricately carved yak horns that could be useful in your quest to protect a rare and valuable gemstone deposit from poachers.. But it's guarded by a family of noble mountain lions."
    },
    {
        "pos": 49,
        "terrain": "O",
        "features": "",
        "encounter": "Giant clams gives you a quest to protect a colony of merfolk from an encroaching threat.In your path lies a bejeweled trident surrounded by giant underwater mushrooms."
    },
    {
        "pos": 50,
        "terrain": "O",
        "features": "Shimmering ['Shore']",
        "encounter": ""
    },
    {
        "pos": 51,
        "terrain": "O",
        "features": "",
        "encounter": "You feel an overwhelming sense of forgiveness as you tread upon the remnants of a merfolk's forgotten treasure, hinting at a tale of tidal wave elementals."
    },
    {
        "pos": 52,
        "terrain": "O",
        "features": "Dazzling ['Gulf']",
        "encounter": "You stumble upon a scene where sea dragons are engaged in wreaking havoc on passing ships around a coral crown adorned with precious gems, seemingly crucial for deliver a shipment of rare spices to a distant island market.."
    },
    {
        "pos": 53,
        "terrain": "P",
        "features": "Sparse Ridge",
        "encounter": "You uncover a forgotten, tumbledown windmill that tell a story of a time when a clan of nomadic halfling herbalists pursued escort a group of pilgrims to a sacred site in the plains.."
    },
    {
        "pos": 54,
        "terrain": "P",
        "features": "Elevated Sward",
        "encounter": "A family of giant armadillos rolling through the grasslands gives you a quest to escort a diplomatic envoy through hostile territory to negotiate peace.In your path lies a weathered and ancient stone obelisk surrounded by tall and slender stalks of bamboo."
    },
    {
        "pos": 55,
        "terrain": "P",
        "features": "Distant Yard",
        "encounter": "The way forward is blocked by a dense swarm of stinging insects, but you notice a well-hidden hollow beneath a large boulder that might lead around it."
    },
    {
        "pos": 56,
        "terrain": "H",
        "features": "Secluded Peak",
        "encounter": "You find a hint leading you to track down a missing scouting party lost in the highland forests.. But be wary, for a clan of hill giants known for their stone-throwing abilities lurk nearby."
    },
    {
        "pos": 57,
        "terrain": "M",
        "features": "Misty Flank",
        "encounter": "An eerie the humming of insects on a sunny day resonates from a hidden path through dense alpine thickets, and the scent of the grassy aroma of freshly cut mountain hay fills the air."
    },
    {
        "pos": 58,
        "terrain": "M",
        "features": "Elevated Volcano",
        "encounter": "The presence of a deep, hidden pit trap in the rocky terrain makes it difficult to proceed. Perhaps the a pack of snow leopards hunting in the rocky terrain nearby can help."
    },
    {
        "pos": 59,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 60,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 61,
        "terrain": "M",
        "features": "Enchanting Ravine",
        "encounter": "Surrounded by tall and slender stalks of bamboo at high altitudes, a series of a concealed crevice in the rocky mountain terrain reveal traces of a forgotten and tumbledown mountain windmill, and the distant the soft splashing of water along a high-altitude river hint at more to discover."
    },
    {
        "pos": 62,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 63,
        "terrain": "O",
        "features": "",
        "encounter": "You notice tube worms near hydrothermal vents moving subtly. Upon closer inspection, you see ghost ships that are taming and riding sea turtles."
    },
    {
        "pos": 64,
        "terrain": "P",
        "features": "Panoramic Lea",
        "encounter": "A pack of swift and cunning pronghorns gives you a quest to retrieve a lost artifact hidden deep within a dangerous canyon.In your path lies a carved totem animal figurine surrounded by a carpet of clover beneath oak trees."
    },
    {
        "pos": 65,
        "terrain": "P",
        "features": "Radiant Stretch",
        "encounter": "Navigating through a vast, open plain with no cover from the sun, you're surprised to find a cave entrance obscured by a waterfall filled with a tumbledown, forgotten barn.As you journey forward, you come across a set of tribal drums used in rituals and ceremonies, with traces of the sweet scent of fresh honey around them."
    },
    {
        "pos": 66,
        "terrain": "P",
        "features": "Bright Sward",
        "encounter": "You're guided by the soft the distant mooing of cattle. As you follow, you encounter a mischievous tribe of pixies playing pranks in the midst of fishing in nearby rivers and lakes."
    },
    {
        "pos": 67,
        "terrain": "H",
        "features": "Sparse Summit",
        "encounter": "A sudden gust brings with it the tangy scent of a creek or stream. You spot a group of nomadic merchants trading rare goods that seem to be constructing sturdy hillside homes and fortifications."
    },
    {
        "pos": 68,
        "terrain": "M",
        "features": "Craggy Volcano",
        "encounter": "You stumble upon a scene where a clan of mountain trolls lurking in dark caves are engaged in searching for hidden caves and treasure troves around a well-preserved set of mammoth bones, seemingly crucial for rescue a kidnapped child taken by mountain trolls.."
    },
    {
        "pos": 69,
        "terrain": "O",
        "features": "",
        "encounter": "Deep in thought about navigate a treacherous coral maze to reach a hidden oasis., you're startled by chirping of crickets on a moonlit beach. It seems sea serpents are near."
    },
    {
        "pos": 70,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 71,
        "terrain": "T",
        "features": "Woodbridge",
        "encounter": "The way forward is blocked by a towering and impassable town cliff wall, but you notice a concealed entrance to an underground cave that might lead around it."
    },
    {
        "pos": 72,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 73,
        "terrain": "H",
        "features": "Harsh Highland",
        "encounter": "A group of friendly and nature-loving wood elves gives you a quest to rescue a kidnapped child taken by a clan of underground dwellers.In your path lies a set of finely crafted climbing gear surrounded by bushy sagebrush."
    },
    {
        "pos": 74,
        "terrain": "M",
        "features": "Steep Divide",
        "encounter": "Peering through the dense tall, slender blades of marsh grass in alpine wetlands, you catch sight of a set of finely crafted weapons and armor. But be cautious, the soothing sound of a mountain stream rushing suggest a tribe of friendly mountain elves skilled in archery are near."
    },
    {
        "pos": 75,
        "terrain": "H",
        "features": "Golden Knoll",
        "encounter": "A sudden the soft splashing of water at a river's edge breaks the silence, making the nearby dandelions scattered in the breeze quiver."
    },
    {
        "pos": 76,
        "terrain": "F",
        "features": "Cool Clearing",
        "encounter": "A sudden gust brings with it the salty scent of a nearby sea breeze on forest trees. You spot a flock of colorful forest birds that seem to be harvesting mushrooms and fungi."
    },
    {
        "pos": 77,
        "terrain": "M",
        "features": "Snowy Peak",
        "encounter": "The presence of a massive, ancient mountain avalanche makes it difficult to proceed. Perhaps the a colony of rock hyraxes sunning themselves on cliffs nearby can help."
    },
    {
        "pos": 78,
        "terrain": "M",
        "features": "Sparse Cliff",
        "encounter": "From the shadows of the a concealed entrance to a treasure-filled cave system, you sense the presence of a clan of mountain trolls lurking in dark caves."
    },
    {
        "pos": 79,
        "terrain": "M",
        "features": "Idyllic Divide",
        "encounter": "You stumble upon a scene where a herd of surefooted mountain ibex are engaged in searching for hidden caves and treasure troves around a bundle of aromatic and healing alpine plants, seemingly crucial for retrieve a lost explorer's equipment from a high-altitude cliff.."
    },
    {
        "pos": 80,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 81,
        "terrain": "H",
        "features": "Serrated Incline",
        "encounter": "You stumble upon a set of worn and forgotten gravestones indicating past battles."
    },
    {
        "pos": 82,
        "terrain": "H",
        "features": "Slopey Elevation",
        "encounter": "You encounter a tribe of friendly centaurs skilled in herbalism which are crafting intricate jewelry and ornaments."
    },
    {
        "pos": 83,
        "terrain": "M",
        "features": "Sacred Trench",
        "encounter": "A family of noble mountain lions gives you a quest to escort a group of pilgrims to a sacred mountain summit.In your path lies a set of intricate musical instruments surrounded by a field of cotton plants with fluffy bolls at high altitudes."
    },
    {
        "pos": 84,
        "terrain": "H",
        "features": "Windswept Dale",
        "encounter": "A distant the soft whisper of wind through tall grasses draws your attention. Following it, you discover a moss-covered and ancient altar of a past event."
    },
    {
        "pos": 85,
        "terrain": "H",
        "features": "Misty Brae",
        "encounter": "Your path is illuminated by the glint of a hunting horn adorned with intricate designs. However, a group of skilled miners extracting precious minerals stand guard, their intentions unknown."
    },
    {
        "pos": 86,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 87,
        "terrain": "H",
        "features": "Gentle Upland",
        "encounter": "Hidden among tumbleweeds rolling across the plains, you spot a piece of rare and valuable meteorite glinting in the sunlight."
    },
    {
        "pos": 88,
        "terrain": "M",
        "features": "Spectacular Spire",
        "encounter": "An eerie the soft hush of falling snow in the high mountains resonates from a hidden glen in the midst of high-altitude forests, and the scent of the sweet scent of a bouquet of mountain wildflowers fills the air."
    },
    {
        "pos": 89,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 90,
        "terrain": "O",
        "features": "",
        "encounter": "You uncover a torn and faded pirate's treasure map that tell a story of a time when coral golems pursued escort a group of settlers to a remote, uncharted island.."
    },
    {
        "pos": 91,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 92,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 93,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 94,
        "terrain": "O",
        "features": "Azure ['Estuary']",
        "encounter": ""
    },
    {
        "pos": 95,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 96,
        "terrain": "O",
        "features": "",
        "encounter": "Ahead, there is a school of aggressive and territorial sharks blocking your path. Perhaps it's related to your quest to defend a coastal village from a relentless pirate invasion.."
    },
    {
        "pos": 97,
        "terrain": "O",
        "features": "Crystal-clear ['Cove']",
        "encounter": ""
    },
    {
        "pos": 98,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 99,
        "terrain": "O",
        "features": "",
        "encounter": "Ahead, there is a whirlpool leading to a mysterious underwater realm blocking your path. Perhaps it's related to your quest to escort a group of settlers to a remote, uncharted island.."
    }
]