[
    {
        "pos": 0,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 1,
        "terrain": "O",
        "features": "Beckoning ['Ridge']",
        "encounter": ""
    },
    {
        "pos": 2,
        "terrain": "O",
        "features": "",
        "encounter": "A sudden gentle lapping of waves against the shore breaks the silence, making the nearby crinoids on the seafloor quiver."
    },
    {
        "pos": 3,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 4,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 5,
        "terrain": "O",
        "features": "Soothing ['Deep']",
        "encounter": ""
    },
    {
        "pos": 6,
        "terrain": "H",
        "features": "Dewy Descent",
        "encounter": "The ground is littered with a forgotten and tattered flagpole. It appears a group of elusive elves living in the deep forested hills were here recently."
    },
    {
        "pos": 7,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 8,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 9,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 10,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 11,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 12,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 13,
        "terrain": "H",
        "features": "Windswept Decline",
        "encounter": "You spot a piece of an ancient and powerful relic nestled among a stand of tall, ancient redwoods, but the unsettling feeling of simplicity makes you wary."
    },
    {
        "pos": 14,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 15,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 16,
        "terrain": "T",
        "features": "Seahaven Shore",
        "encounter": "The whisper of the murmur of townsfolk in the town square is accompanied by the distinct aroma of the crisp scent of clean laundry in a town. It seems a talented town musician playing instruments are involved in mining for precious gems in the town's mine."
    },
    {
        "pos": 17,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 18,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 19,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 20,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 21,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 22,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 23,
        "terrain": "H",
        "features": "Jagged Dune",
        "encounter": "A sudden the gentle whistling of the wind through rocky terrain breaks the silence, making the nearby a carpet of clover beneath oak trees quiver."
    },
    {
        "pos": 24,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 25,
        "terrain": "H",
        "features": "Dense Bank",
        "encounter": "You feel an overwhelming sense of contentment as you tread upon a moss-covered and ancient altar, hinting at a tale of a herd of surefooted mountain goats."
    },
    {
        "pos": 26,
        "terrain": "H",
        "features": "Isolated Mound",
        "encounter": "A herd of agile and horned antelopes emerge from the a well-hidden alcove in a canyon wall, their intent focused on a set of exquisite and valuable paintings."
    },
    {
        "pos": 27,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 28,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 29,
        "terrain": "O",
        "features": "Boundless ['Pinnacle']",
        "encounter": ""
    },
    {
        "pos": 30,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 31,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 32,
        "terrain": "H",
        "features": "Humped Hillock",
        "encounter": "A tribe of friendly centaurs skilled in herbalism emerge from the a hidden trail leading to a remote hilltop, their intent focused on a bundle of rare and fragrant mushrooms."
    },
    {
        "pos": 33,
        "terrain": "H",
        "features": "Lush Brae",
        "encounter": "A sudden gust brings with it the rich, earthy smell of a fertile meadow. You spot a group of nomadic merchants trading rare goods that seem to be searching for lost relics and ancient artifacts."
    },
    {
        "pos": 34,
        "terrain": "P",
        "features": "Vibrant Knoll",
        "encounter": "The whisper of the howling of a lone wolf on a moonlit night is accompanied by the distinct aroma of the earthy smell of a petrichor after a storm. It seems a family of giant armadillos rolling through the grasslands are involved in building underground burrows for shelter."
    },
    {
        "pos": 35,
        "terrain": "H",
        "features": "Dense Highland",
        "encounter": "Every step forward is met with the increasing intensity of the pungent odor of sagebrush in the breeze, suggesting the presence of a herd of woolly mountain sheep."
    },
    {
        "pos": 36,
        "terrain": "H",
        "features": "High Slope",
        "encounter": "The ground is littered with a tumbledown and forgotten barn. It appears a clan of hill giants known for their stone-throwing abilities were here recently."
    },
    {
        "pos": 37,
        "terrain": "P",
        "features": "Lush Expanse",
        "encounter": "You stumble upon a scene where a family of giant armadillos rolling through the grasslands are engaged in exploring ancient ruins and archaeological sites around a mysterious stone circle used for rituals, seemingly crucial for retrieve a lost cart carrying essential supplies for a village.."
    },
    {
        "pos": 38,
        "terrain": "F",
        "features": "Remote Trail",
        "encounter": "Deep in thought about retrieve a stolen tribal relic hidden in the woods., you're startled by the soft fluttering of wings in the forest. It seems a pack of swift forest panthers are near."
    },
    {
        "pos": 39,
        "terrain": "H",
        "features": "High Peak",
        "encounter": "Surrounded by a grove of fruit-bearing apple trees, a series of a hidden oasis within a rocky desert hill reveal traces of a set of fading and illegible inscriptions, and the distant the distant roll of thunder echoing across the hills hint at more to discover."
    },
    {
        "pos": 40,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 41,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 42,
        "terrain": "H",
        "features": "Lonely Tumulus",
        "encounter": "The ground is littered with a toppled and vine-covered statue. It appears a mischievous group of pixies playing tricks on travelers were here recently."
    },
    {
        "pos": 43,
        "terrain": "H",
        "features": "Ancient Heights",
        "encounter": "Surrounded by low-lying groundcover, a series of a concealed entrance to a hidden cave behind a waterfall reveal traces of a half-buried and forgotten mining cart, and the distant the distant roll of thunder echoing across the hills hint at more to discover."
    },
    {
        "pos": 44,
        "terrain": "P",
        "features": "Sprawling Dell",
        "encounter": "Hidden among wildflowers in vibrant colors, you spot a carved wooden flute adorned with intricate designs glinting in the sunlight."
    },
    {
        "pos": 45,
        "terrain": "H",
        "features": "Slopey Embankment",
        "encounter": "Your path is illuminated by the glint of a bundle of rare and fragrant mushrooms. However, a family of owlbears making their home in the hills stand guard, their intentions unknown."
    },
    {
        "pos": 46,
        "terrain": "H",
        "features": "Cultivated Escarpment",
        "encounter": "You find a hint leading you to escort a group of settlers to establish a new village in the hills.. But be wary, for a clan of hill giants known for their stone-throwing abilities lurk nearby."
    },
    {
        "pos": 47,
        "terrain": "P",
        "features": "Sparse Thicket",
        "encounter": "You feel wonderment as the gentle gurgling of a babbling brook echo in the distance. Perhaps it's a sign of what's to come."
    },
    {
        "pos": 48,
        "terrain": "F",
        "features": "Jungly Creek",
        "encounter": "A path surrounded by a carpet of clover beneath forest oak trees leads to a clearing with a set of worn and forgotten forest gravestones, indicating a clan of gnomes with homes hidden in the forest have been here."
    },
    {
        "pos": 49,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 50,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 51,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 52,
        "terrain": "H",
        "features": "Rugged Embankment",
        "encounter": "Your path is illuminated by the glint of a piece of exquisite silk fabric. However, a wise and ancient treant guarding a sacred grove stand guard, their intentions unknown."
    },
    {
        "pos": 53,
        "terrain": "H",
        "features": "Remote Tumulus",
        "encounter": "You feel freedom as the chirping of grasshoppers in tall grass echo in the distance. Perhaps it's a sign of what's to come."
    },
    {
        "pos": 54,
        "terrain": "P",
        "features": "Timeless Tundra",
        "encounter": "Your journey leads you to a a vast, open plain with no cover from the sun. As you approach, a band of traveling minstrels and bards embarking on vision quests to gain spiritual insights."
    },
    {
        "pos": 55,
        "terrain": "H",
        "features": "Majestic Crest",
        "encounter": "A sudden gust brings with it the fresh, clean scent after a rain shower. You spot a group of crafty goblins hiding in rocky caves that seem to be foraging for edible plants and herbs."
    },
    {
        "pos": 56,
        "terrain": "H",
        "features": "Remote Dale",
        "encounter": "Ahead, there is a treacherous, slippery mudflat blocking your path. Perhaps it's related to your quest to retrieve a stolen tribal totem from a rival clan.."
    },
    {
        "pos": 57,
        "terrain": "P",
        "features": "Unspoiled Range",
        "encounter": "You spot a bundle of dried and aromatic sage nestled among a grove of birch trees, but the unsettling feeling of reverence makes you wary."
    },
    {
        "pos": 58,
        "terrain": "P",
        "features": "Elevated Clearing",
        "encounter": "From the shadows of the a concealed hideaway among tall rock formations, you sense the presence of a wise and ancient treant protecting the forest's edge."
    },
    {
        "pos": 59,
        "terrain": "H",
        "features": "Leafy Rise",
        "encounter": "Every step forward is met with the increasing intensity of the crisp scent of frost on a winter morning, suggesting the presence of a clan of centaurs known for their archery skills."
    },
    {
        "pos": 60,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 61,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 62,
        "terrain": "H",
        "features": "Tree-covered Upland",
        "encounter": "You see a stack of ancient and mysterious scrolls that could be useful in your quest to protect a sacred grove from being desecrated by loggers.. But it's guarded by a clan of hardy dwarves mining deep in the hills."
    },
    {
        "pos": 63,
        "terrain": "H",
        "features": "Humped Dell",
        "encounter": "With investigate reports of strange lights and sounds at an ancient burial mound. On your mind, the sudden appearance of a towering and impassable cliff wall accompanied by the rhythmic croaking of frogs near a pond becomes a challenging diversion."
    },
    {
        "pos": 64,
        "terrain": "P",
        "features": "Breezy Grove",
        "encounter": "Ahead, there is a patch of quicksand hidden beneath the surface blocking your path. Perhaps it's related to your quest to escort a diplomatic envoy through hostile territory to negotiate peace.."
    },
    {
        "pos": 65,
        "terrain": "H",
        "features": "Tree-covered Bank",
        "encounter": "You spot a set of intricately carved runes nestled among sparse patches of desert wildflowers, but the unsettling feeling of peace of mind makes you wary."
    },
    {
        "pos": 66,
        "terrain": "H",
        "features": "Solitary Escarpment",
        "encounter": "A mysterious the rich scent of fertile, damp soil envelops you, drawing you towards a concealed entrance to a nomadic tribe's camp where a band of itinerant herbalists and healers are building underground burrows for shelter."
    },
    {
        "pos": 67,
        "terrain": "P",
        "features": "Panoramic Bluff",
        "encounter": "You're guided by the soft the fluttering of bird wings as they take flight. As you follow, you encounter a colony of burrowing creatures building underground tunnels in the midst of grazing peacefully on the lush grass."
    },
    {
        "pos": 68,
        "terrain": "F",
        "features": "Gloomy Copse",
        "encounter": "You see a set of exquisite and valuable forest paintings that could be useful in your quest to investigate the theft of valuable forest minerals.. But it's guarded by a tribe of forest-dwelling elves living in treehouses."
    },
    {
        "pos": 69,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 70,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 71,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 72,
        "terrain": "H",
        "features": "Tiered Elevation",
        "encounter": "You notice thick patches of clover moving subtly. Upon closer inspection, you see a pack of elusive timberwolves that are hunting for game in the rocky terrain."
    },
    {
        "pos": 73,
        "terrain": "H",
        "features": "Remote Terrace",
        "encounter": "A path surrounded by low-lying moss and lichen leads to a clearing with a forgotten and tumbledown windmill, indicating a clan of hardy dwarves mining deep in the hills have been here."
    },
    {
        "pos": 74,
        "terrain": "P",
        "features": "Rolling Steppe",
        "encounter": "You encounter a group of skilled animal trainers and tamers which are scouting for signs of approaching storms or threats."
    },
    {
        "pos": 75,
        "terrain": "H",
        "features": "Rugged Dune",
        "encounter": "You come across a partially buried and ancient treasure chest of an old campsite, the scent of the sweet fragrance of wild herbs on the wind still lingering."
    },
    {
        "pos": 76,
        "terrain": "H",
        "features": "Cultivated Heights",
        "encounter": "Ahead, there is a towering and impassable cliff wall blocking your path. Perhaps it's related to your quest to help a tribe of forest creatures negotiate a truce with a rival clan.."
    },
    {
        "pos": 77,
        "terrain": "F",
        "features": "Coniferous Den",
        "encounter": "You hear the rustling of forest animals in the underbrush coming from a hidden grove surrounded by towering trees."
    },
    {
        "pos": 78,
        "terrain": "P",
        "features": "Windswept Breadth",
        "encounter": "Navigating through a deep and fast-flowing river, you're surprised to find a concealed chamber beneath a mound of earth filled with a shattered, long-abandoned watchtower.As you journey forward, you come across a set of tribal drums used in rituals and ceremonies, with traces of the warm, spicy smell of baked bread around them."
    },
    {
        "pos": 79,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 80,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 81,
        "terrain": "O",
        "features": "",
        "encounter": "The way forward is blocked by a treacherous, labyrinthine underwater cave system, but you notice a treasure cache buried in the sand on a deserted island that might lead around it."
    },
    {
        "pos": 82,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 83,
        "terrain": "H",
        "features": "Unspoiled Tumulus",
        "encounter": "You encounter a nomadic band of skilled hunters and trappers which are embarking on long migrations to find fertile lands."
    },
    {
        "pos": 84,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 85,
        "terrain": "H",
        "features": "Ancient Climb",
        "encounter": "The whisper of the distant barking of a watchful dog is accompanied by the distinct aroma of the sweet, fruity scent of wild berries. It seems giant eagles nesting in high cliffs and peaks are involved in engaging in friendly competitions and games."
    },
    {
        "pos": 86,
        "terrain": "H",
        "features": "Craggy Embankment",
        "encounter": "You're guided by the soft the rhythmic croaking of frogs near a pond. As you follow, you encounter a clan of centaurs known for their archery skills in the midst of singing traditional songs and sharing stories around a campfire."
    },
    {
        "pos": 87,
        "terrain": "O",
        "features": "Boundless ['Fjord']",
        "encounter": ""
    },
    {
        "pos": 88,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 89,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 90,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 91,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 92,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 93,
        "terrain": "O",
        "features": "Crystal-clear ['Ridge']",
        "encounter": ""
    },
    {
        "pos": 94,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 95,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 96,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 97,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 98,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 99,
        "terrain": "O",
        "features": "",
        "encounter": ""
    }
]