[
    {
        "pos": 0,
        "terrain": "O",
        "features": "",
        "encounter": "Pirates gives you a quest to solve the mystery of a cursed shipwreck and its crew's fate.In your path lies a pirate's cutlass with an ornate hilt surrounded by crinoids on the seafloor."
    },
    {
        "pos": 1,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 2,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 3,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 4,
        "terrain": "O",
        "features": "Boundless ['Jetty']",
        "encounter": ""
    },
    {
        "pos": 5,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 6,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 7,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 8,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 9,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 10,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 11,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 12,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 13,
        "terrain": "M",
        "features": "Sparse Massif",
        "encounter": "You hear the soft hush of falling snow in the high mountains coming from a hollow beneath a massive boulder covered with moss."
    },
    {
        "pos": 14,
        "terrain": "M",
        "features": "Misty Gully",
        "encounter": "Navigating through a dense swarm of stinging mountain insects, you're surprised to find a secret passage beneath a high-altitude riverbank filled with a tumbledown and forgotten mountain barn.As you journey forward, you come across a collection of mysterious fossils, with traces of the salty scent of a distant sea breeze on high peaks around them."
    },
    {
        "pos": 15,
        "terrain": "M",
        "features": "Ancient Crag",
        "encounter": "A path surrounded by a field of high-altitude sunflowers leads to a clearing with a collapsed and overgrown mountain monastery, indicating a nomadic tribe of mountaineers with yaks and tents have been here."
    },
    {
        "pos": 16,
        "terrain": "M",
        "features": "Sacred Notch",
        "encounter": "A majestic dragon nesting high in the peaks gives you a quest to investigate reports of strange lights and sounds in a mountain cave.In your path lies a bundle of rare and exotic spices surrounded by clusters of aromatic herbs in the highlands."
    },
    {
        "pos": 17,
        "terrain": "M",
        "features": "Timeless Bluff",
        "encounter": "You see a carved stone amulet with ancient symbols that could be useful in your quest to retrieve a lost mountain expedition's supplies from a remote canyon.. But it's guarded by a clan of mountain giants known for their strength."
    },
    {
        "pos": 18,
        "terrain": "M",
        "features": "Expansive Gorge",
        "encounter": "Surrounded by a carpet of clover beneath mountain oak trees, a series of a secret tunnel leading to an underground treasure trove reveal traces of a fallen and shattered mountain totem pole, and the distant the rhythmic clinking of rocks as they tumble down slopes hint at more to discover."
    },
    {
        "pos": 19,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 20,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 21,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 22,
        "terrain": "H",
        "features": "Sparse Ridge",
        "encounter": "Your journey leads you to a a field of tall, swaying grasses concealing dangers. As you approach, a group of crafty goblins hiding in rocky caves foraging for edible plants and herbs."
    },
    {
        "pos": 23,
        "terrain": "M",
        "features": "Basaltic Bluff",
        "encounter": "The dandelions scattered on mountain slopes rustles, revealing a colony of rock hyraxes sunning themselves on cliffs that are exploring hidden caves and caverns."
    },
    {
        "pos": 24,
        "terrain": "H",
        "features": "Isolated Dale",
        "encounter": "You find a hint leading you to defend a peaceful group of forest creatures from an encroaching threat.. But be wary, for a mischievous group of pixies playing tricks on travelers lurk nearby."
    },
    {
        "pos": 25,
        "terrain": "H",
        "features": "Bare Knoll",
        "encounter": "Your journey leads you to a a band of marauding bandits. As you approach, a band of traveling bards and minstrels participating in grand feasts and celebrations."
    },
    {
        "pos": 26,
        "terrain": "M",
        "features": "Radiant Trench",
        "encounter": "Navigating through a dense, choking mountain fog shrouding the landscape, you're surprised to find a hidden tunnel leading to a secluded mountain cavern filled with a partially buried and cracked mountain sundial.As you journey forward, you come across a set of intricate musical instruments, with traces of the earthy scent of animal fur in the mountain wild around them."
    },
    {
        "pos": 27,
        "terrain": "H",
        "features": "Golden Summit",
        "encounter": "Hidden among tumbleweeds rolling across the plains, you spot a stack of hand-drawn maps and parchments glinting in the sunlight."
    },
    {
        "pos": 28,
        "terrain": "O",
        "features": "",
        "encounter": "The presence of a monstrous, coral-covered sea monster makes it difficult to proceed. Perhaps the octopus oracles nearby can help."
    },
    {
        "pos": 29,
        "terrain": "M",
        "features": "Idyllic Bowl",
        "encounter": "Your path is illuminated by the glint of a collection of finely crafted jewelry. However, a colony of rock gnomes with intricate tunnels stand guard, their intentions unknown."
    },
    {
        "pos": 30,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 31,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 32,
        "terrain": "H",
        "features": "Unspoiled Brae",
        "encounter": "Hidden among tall, swaying grasses, you spot a set of delicate and ornate rings glinting in the sunlight."
    },
    {
        "pos": 33,
        "terrain": "H",
        "features": "Steep Plateau",
        "encounter": "Your way is impeded by a clan of territorial centaurs blocking passage. As you contemplate a way around, you hear the distant yipping of coyotes in the night from the shadows."
    },
    {
        "pos": 34,
        "terrain": "P",
        "features": "Breezy Sward",
        "encounter": "You feel an overwhelming sense of elation as you tread upon a fallen, weathered totem pole, hinting at a tale of a group of reclusive and contemplative monks."
    },
    {
        "pos": 35,
        "terrain": "H",
        "features": "Shaded Knoll",
        "encounter": "You're guided by the soft the soothing sound of a gentle stream flowing. As you follow, you encounter a group of elusive elves living in the deep forested hills in the midst of conducting trade with traveling merchants and caravans."
    },
    {
        "pos": 36,
        "terrain": "H",
        "features": "Pleasant Crest",
        "encounter": "Your senses are overwhelmed by gratification as you uncover a weathered and ancient map hidden within a dense canopy of oak trees."
    },
    {
        "pos": 37,
        "terrain": "P",
        "features": "Vibrant Savannah",
        "encounter": "An eerie the rhythmic croaking of frogs near a pond resonates from a concealed chamber within a rolling hill, and the scent of the musty scent of an old, weathered book fills the air."
    },
    {
        "pos": 38,
        "terrain": "P",
        "features": "Breezy Barrow",
        "encounter": "You encounter a family of talking rabbits with magical abilities which are grazing peacefully on the lush grass."
    },
    {
        "pos": 39,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 40,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 41,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 42,
        "terrain": "H",
        "features": "Undulating Ascent",
        "encounter": "Blocked by a vast, unforgiving salt flat, your attention is caught by the humming of insects on a warm day. Upon investigating, you discover a concealed cave entrance obscured by vines with a set of finely crafted weapons and armor inside."
    },
    {
        "pos": 43,
        "terrain": "H",
        "features": "Silhouetted Dell",
        "encounter": "The way forward is blocked by a deep and fast-flowing river, but you notice a concealed hideaway among ancient stone ruins that might lead around it."
    },
    {
        "pos": 44,
        "terrain": "P",
        "features": "Stony Brae",
        "encounter": "A trail of a shattered and overgrown statue suggests that a pack of swift and cunning pronghorns have passed through here on a quest to retrieve a lost artifact hidden deep within a dangerous canyon.."
    },
    {
        "pos": 45,
        "terrain": "H",
        "features": "Foggy Rise",
        "encounter": "A pack of territorial mountain lions gives you a quest to investigate the sudden disappearance of a local hermit sage.In your path lies a piece of an ancient and powerful relic surrounded by low-lying groundcover."
    },
    {
        "pos": 46,
        "terrain": "H",
        "features": "Gentle Ridge",
        "encounter": "Every step forward is met with the increasing intensity of the tangy scent of sun-warmed rocks, suggesting the presence of a band of itinerant herbalists and healers."
    },
    {
        "pos": 47,
        "terrain": "P",
        "features": "Secluded Moor",
        "encounter": "Strange an ancient, weathered stone circle lie scattered, painting a tale of a group of mysterious druids performing rituals that nurturing their young and teaching them survival skills."
    },
    {
        "pos": 48,
        "terrain": "P",
        "features": "Sprawling Meadow",
        "encounter": "You hear the distant whinnying of wild mustangs coming from a hidden campsite deep within a forest."
    },
    {
        "pos": 49,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 50,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 51,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 52,
        "terrain": "T",
        "features": "Witch's Wharf",
        "encounter": "You stumble upon a town's abandoned and crumbling cathedral indicating past battles."
    },
    {
        "pos": 53,
        "terrain": "H",
        "features": "Misty Peak",
        "encounter": "You stumble upon a scene where a tribe of friendly centaurs skilled in herbalism are engaged in conducting trade with traveling merchants and caravans around a well-preserved ancient weapon, seemingly crucial for help a group of hunters take down a dangerous beast threatening the hills.."
    },
    {
        "pos": 54,
        "terrain": "P",
        "features": "Calm Knoll",
        "encounter": "You encounter a tribe of friendly and nature-loving elves which are embarking on vision quests to gain spiritual insights."
    },
    {
        "pos": 55,
        "terrain": "H",
        "features": "Dappled Peak",
        "encounter": "A colony of rock-dwelling bats gives you a quest to solve the mystery of disappearing livestock in a farming community.In your path lies a set of finely crafted pottery surrounded by a stand of fragrant eucalyptus trees."
    },
    {
        "pos": 56,
        "terrain": "H",
        "features": "Dappled Dale",
        "encounter": "A pack of elusive timberwolves gives you a quest to solve the mystery of a cursed meadow that kills all plant life.In your path lies a collection of ancient manuscripts surrounded by a stand of tall pine trees."
    },
    {
        "pos": 57,
        "terrain": "F",
        "features": "Rough Underbrush",
        "encounter": "A distant the humming of bees and other pollinators draws your attention. Following it, you discover a half-buried and mossy forest stone well of a past event."
    },
    {
        "pos": 58,
        "terrain": "P",
        "features": "Peaceful Dale",
        "encounter": "Giant eagles soaring high in the sky emerge from the a concealed tunnel leading to a secret chamber, their intent focused on a beautifully woven and colorful rug."
    },
    {
        "pos": 59,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 60,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 61,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 62,
        "terrain": "H",
        "features": "Mossy Embankment",
        "encounter": "The presence of a sudden and unpredictable sinkhole makes it difficult to proceed. Perhaps the a band of itinerant herbalists and healers nearby can help."
    },
    {
        "pos": 63,
        "terrain": "H",
        "features": "Rugged Dale",
        "encounter": "From the shadows of the a concealed cave entrance obscured by vines, you sense the presence of a pride of ferocious mountain lions."
    },
    {
        "pos": 64,
        "terrain": "P",
        "features": "Distant Vale",
        "encounter": "The air is filled with the smell of the scent of wild herbs carried on the wind. You feel a sense of happiness."
    },
    {
        "pos": 65,
        "terrain": "H",
        "features": "Solitary Plateau",
        "encounter": "Your senses are overwhelmed by peace of mind as you uncover a piece of rare and valuable meteorite hidden within clusters of wild berries."
    },
    {
        "pos": 66,
        "terrain": "H",
        "features": "Whistling Knoll",
        "encounter": "A sudden the distant hooting of an eagle owl breaks the silence, making the nearby a carpet of clover beneath oak trees quiver."
    },
    {
        "pos": 67,
        "terrain": "P",
        "features": "Flat Bluff",
        "encounter": "A sudden gust brings with it the rich, earthy smell of a fertile meadow. You spot a wise old owl with the gift of prophecy that seem to be conducting elaborate mating displays and rituals."
    },
    {
        "pos": 68,
        "terrain": "H",
        "features": "Stony Plateau",
        "encounter": "Blocked by a deep and fast-flowing river, your attention is caught by the distant call of a solitary hawk soaring above. Upon investigating, you discover a secret passage leading to an ancient burial chamber with a bundle of rare and fragrant mushrooms inside."
    },
    {
        "pos": 69,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 70,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 71,
        "terrain": "O",
        "features": "Serene ['Main']",
        "encounter": ""
    },
    {
        "pos": 72,
        "terrain": "H",
        "features": "Gentle Dune",
        "encounter": "You come across a crumbling and abandoned well of an old campsite, the scent of the rich scent of fertile, damp soil still lingering."
    },
    {
        "pos": 73,
        "terrain": "H",
        "features": "Unspoiled Foothill",
        "encounter": "A path surrounded by tall, swaying grasses leads to a clearing with a cracked and abandoned millstone, indicating a clan of hardy dwarves mining deep in the hills have been here."
    },
    {
        "pos": 74,
        "terrain": "P",
        "features": "Radiant Grove",
        "encounter": "Your way is impeded by a treacherous, sinking bog. As you contemplate a way around, you hear the chirping of grasshoppers in tall grass from the shadows."
    },
    {
        "pos": 75,
        "terrain": "H",
        "features": "Receding Knoll",
        "encounter": "A path surrounded by a field of lavender in bloom leads to a clearing with a toppled and vine-covered statue, indicating a tribe of reclusive druids living in hillside huts have been here."
    },
    {
        "pos": 76,
        "terrain": "H",
        "features": "Grassy Rise",
        "encounter": "Peering through the dense small, gnarled shrubs, you catch sight of a set of finely crafted pottery. But be cautious, the soft hooting of an owl in the moonlight suggest a family of hill dwarves skilled in blacksmithing are near."
    },
    {
        "pos": 77,
        "terrain": "P",
        "features": "Ancient Lea",
        "encounter": "A sudden gust brings with it the smoky aroma of a campfire. You spot a band of traveling minstrels and bards that seem to be participating in grand feasts and celebrations."
    },
    {
        "pos": 78,
        "terrain": "O",
        "features": "",
        "encounter": "Trails of the remnants of a ship's lantern on the seafloor wind through the floating mats of sargassum seaweed, revealing the past actions of whirlpool spirits."
    },
    {
        "pos": 79,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 80,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 81,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 82,
        "terrain": "H",
        "features": "Receding Summit",
        "encounter": "The ground trembles slightly, and the soft cooing of doves in the distance grow louder. It seems a mischievous group of pixies playing tricks on travelers are on the move."
    },
    {
        "pos": 83,
        "terrain": "H",
        "features": "Weathered Incline",
        "encounter": "Every step forward is met with the increasing intensity of the crisp scent of fallen leaves in autumn, suggesting the presence of a reclusive hermit living in a hidden hillside cottage."
    },
    {
        "pos": 84,
        "terrain": "P",
        "features": "Arid Vale",
        "encounter": "Your path is illuminated by the glint of a set of tribal drums used in rituals and ceremonies. However, a tribe of friendly and herbivorous lizardfolk stand guard, their intentions unknown."
    },
    {
        "pos": 85,
        "terrain": "H",
        "features": "Harsh Ridge",
        "encounter": "Surrounded by low-lying moss and lichen, a series of a hidden grotto behind a curtain of cascading water reveal traces of a shattered and toppled stone archway, and the distant the chorus of birdsong welcoming the dawn hint at more to discover."
    },
    {
        "pos": 86,
        "terrain": "H",
        "features": "Idyllic Dale",
        "encounter": "Hidden among tall, slender blades of marsh grass, you spot a bundle of aromatic and healing plants glinting in the sunlight."
    },
    {
        "pos": 87,
        "terrain": "P",
        "features": "Bright Valley",
        "encounter": "A sudden the distant whinnying of wild mustangs breaks the silence, making the nearby a field of cotton plants with fluffy bolls quiver."
    },
    {
        "pos": 88,
        "terrain": "O",
        "features": "",
        "encounter": "Your journey leads you to a a colony of territorial sea lions blocking passage. As you approach, jellyfish navigators hunting for fish and other sea creatures."
    },
    {
        "pos": 89,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 90,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 91,
        "terrain": "O",
        "features": "Shimmering ['Sound']",
        "encounter": "A distant clanging of bells on a buoy in choppy waters draws your attention. Following it, you discover the remnants of a ship's broken figurehead of a past event."
    },
    {
        "pos": 92,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 93,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 94,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 95,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 96,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 97,
        "terrain": "O",
        "features": "Roaring ['Maelstrom']",
        "encounter": ""
    },
    {
        "pos": 98,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 99,
        "terrain": "O",
        "features": "",
        "encounter": ""
    }
]