[
    {
        "pos": 0,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 1,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 2,
        "terrain": "O",
        "features": "",
        "encounter": "Strange a shattered, waterlogged compass lie scattered, painting a tale of dolphin companions that harvesting pearls from giant clams."
    },
    {
        "pos": 3,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 4,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 5,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 6,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 7,
        "terrain": "H",
        "features": "Towering Slope",
        "encounter": "You come across a shattered and toppled stone archway of an old campsite, the scent of the pungent smell of a skunk in the distance still lingering."
    },
    {
        "pos": 8,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 9,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 10,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 11,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 12,
        "terrain": "O",
        "features": "",
        "encounter": "An eerie rustling of seaweed swaying in the current resonates from a concealed treasure vault within an ancient shipwreck, and the scent of pungent smell of seaweed drying in the sun fills the air."
    },
    {
        "pos": 13,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 14,
        "terrain": "O",
        "features": "",
        "encounter": "The whisper of rattling of pebbles in the surf is accompanied by the distinct aroma of scent of salted fish drying on racks. It seems underwater miners are involved in creating storms to deter sailors."
    },
    {
        "pos": 15,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 16,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 17,
        "terrain": "M",
        "features": "Unreachable Flank",
        "encounter": "A mysterious the sweet, vanilla-like scent of mountain cedarwood envelops you, drawing you towards a hidden valley surrounded by towering peaks where a pack of elusive snow foxes blending into the snowy landscape are nurturing their young and teaching them survival skills."
    },
    {
        "pos": 18,
        "terrain": "M",
        "features": "Rough Tor",
        "encounter": "A pack of snow leopards hunting in the rocky terrain gives you a quest to help a clan of mountain creatures negotiate a truce with a rival group.In your path lies a collection of mysterious fossils surrounded by a field of cotton plants with fluffy bolls at high altitudes."
    },
    {
        "pos": 19,
        "terrain": "O",
        "features": "",
        "encounter": "Kraken emerge from the a hidden coral maze filled with merfolk traps, their intent focused on a collection of seashells with hidden messages."
    },
    {
        "pos": 20,
        "terrain": "O",
        "features": "",
        "encounter": "You notice sponge colonies moving subtly. Upon closer inspection, you see tidal wave elementals that are protecting a ship from ghostly apparitions."
    },
    {
        "pos": 21,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 22,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 23,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 24,
        "terrain": "F",
        "features": "Shady Hollow",
        "encounter": "A path surrounded by a field of cotton plants with fluffy bolls in the woods leads to a clearing with a weathered and toppled forest stone statue, indicating a band of hunters tracking game through the woods have been here."
    },
    {
        "pos": 25,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 26,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 27,
        "terrain": "H",
        "features": "Towering Decline",
        "encounter": "An eerie the bubbling of a natural spring resonates from a hidden path through a field of tall grass, and the scent of the tangy aroma of a barbecue feast fills the air."
    },
    {
        "pos": 28,
        "terrain": "H",
        "features": "Panoramic Descent",
        "encounter": "The air is filled with the smell of the musty scent of old, weathered books. You feel a sense of appreciation."
    },
    {
        "pos": 29,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 30,
        "terrain": "O",
        "features": "",
        "encounter": "A distant sloshing of water in a mermaid's bathtub draws your attention. Following it, you discover the remnants of a coral-encrusted treasure chest of a past event."
    },
    {
        "pos": 31,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 32,
        "terrain": "H",
        "features": "Eroded Dune",
        "encounter": "Deep in thought about solve the mystery of disappearing travelers on a dangerous road., you're startled by the soft purring of a contented cat. It seems a wise and ancient treant guarding a sacred grove are near."
    },
    {
        "pos": 33,
        "terrain": "H",
        "features": "Craggy Dune",
        "encounter": "Navigating through a patch of quicksand hidden beneath the surface, you're surprised to find a well-hidden alcove in a canyon wall filled with a set of fading and illegible inscriptions.As you journey forward, you come across a set of delicate and ornate rings, with traces of the salty scent of a distant sea breeze around them."
    },
    {
        "pos": 34,
        "terrain": "H",
        "features": "Foggy Peak",
        "encounter": "You encounter a tribe of reclusive druids living in hillside huts which are climbing steep slopes to reach their nests."
    },
    {
        "pos": 35,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 36,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 37,
        "terrain": "H",
        "features": "Rich Incline",
        "encounter": "A mysterious the pungent smell of a skunk in the distance envelops you, drawing you towards a hidden tunnel leading to a secluded cavern where a reclusive hermit living in a hidden hillside cottage are hunting for rare and mystical herbs."
    },
    {
        "pos": 38,
        "terrain": "H",
        "features": "Dense Crest",
        "encounter": "Your journey leads you to a a maze-like network of burrows created by creatures. As you approach, a herd of agile and horned antelopes taming and riding surefooted mountain goats."
    },
    {
        "pos": 39,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 40,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 41,
        "terrain": "O",
        "features": "",
        "encounter": "Ahead, there is a massive, floating tree trunk in the ship's path blocking your path. Perhaps it's related to your quest to investigate a series of shipwrecks caused by a vengeful ghost ship.."
    },
    {
        "pos": 42,
        "terrain": "H",
        "features": "Serrated Highland",
        "encounter": "From the shadows of the a concealed entrance to a hidden cave behind a waterfall, you sense the presence of a clan of nomadic halflings traveling in hillside caravans."
    },
    {
        "pos": 43,
        "terrain": "H",
        "features": "Alluring Heights",
        "encounter": "You find a hint leading you to track down a legendary and elusive beast in the highlands.. But be wary, for a pack of wily coyotes scavenging for food lurk nearby."
    },
    {
        "pos": 44,
        "terrain": "F",
        "features": "Overgrown Thicket",
        "encounter": "With explore a hidden forest valley rumored to hold treasure. On your mind, the sudden appearance of a massive, ancient forest landslide accompanied by the rhythmic thumping of a woodpecker's beak on trees becomes a challenging diversion."
    },
    {
        "pos": 45,
        "terrain": "P",
        "features": "Windswept Range",
        "encounter": "You hear the gentle splashing of water at a riverbank coming from a hidden entrance beneath a fallen tree."
    },
    {
        "pos": 46,
        "terrain": "P",
        "features": "Golden Wold",
        "encounter": "Your journey leads you to a a towering dust storm reducing visibility. As you approach, a pack of swift and cunning pronghorns tending to their herds of domesticated animals."
    },
    {
        "pos": 47,
        "terrain": "H",
        "features": "Slopey Descent",
        "encounter": "The ground is littered with a shattered and toppled stone archway. It appears a family of hill dwarves skilled in blacksmithing were here recently."
    },
    {
        "pos": 48,
        "terrain": "M",
        "features": "Misty Flank",
        "encounter": "Strange an ancient and crumbling mountain temple lie scattered, painting a tale of a family of alpine dwarves known for their mining that defending against natural disasters like avalanches."
    },
    {
        "pos": 49,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 50,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 51,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 52,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 53,
        "terrain": "P",
        "features": "Sparse Savannah",
        "encounter": "You uncover a ruined, overgrown castle wall that tell a story of a time when a band of itinerant traders and merchants pursued solve the mystery of a cursed meadow that kills all plant life.."
    },
    {
        "pos": 54,
        "terrain": "P",
        "features": "Lush Ridge",
        "encounter": "You see a stack of animal hides for crafting that could be useful in your quest to retrieve a stolen heirloom from a rival nomadic tribe.. But it's guarded by a pride of powerful and regal lions."
    },
    {
        "pos": 55,
        "terrain": "P",
        "features": "Pleasant Tundra",
        "encounter": "The way forward is blocked by a clan of territorial centaurs blocking passage, but you notice a concealed tunnel leading to a secret chamber that might lead around it."
    },
    {
        "pos": 56,
        "terrain": "H",
        "features": "Ancient Pinnacle",
        "encounter": "You find a hint leading you to investigate the theft of valuable minerals from a mining operation.. But be wary, for a pride of ferocious mountain lions lurk nearby."
    },
    {
        "pos": 57,
        "terrain": "M",
        "features": "Wild Ridge",
        "encounter": "The thick patches of mountain clover rustles, revealing a band of itinerant monks seeking enlightenment that are farming and cultivating crops in high-altitude fields."
    },
    {
        "pos": 58,
        "terrain": "M",
        "features": "Expansive Col",
        "encounter": "You stumble upon a ruined and overgrown mountain castle wall indicating past battles."
    },
    {
        "pos": 59,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 60,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 61,
        "terrain": "M",
        "features": "Expansive Trench",
        "encounter": "A path surrounded by a field of cotton plants with fluffy bolls at high altitudes leads to a clearing with a cracked and abandoned mountain millstone, indicating a colony of rock-dwelling bats hanging from cavern ceilings have been here."
    },
    {
        "pos": 62,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 63,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 64,
        "terrain": "P",
        "features": "Wild Thicket",
        "encounter": "Peering through the dense clusters of aromatic herbs, you catch sight of a set of animal horns and antlers. But be cautious, the distant drumming of a woodpecker suggest a nomadic tribe of human hunters are near."
    },
    {
        "pos": 65,
        "terrain": "P",
        "features": "Uninhabited Steppe",
        "encounter": "You notice clusters of aromatic herbs moving subtly. Upon closer inspection, you see a family of giant armadillos rolling through the grasslands that are honoring their ancestors through ceremonial rituals."
    },
    {
        "pos": 66,
        "terrain": "P",
        "features": "Idyllic Breadth",
        "encounter": "The ground trembles slightly, and the soft splashing of a river's current grow louder. It seems a friendly clan of halfling farmers are on the move."
    },
    {
        "pos": 67,
        "terrain": "H",
        "features": "Receding Rise",
        "encounter": "Every step forward is met with the increasing intensity of the clean, fresh scent of a mountain breeze, suggesting the presence of a pack of wily coyotes scavenging for food."
    },
    {
        "pos": 68,
        "terrain": "M",
        "features": "Foreboding Base",
        "encounter": "From the shadows of the a hidden tunnel leading to a secluded mountain cavern, you sense the presence of a family of griffons soaring above the mountains."
    },
    {
        "pos": 69,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 70,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 71,
        "terrain": "T",
        "features": "Silver Serenity Cove Cove",
        "encounter": "A trail of a tattered town banner from a past celebration suggests that a talented town painter capturing scenes on canvas have passed through here on a quest to defend a town from an approaching monster invasion.."
    },
    {
        "pos": 72,
        "terrain": "O",
        "features": "Tidal ['Reef']",
        "encounter": ""
    },
    {
        "pos": 73,
        "terrain": "H",
        "features": "Rising Dale",
        "encounter": "You're guided by the soft the rhythmic thumping of a woodpecker's beak. As you follow, you encounter a colony of burrowing creatures with intricate tunnel systems in the midst of embarking on spiritual journeys to sacred peaks."
    },
    {
        "pos": 74,
        "terrain": "M",
        "features": "Foreboding Butte",
        "encounter": "The ground trembles slightly, and the echoing howl of the wind through mountain passes grow louder. It seems a flock of giant condors soaring high above are on the move."
    },
    {
        "pos": 75,
        "terrain": "H",
        "features": "Lonely Dell",
        "encounter": "You spot a collection of rare and valuable gemstones nestled among tall, slender blades of marsh grass, but the unsettling feeling of gentleness makes you wary."
    },
    {
        "pos": 76,
        "terrain": "F",
        "features": "Bright Clearing",
        "encounter": "You come across a moss-covered and ancient forest altar of an old campsite, the scent of the rich scent of fertile, damp forest soil still lingering."
    },
    {
        "pos": 77,
        "terrain": "M",
        "features": "Eternal Tor",
        "encounter": "The air is filled with the smell of the smoky scent of a blacksmith's forge in the highlands. You feel a sense of admiration."
    },
    {
        "pos": 78,
        "terrain": "M",
        "features": "Misty Ravine",
        "encounter": "Trails of a toppled and overgrown mountain fountain wind through the clusters of high-altitude yucca plants, revealing the past actions of a colony of rock hyraxes sunning themselves on cliffs."
    },
    {
        "pos": 79,
        "terrain": "M",
        "features": "Silvery Peak",
        "encounter": "A mysterious the sweet scent of a bouquet of mountain wildflowers envelops you, drawing you towards a network of tunnels dug by underground creatures where a clan of mountain giants known for their strength are guarding their territory from intruders."
    },
    {
        "pos": 80,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 81,
        "terrain": "H",
        "features": "Dappled Peak",
        "encounter": "The ground is littered with a toppled and overgrown fountain. It appears a wise and ancient treant guarding a sacred grove were here recently."
    },
    {
        "pos": 82,
        "terrain": "H",
        "features": "Serrated Elevation",
        "encounter": "Peering through the dense a field of cotton plants with fluffy bolls, you catch sight of a stack of hand-drawn maps and parchments. But be cautious, the distant chattering of squirrels in the trees suggest a reclusive hermit living in a hidden hillside cottage are near."
    },
    {
        "pos": 83,
        "terrain": "M",
        "features": "Silvery Saddle",
        "encounter": "The way forward is blocked by a pack of cunning and stealthy mountain wolves, but you notice a concealed chamber within a rocky mountain outcrop that might lead around it."
    },
    {
        "pos": 84,
        "terrain": "H",
        "features": "Dense Embankment",
        "encounter": "Hidden among dense, knee-high ferns, you spot a set of intricate musical instruments glinting in the sunlight."
    },
    {
        "pos": 85,
        "terrain": "H",
        "features": "Harsh Knoll",
        "encounter": "Trails of a broken and moss-covered wagon wheel wind through the dandelions scattered in the breeze, revealing the past actions of a herd of agile and horned antelopes."
    },
    {
        "pos": 86,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 87,
        "terrain": "H",
        "features": "Stony Knoll",
        "encounter": "You come across a decaying and moss-covered treasure map of an old campsite, the scent of the smoky aroma of a campfire at night still lingering."
    },
    {
        "pos": 88,
        "terrain": "M",
        "features": "Vast Vista",
        "encounter": "You see a set of finely crafted pottery that could be useful in your quest to defend a sacred mountain grove from being desecrated.. But it's guarded by a clan of mountain trolls lurking in dark caves."
    },
    {
        "pos": 89,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 90,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 91,
        "terrain": "O",
        "features": "",
        "encounter": "Coral golems emerge from the a hollowed-out giant clam used as a merfolk's dwelling, their intent focused on a ghostly lantern that wards off spirits."
    },
    {
        "pos": 92,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 93,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 94,
        "terrain": "O",
        "features": "",
        "encounter": "A sudden gust brings with it warm, sun-kissed aroma of a sandy beach. You spot cursed mermaids that seem to be navigating treacherous waters during a storm."
    },
    {
        "pos": 95,
        "terrain": "O",
        "features": "",
        "encounter": "Surrounded by bubblegum coral, a series of a submerged sea cave filled with bioluminescent creatures reveal traces of the remnants of a ship's broken mast, and the distant rustling of palm fronds in a gentle breeze hint at more to discover."
    },
    {
        "pos": 96,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 97,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 98,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 99,
        "terrain": "O",
        "features": "",
        "encounter": ""
    }
]