[
    {
        "pos": 0,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 1,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 2,
        "terrain": "O",
        "features": "Iridescent Main",
        "encounter": ""
    },
    {
        "pos": 3,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 4,
        "terrain": "O",
        "features": "Harmonious Fjord",
        "encounter": ""
    },
    {
        "pos": 5,
        "terrain": "O",
        "features": "",
        "encounter": "You stumble upon a scene where floating market traders are engaged in raiding a coastal village for supplies around a net filled with exotic and colorful fish, seemingly crucial for help a stranded sea serpent find its way back to the open sea.."
    },
    {
        "pos": 6,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 7,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 8,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 9,
        "terrain": "O",
        "features": "Rippling Vortex",
        "encounter": ""
    },
    {
        "pos": 10,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 11,
        "terrain": "M",
        "features": "Glacial Tor",
        "encounter": "With escort a group of mountain miners through treacherous terrain. On your mind, the sudden appearance of a labyrinthine network of winding mountain canyons accompanied by the soft sigh of the wind through high mountain peaks becomes a challenging diversion."
    },
    {
        "pos": 12,
        "terrain": "M",
        "features": "Misty Notch",
        "encounter": "You come across a decaying and moss-covered mountain treasure map of an old campsite, the scent of the fragrance of mountain herbs carried on the highland wind still lingering."
    },
    {
        "pos": 13,
        "terrain": "H",
        "features": "Dense Rise",
        "encounter": "A path surrounded by a grove of birch trees leads to a clearing with a fallen and forgotten wind chime, indicating a colony of rock-dwelling bats have been here."
    },
    {
        "pos": 14,
        "terrain": "M",
        "features": "Plateaued Face",
        "encounter": "Hidden among tall, swaying pine trees, you spot a set of ancient runestones with inscriptions glinting in the sunlight."
    },
    {
        "pos": 15,
        "terrain": "H",
        "features": "Majestic Peak",
        "encounter": "You uncover a tattered and forgotten battle banner that tell a story of a time when a nomadic band of skilled hunters and trappers pursued rescue a kidnapped child taken by a clan of underground dwellers.."
    },
    {
        "pos": 16,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 17,
        "terrain": "H",
        "features": "Cultivated Terrace",
        "encounter": "Strange a ruined and overgrown castle wall lie scattered, painting a tale of a pack of wily coyotes scavenging for food that conducting trade with traveling merchants and caravans."
    },
    {
        "pos": 18,
        "terrain": "M",
        "features": "Solitary Face",
        "encounter": "You come across a collapsed and overgrown mountain monastery of an old campsite, the scent of the sweet scent of ripening fruit in mountain orchards still lingering."
    },
    {
        "pos": 19,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 20,
        "terrain": "O",
        "features": "Crystal-clear Fjord",
        "encounter": ""
    },
    {
        "pos": 21,
        "terrain": "M",
        "features": "Wild Tor",
        "encounter": "Deep in thought about investigate a series of mysterious mountain disappearances., you're startled by the soothing sound of a mountain stream rushing. It seems a clan of mountain giants known for their strength are near."
    },
    {
        "pos": 22,
        "terrain": "M",
        "features": "Rolling Notch",
        "encounter": "You come across a shattered and ancient mountain mosaic floor of an old campsite, the scent of the crisp scent of pine needles in mountain forests still lingering."
    },
    {
        "pos": 23,
        "terrain": "M",
        "features": "Grand Gorge",
        "encounter": "A clan of centaurs known for their mountain survival skills emerge from the a concealed entrance to a hidden valley, their intent focused on a weathered and ancient treasure map."
    },
    {
        "pos": 24,
        "terrain": "H",
        "features": "Isolated Ridge",
        "encounter": "The whisper of the distant yipping of coyotes in the night is accompanied by the distinct aroma of the pungent smell of a skunk in the distance. It seems a herd of woolly mountain sheep are involved in offering sacrifices to nature spirits."
    },
    {
        "pos": 25,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 26,
        "terrain": "O",
        "features": "Majestic Upwelling",
        "encounter": ""
    },
    {
        "pos": 27,
        "terrain": "H",
        "features": "Remote Heights",
        "encounter": "The tall, swaying grasses rustles, revealing a family of giant hawks nesting in the cliffs that are engaging in friendly competitions and games."
    },
    {
        "pos": 28,
        "terrain": "M",
        "features": "Foreboding Trench",
        "encounter": "The ground trembles slightly, and the soothing sound of a babbling mountain brook grow louder. It seems a clan of centaurs known for their mountain survival skills are on the move."
    },
    {
        "pos": 29,
        "terrain": "O",
        "features": "",
        "encounter": "Blocked by a tidal wave approaching with destructive force, your attention is caught by rumbling of a distant underwater volcano. Upon investigating, you discover a treasure cache buried in the sand on a deserted island with a kraken's tentacle as a gruesome trophy inside."
    },
    {
        "pos": 30,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 31,
        "terrain": "M",
        "features": "Immutable Ravine",
        "encounter": "A sudden the soothing murmur of a hidden mountain brook breaks the silence, making the nearby a grove of alpine birch trees quiver."
    },
    {
        "pos": 32,
        "terrain": "M",
        "features": "Granite Canyon",
        "encounter": "With hunt down a legendary and elusive mountain creature. On your mind, the sudden appearance of a treacherous, rocky mountain ravine accompanied by the rhythmic dripping of water in a hidden mountain cave becomes a challenging diversion."
    },
    {
        "pos": 33,
        "terrain": "H",
        "features": "Imposing Crest",
        "encounter": "A path surrounded by a grove of aspen trees leads to a clearing with an ancient and crumbling stone circle, indicating a group of nomadic merchants trading rare goods have been here."
    },
    {
        "pos": 34,
        "terrain": "P",
        "features": "Barren Expanse",
        "encounter": "An eerie the distant howling of a coyote pack resonates from a concealed den within a stand of tall grass, and the scent of the musky smell of a nearby herd of buffalo fills the air."
    },
    {
        "pos": 35,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 36,
        "terrain": "O",
        "features": "",
        "encounter": "Peering through the dense sea grape kelp, you catch sight of a net filled with exotic and colorful fish. But be cautious, thudding of footsteps on a wooden dock suggest ship-eating barnacles are near."
    },
    {
        "pos": 37,
        "terrain": "H",
        "features": "Alluring Brae",
        "encounter": "Surrounded by a stand of tall, ancient redwoods, a series of a concealed entrance to an underground dwarven city reveal traces of a fallen and shattered totem pole, and the distant the rhythmic croaking of frogs near a pond hint at more to discover."
    },
    {
        "pos": 38,
        "terrain": "H",
        "features": "Sparse Crest",
        "encounter": "Surrounded by a grove of tall, thin cypress trees, a series of a secret tunnel leading to an underground chamber reveal traces of a decayed and overgrown dock on dry land, and the distant the distant chattering of squirrels in the trees hint at more to discover."
    },
    {
        "pos": 39,
        "terrain": "M",
        "features": "Lofty Pinnacle",
        "encounter": "You feel an overwhelming sense of gratification as you tread upon a partially buried and cracked mountain sundial, hinting at a tale of a wise and ancient treant standing tall in the high forest."
    },
    {
        "pos": 40,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 41,
        "terrain": "M",
        "features": "Formidable Arête",
        "encounter": "You stumble upon a scene where a colony of territorial marmots with intricate burrows are engaged in scouting for signs of approaching storms or threats around a collection of ancient coins, seemingly crucial for hunt down a legendary and elusive mountain creature.."
    },
    {
        "pos": 42,
        "terrain": "M",
        "features": "Formidable Cirque",
        "encounter": "You spot a stack of hand-drawn maps and parchment nestled among thick patches of mountain clover, but the unsettling feeling of elation makes you wary."
    },
    {
        "pos": 43,
        "terrain": "H",
        "features": "Dense Hillock",
        "encounter": "You hear the chirping of crickets on a warm summer night coming from a hidden campsite in the midst of a highland forest."
    },
    {
        "pos": 44,
        "terrain": "P",
        "features": "Windswept Valley",
        "encounter": "The air is filled with the smell of the musty scent of an old, weathered book. You feel a sense of joy."
    },
    {
        "pos": 45,
        "terrain": "P",
        "features": "Majestic Tundra",
        "encounter": "The whisper of the chorus of birdsong at dawn is accompanied by the distinct aroma of the sweet fragrance of honeysuckle on a breeze. It seems a colony of giant ants with a complex social structure are involved in searching for lost relics and sacred artifacts."
    },
    {
        "pos": 46,
        "terrain": "P",
        "features": "Panoramic Terrace",
        "encounter": "Ahead, there is a band of marauding bandits blocking your path. Perhaps it's related to your quest to retrieve a sacred relic stolen by a group of outlaw elves.."
    },
    {
        "pos": 47,
        "terrain": "P",
        "features": "Pristine Flats",
        "encounter": "You feel peacefulness as the soft sigh of the wind through tall grasses echo in the distance. Perhaps it's a sign of what's to come."
    },
    {
        "pos": 48,
        "terrain": "M",
        "features": "Elevated Cliff",
        "encounter": "You come across a shattered and toppled mountain stone archway of an old campsite, the scent of the sweet, vanilla-like scent of mountain cedarwood still lingering."
    },
    {
        "pos": 49,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 50,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 51,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 52,
        "terrain": "H",
        "features": "Barren Heights",
        "encounter": "You notice clusters of mushrooms on the forest floor moving subtly. Upon closer inspection, you see a group of elusive elves living in the deep forested hills that are exploring hidden caves and caverns."
    },
    {
        "pos": 53,
        "terrain": "P",
        "features": "Mesmeric Orchard",
        "encounter": "Among the dense dandelions scattered in the breeze, you discover a set of intricately carved bone tools. You can't shake the feeling of enthusiasm."
    },
    {
        "pos": 54,
        "terrain": "P",
        "features": "Parched Pasture",
        "encounter": "Hidden among a grove of twisted juniper trees, you spot a weathered and ancient totem pole glinting in the sunlight."
    },
    {
        "pos": 55,
        "terrain": "P",
        "features": "Elevated Range",
        "encounter": "Strange a weathered, toppled stone statue lie scattered, painting a tale of a band of traveling minstrels and bards that trading valuable resources with neighboring tribes."
    },
    {
        "pos": 56,
        "terrain": "P",
        "features": "Mystical Dale",
        "encounter": "With retrieve a rare flower for an ailing herbalist's potion. On your mind, the sudden appearance of a clan of territorial centaurs blocking passage accompanied by the howling of a lone wolf on a moonlit night becomes a challenging diversion."
    },
    {
        "pos": 57,
        "terrain": "P",
        "features": "Green Lea",
        "encounter": "Your way is impeded by a massive, carnivorous plant lurking in the grass. As you contemplate a way around, you hear the chirping of grasshoppers in tall grass from the shadows."
    },
    {
        "pos": 58,
        "terrain": "H",
        "features": "Sparse Hillock",
        "encounter": "Strange a decayed and overgrown dock on dry land lie scattered, painting a tale of a colony of burrowing creatures with intricate tunnel systems that hunting for rare and mystical herbs."
    },
    {
        "pos": 59,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 60,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 61,
        "terrain": "O",
        "features": "Mesmerizing Kelp Forest",
        "encounter": "You come across a tattered, waterlogged map of uncharted waters of an old campsite, the scent of briny smell of a fishing pier still lingering."
    },
    {
        "pos": 62,
        "terrain": "H",
        "features": "Rolling Summit",
        "encounter": "You spot a bundle of aromatic and healing plants nestled among clusters of aromatic herbs, but the unsettling feeling of euphoria makes you wary."
    },
    {
        "pos": 63,
        "terrain": "P",
        "features": "Sparse Breadth",
        "encounter": "Surrounded by a grove of twisted juniper trees, a series of a camouflaged pit trap with a wooden cover reveal traces of a collapsed, long-abandoned homestead, and the distant the distant mooing of cattle hint at more to discover."
    },
    {
        "pos": 64,
        "terrain": "O",
        "features": "",
        "encounter": "The presence of a swarm of aggressive, giant jellyfish makes it difficult to proceed. Perhaps the sirens nearby can help."
    },
    {
        "pos": 65,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 66,
        "terrain": "P",
        "features": "Sparse Terrace",
        "encounter": "An eerie the howling of a lone wolf on a moonlit night resonates from a hidden campsite in a grove of trees, and the scent of the sweet, fruity scent of wild berries fills the air."
    },
    {
        "pos": 67,
        "terrain": "P",
        "features": "Flowering Flats",
        "encounter": "Your senses are overwhelmed by gratification as you uncover a stack of animal hides for crafting hidden within dandelions scattered in the breeze."
    },
    {
        "pos": 68,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 69,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 70,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 71,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 72,
        "terrain": "H",
        "features": "Verdant Dale",
        "encounter": "The dandelions scattered in the breeze rustles, revealing a herd of agile and horned antelopes that are embarking on long migrations to find fertile lands."
    },
    {
        "pos": 73,
        "terrain": "M",
        "features": "Sacred Base",
        "encounter": "A mysterious the rich, earthy smell of a fertile mountain meadow envelops you, drawing you towards a network of tunnels dug by underground creatures where a flock of giant condors soaring high above are hunting for rare and mystical herbs."
    },
    {
        "pos": 74,
        "terrain": "P",
        "features": "Green Pampas",
        "encounter": "The ground is littered with a set of worn and forgotten gravestones. It appears a mischievous tribe of pixies playing pranks were here recently."
    },
    {
        "pos": 75,
        "terrain": "P",
        "features": "Sparse Grassland",
        "encounter": "The whisper of the distant yipping of coyotes under a full moon is accompanied by the distinct aroma of the crisp scent of frost on a winter morning. It seems a band of traveling minstrels and bards are involved in hunting for prey in tall grasses."
    },
    {
        "pos": 76,
        "terrain": "H",
        "features": "Barren Upland",
        "encounter": "Trails of a set of worn and weathered standing stones wind through the tall and slender reeds, revealing the past actions of a colony of rock gnomes with intricate underground tunnels."
    },
    {
        "pos": 77,
        "terrain": "P",
        "features": "Sandy Flats",
        "encounter": "A path surrounded by prairie grasses with seed heads leads to a clearing with a crumbling, old bridge leading to nowhere, indicating a wise and ancient treant protecting the forest's edge have been here."
    },
    {
        "pos": 78,
        "terrain": "M",
        "features": "Idyllic Sierra",
        "encounter": "The clusters of aromatic herbs in the highlands rustles, revealing a family of snow hares darting among the rocks that are organizing athletic competitions and races."
    },
    {
        "pos": 79,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 80,
        "terrain": "O",
        "features": "Unfathomable Mangrove",
        "encounter": ""
    },
    {
        "pos": 81,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 82,
        "terrain": "H",
        "features": "Layered Ascent",
        "encounter": "You hear the cawing of crows in the early morning coming from a concealed opening in a thicket of thorns."
    },
    {
        "pos": 83,
        "terrain": "H",
        "features": "Tiered Ascent",
        "encounter": "The ground trembles slightly, and the distant call of a solitary hawk soaring above grow louder. It seems a clan of centaurs known for their archery skills are on the move."
    },
    {
        "pos": 84,
        "terrain": "T",
        "features": "['Seabreeze Harbor', 'Coral Cove', \"Pirate's Cove\", \"Mermaid's Lagoon\", 'Skull Island', \"Siren's Song\", 'Shipwreck Bay', 'Treasure Isle', 'Turtle Beach', 'Moonlit Bay', 'Sunset Shores', 'Whalebone Village', 'Azure Cove', 'Mystic Isle', 'Jungle Landing', 'Pearl Harbor', 'Windward Port', 'Golden Sands', 'Emerald Cove', 'Dragonstone Port', \"Kraken's Keep\", 'Blackbeard Bay', 'Tidal Haven', 'Sapphire Isle', 'Stormy Harbor', 'Rustic Wharf', 'Whispering Pines', 'Moonlit Haven', 'Silvermoon Bay', 'Hidden Anchorage', 'Starfish Cove', 'Misty Harbor', 'Crimson Bay', \"Dolphin's Cove\", 'Emerald Harbor', 'Tropical Breeze', 'Marine Village', 'Cursed Cove', 'Rainbow Shores', 'Turtle Island', \"Pirate's Paradise\", \"Witch's Haven\", 'Crystal Waters', 'Coral Harbor', 'Rusty Anchor', 'Moonlit Oasis', 'Ghostly Port', 'Lighthouse Landing', \"Fisherman's Retreat\", \"Dragon's Den\", 'Sapphire Harbor', 'Jewel Bay', 'Golden Sands Cove', 'Treasure Cove', 'Seashell Haven', 'Abyssal Abyss', 'Mystic Cove', 'Mango Bay', 'Silvershore', 'Stormy Waters', \"Merfolk's Refuge\", 'Wavesong Harbor', 'Maritime Village', 'Sunset Bay', 'Amber Cove', \"Kraken's Lair\", 'Tidepool Haven', 'Whispering Pines Cove', 'Cursed Island', 'Blackwater Harbor', 'Whale Song Bay', \"Dragon's Breath Port\", \"Pirate's Retreat\", 'Pearl Cove', 'Coral Reef Port', 'Moonlit Lagoon', 'Azure Harbor', \"Rogue's Retreat\", 'Rainbow Harbor', 'Hidden Treasure Bay', \"Siren's Cove\", 'Volcano Bay', 'Skeleton Island', 'Crimson Harbor', \"Witch's Cove\", 'Emerald Oasis', 'Haunted Harbor', 'Misty Shores', 'Crystal Cove', 'Mystical Waters', 'Tidal Village', \"Galleon's Graveyard\", 'Silverstrand Bay', 'Palm Paradise', 'Lighthouse Cove', \"Dragon's Roar Port\", 'Sapphire Shores', 'Mystic Sands', 'Jewel Harbor', 'Golden Anchor Bay', \"Treasure Hunter's Haven\", 'Seashell Cove', 'Abyssal Port', 'Starfish Haven', 'Sunken Ship Bay', 'Cursed Treasure Cove', \"Mermaid's Harbor\", 'Wavesong Village', 'Coral Beach', \"Siren's Retreat\", 'Black Pearl Cove', \"Whale's Tail Bay\", \"Dragon's Claw Port\", 'Turtle Shell Cove', 'Moonlit Cove', 'Marine Haven', 'Ghost Ship Bay', 'Silvermoon Harbor', 'Stormy Shore', 'Turtle Haven', 'Crystal Cove Village', 'Mystic Bay', \"Pirate's Rest\", 'Pearl Harbor Cove', 'Sunset Oasis', 'Treasure Trove Bay', 'Emerald Sound', 'Crimson Shores', 'Dolphin Cove', 'Sapphire Shores Cove', 'Rusty Cutlass Cove', \"Pirate's Plunder\", 'Misty Mirage', 'Crimson Cove', 'Aqua Bay', 'Emerald Enclave', 'Tropical Treasure', 'Marina Vista', \"Witch's Wharf\", 'Rainbow Retreat', 'Atlantis Haven', \"Dragon's Lair\", 'Sapphire Serenity', \"Mermaid's Hideaway\", 'Jewel Junction', 'Golden Galleon', 'Treasure Trove', 'Seaweed Sanctuary', 'Abyssal Abyss', 'Mystic Mirage', 'Mango Mist', 'Silver Serenity', 'Stormy Secrets', \"Merfolk's Marina\", 'Whispering Waters', 'Marine Mysteries', 'Sunset Serenade', 'Amber Anchorage', \"Kraken's Abyss\", 'Tidepool Tavern', 'Coral Dreams', 'Rusty Shipyard', 'Moonlit Magic', 'Ghost Ship Harbor', 'Lighthouse Lookout', \"Fisherman's Fortune\", \"Dragon's Dominion\", 'Sapphire Serenade', 'Jewel Junction', 'Golden Grotto', 'Treasure Trail', 'Seashell Shores', 'Abyssal Adventure', 'Mystic Magic', 'Mango Mirage', 'Silvershore Sanctuary', 'Stormy Splendor', \"Mermaid's Melody\", 'Wavesong Wharf', 'Maritime Marvel', 'Sunset Serenity', 'Amber Azure', \"Kraken's Keep\", 'Tidepool Treasure', 'Coral Cove', 'Rainbow Reflections', 'Hidden Harbor', \"Siren's Serenade\", 'Volcano Vista', \"Skeleton's Cove\", 'Crimson Cape', \"Witch's Wonders\", 'Emerald Echoes', 'Haunted Hideaway', 'Misty Mysteries', 'Crystal Cascades', 'Mystical Mirage', 'Tidal Treasures', \"Galleon's Gold\", 'Silverstrand Serenity', 'Palm Paradise Cove', 'Lighthouse Lookout', \"Dragon's Domain\", 'Sapphire Splendor', 'Mystic Meadows', 'Jewel Junction Cove', 'Golden Galleon Bay', \"Treasure Hunter's Hideaway\", 'Seashell Serenity', 'Abyssal Atoll', 'Starfish Sanctuary', 'Sunken Secrets', 'Cursed Caverns', \"Mermaid's Melody\", 'Wavesong Wonders', 'Coral Cove Cove', \"Siren's Sanctuary\", 'Black Pearl Bay', \"Whale's Watch\", \"Dragon's Dominion Cove\", \"Turtle's Treasure\", 'Moonlit Mysteries', 'Marine Marvel', 'Ghost Ship Grotto', 'Silvermoon Serenade', 'Stormy Splendors', \"Turtle's Tranquility\", 'Crystal Cove Cove', 'Mystic Magic Cove', \"Pirate's Paradise Cove\", 'Pearl Harbor Cove', 'Sunset Serenity Cove', 'Treasure Trove Cove', 'Emerald Echoes Cove', 'Crimson Cove Cove', \"Dolphin's Delight Cove\", 'Sapphire Splendor Cove', 'Rusty Relic Cove', \"Pirate's Perch\", 'Mystic Mirage Cove', 'Crimson Shores Cove', 'Aqua Haven', 'Emerald Shores Cove', 'Tropical Tranquility', 'Marina Vista Cove', \"Witch's Wharf Cove\", 'Rainbow Reef Cove', 'Atlantis Oasis', \"Dragon's Roost\", 'Sapphire Serenity Cove', \"Mermaid's Cove\", 'Jewel Junction Cove', 'Golden Grotto Cove', 'Treasure Cove Cove', 'Seashell Cove Cove', 'Abyssal Abyss Cove', 'Mystic Mirage Cove Cove', 'Mango Mist Cove', 'Silver Serenity Cove Cove', 'Stormy Secrets Cove', \"Merfolk's Marina Cove\", 'Whispering Waters Cove', 'Marine Mysteries Cove', 'Sunset Serenade Cove', 'Amber Anchorage Cove', \"Kraken's Abyss Cove\", 'Tidepool Tavern Cove', 'Coral Dreams Cove', 'Rusty Shipyard Cove', 'Moonlit Magic Cove', 'Ghost Ship Harbor Cove', 'Lighthouse Lookout Cove', \"Fisherman's Fortune Cove\", \"Dragon's Roost Cove\", 'Sapphire Serenade Cove Cove', 'Jewel Junction Cove Cove', 'Golden Grotto Cove Cove', 'Treasure Trail Cove', 'Seashell Shores Cove Cove', 'Abyssal Adventure Cove', 'Mystic Magic Cove Cove', 'Mango Mirage Cove', 'Silvershore Sanctuary Cove Cove', 'Stormy Splendor Cove', \"Mermaid's Melody Cove\", 'Wavesong Wharf Cove Cove', 'Maritime Marvel Cove', 'Sunset Serenity Cove Cove', 'Amber Azure Cove', \"Kraken's Keep Cove\", 'Tidepool Treasure Cove Cove', 'Coral Cove Cove Cove', 'Rainbow Reflections Cove', 'Hidden Harbor Cove', \"Siren's Serenade Cove\", 'Volcano Vista Cove', \"Skeleton's Cove Cove\", 'Crimson Cape Cove', \"Witch's Wonders Cove\", 'Emerald Echoes Cove', 'Haunted Hideaway Cove', 'Misty Mysteries Cove', 'Crystal Cascades Cove', 'Mystical Mirage Cove Cove', 'Tidal Treasures Cove', \"Galleon's Gold Cove\", 'Silverstrand Serenity Cove Cove', 'Portsmouth', 'Harborview', 'Seaview', \"Anchor's End\", 'Marinatown', 'Bayshore', 'Cresthaven', 'Lakewood', 'Fairharbor', 'Windsor Cove', 'Stonebridge', 'Brookside', 'Kingsport', 'Newport', 'Havenfield', 'Oceanville', 'Rivertown', 'Greenwich', 'Cliffside', 'Fishingham', 'Millville', 'Riverside', 'Harbor Springs', 'Highland Bay', 'Covebridge', 'Piermont', 'Hollyville', 'Shoreside', 'Maplewood', 'Harborside', 'Lighthouse Bay', 'Rockport', 'Beachwood', 'Bayside', 'Tidewater', \"Sailor's Cove\", 'Summerfield', 'Bridgewater', 'Harborview Cove', 'Meadowville', 'Waverly', \"Fisher's Cove\", 'Havenbrook', 'Crestwood', 'Rivershore', 'Windward Bay', 'Pinecrest', 'Newbridge', 'Seawinds', 'Bayside Heights', 'Seabrook', 'Greenfield', 'Portside', 'Lakemont', 'Marinaville', 'Harborside Cove', 'Tidewatch', 'Shorehaven', 'Fairwind', 'Bayfield', 'Oakridge', 'Waterside', 'Riverbend', \"Sailor's Point\", 'Havenridge', 'Brookside Cove', \"Anchor's Landing\", 'Lighthouse Cove', 'Woodbridge', 'Riverside Cove', 'Harborview Heights', 'Harborside Village', 'Highland Cove', 'Crestwood Bay', 'Bayside Park', 'Cliffside Cove', 'Seaside', 'Seaview Cove', 'Kingsbridge', 'Piercove', 'Lakemeadow', 'Ocean Bay', \"Harbor's Edge\", \"Fisher's Landing\", 'Bayside Point', 'Bayhill', 'Maplebridge', 'Port Haven', 'Waterside Village', 'Lighthouse Point', \"Sailor's Haven\", 'Bridgewater Cove', 'Greenbriar', 'Seaglen', 'Marina Bay', 'Tidewatch Cove', 'Harbor Heights', 'Riverbend Cove', 'Bayside Terrace', 'Crestwood Village', \"Harbor's View\", 'Bayview Cove', 'Brookside Village', 'Shoreline', 'Portside Cove', 'Riverview', 'Bayside Harbor', 'Marinavista', 'Bayfront', 'Harbor Bayou', 'Cliffview Cove', 'Seahaven', 'Harborwalk', 'Bridgetown', 'Lakeside', 'Oceanwood', 'Waveridge', 'Seawind Cove', 'Crestbrook', 'Pier Harbor', 'Harbor Village', 'Coastal Cove', 'Woodside', 'Harbor Isle', 'Bayside Cove Cove', 'Baycrest', 'Marinaville Cove', 'Beachside', 'Bridgewood', 'Tideview', \"Anchor's Cove\", 'Harborfield', 'Bayshire', 'Harborview Village', 'Seascape Cove', 'Harbor Cove Cove', 'Portside Bay', 'Riverside Village', 'Bayshore Cove', 'Marinatown Cove', 'Cliffview Bay', 'Seaspray', 'Piermont Village', 'Bayview Landing', 'Havenbridge Cove', 'Crestwood Harbor', 'Maritime Point', 'Beachfront Bay', 'Harborwatch Cove', 'Shoreside Village', 'Seagrove', 'Seabridge', \"Anchor's Landing\", 'Fairview Cove', 'Marinavista Bay', 'Bayfield Terrace', 'Lighthouse Pointe', 'Ocean Crest', 'Bridgewater Bay', 'Rivertown Haven', 'Harborside Bayou', \"Harbor's Reach\", 'Woodside Haven', 'Bayside Cove Heights', 'Harborwalk Village', 'Harborfield Heights', 'Portside Bay Park', 'Riverside Haven Cove', 'Bayshore Coveview', 'Marinatown Pointe', 'Cliffview Bayport', 'Harborside Vista', 'Seahaven Shore', 'Harborwalk Landing', 'Bridgetown Shoreline', 'Lakeside Bayview', 'Oceanwood Bayfront', 'Waveridge Port', 'Seawind Harbor Village', 'Crestbrook Harbor', 'Pier Harbor Point', 'Harbor Village Crossing', 'Coastal Cove Beach', 'Woodside Bayfront', 'Harbor Isle Point', 'Bayside Heights Crossing', 'Baycrest Bayview', 'Marinaville Pier', 'Beachside Baywalk', 'Bridgewood Shore', 'Tideview Pointe', \"Anchor's Reach\", 'Harborfield Baywood', 'Bayshire Harbor', 'Harborview Village Point', 'Seascape Port', 'Harbor Reach', 'Portside Bay Harbor', 'Riverside Village Crossing', 'Bayshore Harborview', 'Marinatown Point Landing', 'Cliffview Bay Landing', 'Harborside Bay Point', 'Seahaven Shoreline', 'Harborwalk Landing Point', 'Bridgetown Shoreline Crossing', 'Lakeside Bayview Point', 'Oceanwood Bayfront Village', 'Waveridge Port Crossing', 'Seawind Harbor Village Point', 'Crestbrook Harbor Point', 'Pier Harbor Point Landing', 'Harbor Village Crossing Point', 'Coastal Cove Beach Landing', 'Woodside Bayfront Landing', 'Harbor Isle Point Village', 'Bayside Heights Crossing Point', 'Baycrest Bayview Point', 'Marinaville Pier Village', 'Beachside Baywalk Landing', 'Bridgewood Shore Point', 'Tideview Pointe Landing', \"Anchor's Reach Village\", 'Harborfield Baywood Landing', 'Bayshire Harbor Village', 'Harborview Village Point Landing', 'Seascape Port Village', 'Harbor Reach Point', 'Portside Bay Harbor Landing', 'Riverside Village Crossing Point', 'Bayshore Harborview Village', 'Marinatown Point Landing Village', 'Cliffview Bay Landing Village', 'Harborside Bay Point Village', 'Seahaven Shoreline Village']",
        "encounter": "You come across a dilapidated town shipyard along the coast of an old campsite, the scent of the smoky scent of candles in a town's cathedral still lingering."
    },
    {
        "pos": 85,
        "terrain": "P",
        "features": "Vast Yard",
        "encounter": "The whisper of the soft hush of falling snow is accompanied by the distinct aroma of the pungent smell of a skunk in the distance. It seems a group of skilled animal trainers and tamers are involved in harvesting herbs and plants for medicinal purposes."
    },
    {
        "pos": 86,
        "terrain": "H",
        "features": "Sunlit Dell",
        "encounter": "You notice a field of cotton plants with fluffy bolls moving subtly. Upon closer inspection, you see a colony of rock gnomes with intricate underground tunnels that are honoring their ancestors through ceremonial rituals."
    },
    {
        "pos": 87,
        "terrain": "H",
        "features": "Jagged Highland",
        "encounter": "Your path is illuminated by the glint of a stack of intricately woven tapestries. However, a herd of surefooted mountain goats stand guard, their intentions unknown."
    },
    {
        "pos": 88,
        "terrain": "M",
        "features": "Rocky Cliff",
        "encounter": "The way forward is blocked by a colony of giant, aggressive mountain ants, but you notice a hidden tunnel leading to a secluded mountain cavern that might lead around it."
    },
    {
        "pos": 89,
        "terrain": "O",
        "features": "Soothing Reef",
        "encounter": ""
    },
    {
        "pos": 90,
        "terrain": "O",
        "features": "",
        "encounter": "The whisper of splintering of wood as a shipwreck breaks apart is accompanied by the distinct aroma of tangy scent of salt spray. It seems crystal reef dwellers are involved in exploring the depths in search of a sunken city."
    },
    {
        "pos": 91,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 92,
        "terrain": "O",
        "features": "Majestic Lagoon",
        "encounter": ""
    },
    {
        "pos": 93,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 94,
        "terrain": "O",
        "features": "Vast Tidal Pool",
        "encounter": "A sudden gust brings with it scent of coconut oil and sunscreen. You spot sea witches that seem to be healing wounded sea creatures."
    },
    {
        "pos": 95,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 96,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 97,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 98,
        "terrain": "M",
        "features": "Climbable Valley",
        "encounter": "A distant the rhythmic dripping of water in a hidden mountain cave draws your attention. Following it, you discover a decaying and half-buried mountain anchor of a past event."
    },
    {
        "pos": 99,
        "terrain": "O",
        "features": "",
        "encounter": ""
    }
]