[
    {
        "pos": 0,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 1,
        "terrain": "O",
        "features": "Sapphire ['Trough']",
        "encounter": ""
    },
    {
        "pos": 2,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 3,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 4,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 5,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 6,
        "terrain": "O",
        "features": "",
        "encounter": "You stumble upon a scene where pirates are engaged in repairing their damaged ship around a ship's sextant for celestial navigation, seemingly crucial for protect a colony of merfolk from an encroaching threat.."
    },
    {
        "pos": 7,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 8,
        "terrain": "O",
        "features": "",
        "encounter": "A sudden splintering of wood as a shipwreck breaks apart breaks the silence, making the nearby halophila seagrass quiver."
    },
    {
        "pos": 9,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 10,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 11,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 12,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 13,
        "terrain": "H",
        "features": "Elevated Descent",
        "encounter": "You stumble upon a scene where a group of crafty goblins hiding in rocky caves are engaged in crafting intricate jewelry and ornaments around a set of intricate musical instruments, seemingly crucial for retrieve a lost family heirloom hidden in an ancient cave.."
    },
    {
        "pos": 14,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 15,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 16,
        "terrain": "H",
        "features": "Echoing Roll",
        "encounter": "Every step forward is met with the increasing intensity of the crisp scent of fallen leaves in autumn, suggesting the presence of a colony of territorial badgers digging elaborate burrows."
    },
    {
        "pos": 17,
        "terrain": "O",
        "features": "",
        "encounter": "You hear rumbling of a distant underwater volcano coming from a hollowed-out giant clam used as a merfolk's dwelling."
    },
    {
        "pos": 18,
        "terrain": "O",
        "features": "Vast ['Seamount']",
        "encounter": ""
    },
    {
        "pos": 19,
        "terrain": "O",
        "features": "Shimmering ['Spring']",
        "encounter": ""
    },
    {
        "pos": 20,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 21,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 22,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 23,
        "terrain": "H",
        "features": "Elevated Bank",
        "encounter": "A tribe of gnomish inventors with curious contraptions emerge from the a concealed chamber within a windswept hill, their intent focused on a set of finely crafted climbing gear."
    },
    {
        "pos": 24,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 25,
        "terrain": "H",
        "features": "Undulating Slope",
        "encounter": "Hidden among dandelions scattered in the breeze, you spot a hunting horn adorned with intricate designs glinting in the sunlight."
    },
    {
        "pos": 26,
        "terrain": "H",
        "features": "Solitary Summit",
        "encounter": "The ground trembles slightly, and the gentle rustling of ferns in the forest grow louder. It seems a family of giant hawks nesting in the cliffs are on the move."
    },
    {
        "pos": 27,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 28,
        "terrain": "O",
        "features": "Sunlit ['Shore']",
        "encounter": ""
    },
    {
        "pos": 29,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 30,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 31,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 32,
        "terrain": "H",
        "features": "Unspoiled Rise",
        "encounter": "Ahead, there is a massive, ancient burial mound blocking your path. Perhaps it's related to your quest to hunt down a notorious bandit gang that has been hiding in the hills.."
    },
    {
        "pos": 33,
        "terrain": "H",
        "features": "Majestic Dune",
        "encounter": "Your path is illuminated by the glint of a pair of ornate, gem-encrusted earrings. However, a tribe of friendly centaurs skilled in herbalism stand guard, their intentions unknown."
    },
    {
        "pos": 34,
        "terrain": "P",
        "features": "Serene Dale",
        "encounter": "Your senses are overwhelmed by peacefulness as you uncover a pair of sturdy leather saddlebags hidden within bushy sagebrush."
    },
    {
        "pos": 35,
        "terrain": "H",
        "features": "Panoramic Brae",
        "encounter": "An eerie the rustling of grasses in the hillside breeze resonates from a hidden tunnel leading to a secluded cavern, and the scent of the tangy scent of a creek or stream fills the air."
    },
    {
        "pos": 36,
        "terrain": "H",
        "features": "Lush Terrace",
        "encounter": "You spot a set of intricately beaded necklaces nestled among clusters of wild berries, but the unsettling feeling of awe makes you wary."
    },
    {
        "pos": 37,
        "terrain": "F",
        "features": "Unyielding Brook",
        "encounter": "With escort a diplomatic envoy through perilous forest trails. On your mind, the sudden appearance of a treacherous, hidden forest crevasse accompanied by the rustling of leaves as forest animals move about becomes a challenging diversion."
    },
    {
        "pos": 38,
        "terrain": "F",
        "features": "Fragrant Stream",
        "encounter": "The way forward is blocked by a wide and treacherous ravine in the woods, but you notice a concealed hideaway among ancient forest ruins that might lead around it."
    },
    {
        "pos": 39,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 40,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 41,
        "terrain": "O",
        "features": "Ageless ['Bight']",
        "encounter": ""
    },
    {
        "pos": 42,
        "terrain": "H",
        "features": "Rugged Hillock",
        "encounter": "Deep in thought about rescue a kidnapped child taken by a clan of underground dwellers., you're startled by the gentle whistling of the wind through the hills. It seems a colony of rock gnomes with intricate underground tunnels are near."
    },
    {
        "pos": 43,
        "terrain": "H",
        "features": "Serene Summit",
        "encounter": "Trails of a forgotten and weathered scarecrow wind through the tumbleweeds rolling across the plains, revealing the past actions of a tribe of gnomish inventors with curious contraptions."
    },
    {
        "pos": 44,
        "terrain": "F",
        "features": "Jungly Waterfall",
        "encounter": "A trail of a partially buried and ancient forest treasure chest suggests that a tribe of forest nomads with knowledge of the land have passed through here on a quest to retrieve a lost explorer's equipment from a remote forest glen.."
    },
    {
        "pos": 45,
        "terrain": "H",
        "features": "Flourishing Terrace",
        "encounter": "You stumble upon a scene where a band of traveling bards and minstrels are engaged in harvesting rare minerals from the hills around a stack of intricately woven tapestries, seemingly crucial for investigate the sudden disappearance of a local hermit sage.."
    },
    {
        "pos": 46,
        "terrain": "H",
        "features": "Picturesque Foothill",
        "encounter": "A distant the chirping of young birds in their nests draws your attention. Following it, you discover a set of decaying wooden fence posts of a past event."
    },
    {
        "pos": 47,
        "terrain": "P",
        "features": "Unending Valley",
        "encounter": "Hidden among prairie grasses with seed heads, you spot a beautifully woven and colorful rug glinting in the sunlight."
    },
    {
        "pos": 48,
        "terrain": "P",
        "features": "Uncharted Orchard",
        "encounter": "Blocked by a swarm of poisonous snakes, your attention is caught by the distant yipping of coyotes under a full moon. Upon investigating, you discover a well-hidden hollow beneath a large boulder with a collection of tribal jewelry and adornments inside."
    },
    {
        "pos": 49,
        "terrain": "O",
        "features": "",
        "encounter": "Selkies emerge from the a concealed merfolk palace hidden behind a waterfall, their intent focused on a shipwrecked chest filled with gold coins."
    },
    {
        "pos": 50,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 51,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 52,
        "terrain": "H",
        "features": "Misty Dune",
        "encounter": "Among the dense clusters of yucca plants, you discover a collection of polished gemstones. You can't shake the feeling of peace of mind."
    },
    {
        "pos": 53,
        "terrain": "H",
        "features": "Wild Highland",
        "encounter": "The ground trembles slightly, and the soft murmur of a hidden stream grow louder. It seems a flock of colorful and exotic birds with vibrant plumage are on the move."
    },
    {
        "pos": 54,
        "terrain": "P",
        "features": "Flat Knoll",
        "encounter": "Navigating through a treacherous, hidden crevasse, you're surprised to find a submerged entrance to an underground cavern filled with a fallen, weathered totem pole.As you journey forward, you come across a weathered and ancient stone obelisk, with traces of the smoky scent of a blacksmith's forge around them."
    },
    {
        "pos": 55,
        "terrain": "H",
        "features": "Ancient Rise",
        "encounter": "Your journey leads you to a a massive, carnivorous plant lurking in the grass. As you approach, a band of hill giants causing trouble for nearby villages honoring their ancestors through ceremonial rituals."
    },
    {
        "pos": 56,
        "terrain": "H",
        "features": "Windswept Heights",
        "encounter": "A sudden gust brings with it the earthy smell of animal fur in the wild. You spot a band of itinerant herbalists and healers that seem to be conducting trade with traveling merchants and caravans."
    },
    {
        "pos": 57,
        "terrain": "P",
        "features": "Bountiful Downs",
        "encounter": "You feel satisfaction as the buzz of bees collecting nectar from wildflowers echo in the distance. Perhaps it's a sign of what's to come."
    },
    {
        "pos": 58,
        "terrain": "P",
        "features": "Sparse Rise",
        "encounter": "You notice tall and slender stalks of bamboo moving subtly. Upon closer inspection, you see a family of giant tortoises slowly moving across the plains that are conducting elaborate mating displays and rituals."
    },
    {
        "pos": 59,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 60,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 61,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 62,
        "terrain": "H",
        "features": "Resplendent Brae",
        "encounter": "From the shadows of the a concealed chamber within a windswept hill, you sense the presence of a tribe of friendly centaurs skilled in herbalism."
    },
    {
        "pos": 63,
        "terrain": "H",
        "features": "Rolling Rise",
        "encounter": "Trails of a decayed and overgrown dock on dry land wind through the a stand of fragrant eucalyptus trees, revealing the past actions of a reclusive hermit living in a hidden hillside cottage."
    },
    {
        "pos": 64,
        "terrain": "P",
        "features": "Serene Orchard",
        "encounter": "A path surrounded by a field of cotton plants with fluffy bolls leads to a clearing with a fallen, forgotten wind chime, indicating a pack of majestic wolves with alpha leaders have been here."
    },
    {
        "pos": 65,
        "terrain": "H",
        "features": "Rich Summit",
        "encounter": "You hear the chirping of crickets on a warm summer night coming from a rocky crevice hidden by overhanging ferns."
    },
    {
        "pos": 66,
        "terrain": "H",
        "features": "Pleasant Summit",
        "encounter": "Your way is impeded by a dense, choking fog shrouding the landscape. As you contemplate a way around, you hear the soft hush of falling snow in winter from the shadows."
    },
    {
        "pos": 67,
        "terrain": "F",
        "features": "Remote Den",
        "encounter": "Among the dense a grove of towering sequoia trees, you discover a carved wooden totem adorned with animal motifs. You can't shake the feeling of satisfaction."
    },
    {
        "pos": 68,
        "terrain": "P",
        "features": "Sprawling Knoll",
        "encounter": "Your path is illuminated by the glint of a primitive map marked with enigmatic symbols. However, a pride of sabertooth tigers stalking their prey stand guard, their intentions unknown."
    },
    {
        "pos": 69,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 70,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 71,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 72,
        "terrain": "H",
        "features": "Shaded Heights",
        "encounter": "A distant the rhythmic thumping of a woodpecker's beak draws your attention. Following it, you discover a tumbledown and forgotten barn of a past event."
    },
    {
        "pos": 73,
        "terrain": "H",
        "features": "Harsh Dell",
        "encounter": "The presence of a sudden and unpredictable sinkhole makes it difficult to proceed. Perhaps the a mischievous group of pixies playing tricks on travelers nearby can help."
    },
    {
        "pos": 74,
        "terrain": "P",
        "features": "Golden Thicket",
        "encounter": "The whisper of the buzz of bees collecting nectar from wildflowers is accompanied by the distinct aroma of the sweet, vanilla-like scent of cedarwood. It seems a tribe of friendly and nature-loving elves are involved in hunting for rare and magical herbs."
    },
    {
        "pos": 75,
        "terrain": "H",
        "features": "Silhouetted Pinnacle",
        "encounter": "The ground trembles slightly, and the soft hooting of an owl in the moonlight grow louder. It seems a colony of rock-dwelling bats are on the move."
    },
    {
        "pos": 76,
        "terrain": "H",
        "features": "Gentle Slope",
        "encounter": "Deep in thought about rescue a kidnapped child taken by a clan of underground dwellers., you're startled by the soothing sound of a bubbling brook. It seems a pack of elusive timberwolves are near."
    },
    {
        "pos": 77,
        "terrain": "T",
        "features": "Seascape Port Village",
        "encounter": "A path surrounded by a canopy of maple trees in town squares leads to a clearing with a set of faded town paintings on building walls, indicating a protective town constable patrolling the streets have been here."
    },
    {
        "pos": 78,
        "terrain": "P",
        "features": "Mystical Dale",
        "encounter": "The ground is littered with a set of worn and forgotten gravestones. It appears a pride of powerful and regal lions were here recently."
    },
    {
        "pos": 79,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 80,
        "terrain": "O",
        "features": "",
        "encounter": "You come across the remnants of a coral-encrusted treasure chest of an old campsite, the scent of mildewed scent of an old shipwreck still lingering."
    },
    {
        "pos": 81,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 82,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 83,
        "terrain": "H",
        "features": "Dense Decline",
        "encounter": "Your journey leads you to a a wide and treacherous chasm. As you approach, a flock of colorful and exotic birds with vibrant plumage embarking on spiritual journeys to sacred peaks."
    },
    {
        "pos": 84,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 85,
        "terrain": "H",
        "features": "Imposing Decline",
        "encounter": "Blocked by a massive, carnivorous plant lurking in the grass, your attention is caught by the soft cooing of doves in the distance. Upon investigating, you discover a secret passage leading to an ancient burial chamber with a piece of exquisite silk fabric inside."
    },
    {
        "pos": 86,
        "terrain": "H",
        "features": "Undulating Roll",
        "encounter": "You stumble upon a scene where a pack of elusive timberwolves are engaged in taming and riding surefooted mountain goats around a collection of finely crafted jewelry, seemingly crucial for rescue a kidnapped child taken by a clan of underground dwellers.."
    },
    {
        "pos": 87,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 88,
        "terrain": "O",
        "features": "Ethereal ['Haven']",
        "encounter": ""
    },
    {
        "pos": 89,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 90,
        "terrain": "O",
        "features": "Raging ['Reef']",
        "encounter": ""
    },
    {
        "pos": 91,
        "terrain": "O",
        "features": "Radiant ['Channel']",
        "encounter": ""
    },
    {
        "pos": 92,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 93,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 94,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 95,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 96,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 97,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 98,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 99,
        "terrain": "O",
        "features": "",
        "encounter": ""
    }
]