[
    {
        "pos": 0,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 1,
        "terrain": "O",
        "features": "",
        "encounter": "You stumble upon a scene where whirlpool spirits are engaged in performing a ritual to calm a storm around a mysterious, glowing underwater crystal, seemingly crucial for investigate reports of disappearing ships in a cursed sea.."
    },
    {
        "pos": 2,
        "terrain": "O",
        "features": "",
        "encounter": "You notice bubbling hot seawater vents moving subtly. Upon closer inspection, you see giant clams that are plotting revenge against a rival pirate captain."
    },
    {
        "pos": 3,
        "terrain": "O",
        "features": "Uncharted ['Wave']",
        "encounter": ""
    },
    {
        "pos": 4,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 5,
        "terrain": "O",
        "features": "",
        "encounter": "With investigate a series of shipwrecks caused by a vengeful ghost ship. On your mind, the sudden appearance of a powerful whirlpool pulling ships downward accompanied by rustling of seaweed in the currents becomes a challenging diversion."
    },
    {
        "pos": 6,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 7,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 8,
        "terrain": "O",
        "features": "Daunting ['Trough']",
        "encounter": ""
    },
    {
        "pos": 9,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 10,
        "terrain": "O",
        "features": "",
        "encounter": "You stumble upon a sunken rowboat with a hole in its hull indicating past battles."
    },
    {
        "pos": 11,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 12,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 13,
        "terrain": "H",
        "features": "Unspoiled Brae",
        "encounter": "The whisper of the distant howling of a wolf pack is accompanied by the distinct aroma of the sweet scent of ripening fruit in an orchard. It seems a nomadic band of skilled hunters and trappers are involved in defending against natural disasters like landslides."
    },
    {
        "pos": 14,
        "terrain": "O",
        "features": "Deep ['Undercurrent']",
        "encounter": ""
    },
    {
        "pos": 15,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 16,
        "terrain": "H",
        "features": "Remote Knoll",
        "encounter": "The whisper of the soft sigh of the wind through rocky hills is accompanied by the distinct aroma of the earthy scent of fresh soil in the fields. It seems a clan of wise and reclusive hermit wizards are involved in constructing sturdy hillside homes and fortifications."
    },
    {
        "pos": 17,
        "terrain": "O",
        "features": "",
        "encounter": "Hidden among bubblegum coral, you spot a chest of mystical sea herbs and remedies glinting in the sunlight."
    },
    {
        "pos": 18,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 19,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 20,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 21,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 22,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 23,
        "terrain": "H",
        "features": "Dewy Embankment",
        "encounter": "Navigating through a pack of cunning and stealthy wolves, you're surprised to find a concealed hideout within a hillside forest filled with a shattered and toppled stone archway.As you journey forward, you come across a collection of ancient manuscripts, with traces of the grassy aroma of freshly cut hay around them."
    },
    {
        "pos": 24,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 25,
        "terrain": "H",
        "features": "Pleasant Brae",
        "encounter": "Blocked by a pack of cunning and stealthy wolves, your attention is caught by the soft whisper of wind through tall grasses. Upon investigating, you discover a burrow in the side of a hill where a reclusive hermit dwells with a set of exquisite and valuable paintings inside."
    },
    {
        "pos": 26,
        "terrain": "H",
        "features": "Stony Dale",
        "encounter": "A sudden gust brings with it the sweet, vanilla-like scent of cedarwood. You spot a pack of territorial mountain lions that seem to be performing sacred rituals to honor the land."
    },
    {
        "pos": 27,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 28,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 29,
        "terrain": "O",
        "features": "",
        "encounter": "Peering through the dense caulerpa seaweed, you catch sight of a ship's logbook with a mysterious route. But be cautious, cracking of icebergs in frigid waters suggest tidal wave elementals are near."
    },
    {
        "pos": 30,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 31,
        "terrain": "O",
        "features": "Azure ['Estuary']",
        "encounter": ""
    },
    {
        "pos": 32,
        "terrain": "H",
        "features": "Echoing Ridge",
        "encounter": "You encounter a herd of surefooted mountain goats which are searching for lost relics and ancient artifacts."
    },
    {
        "pos": 33,
        "terrain": "H",
        "features": "Stony Dune",
        "encounter": "Surrounded by a grove of tall, thin cypress trees, a series of a hidden path through dense thickets and shrubs reveal traces of a decaying and half-buried anchor, and the distant the distant barking of a watchful dog hint at more to discover."
    },
    {
        "pos": 34,
        "terrain": "P",
        "features": "Calm Heath",
        "encounter": "You stumble upon a scene where a pride of powerful and regal lions are engaged in exploring hidden caves and caverns around a carved totem animal figurine, seemingly crucial for solve the mystery of a cursed meadow that kills all plant life.."
    },
    {
        "pos": 35,
        "terrain": "H",
        "features": "Panoramic Pinnacle",
        "encounter": "Your path is illuminated by the glint of a bundle of mysterious and arcane artifacts. However, a family of hill dwarves skilled in blacksmithing stand guard, their intentions unknown."
    },
    {
        "pos": 36,
        "terrain": "H",
        "features": "Rocky Elevation",
        "encounter": "You find a hint leading you to retrieve a stolen artifact hidden in a hillside tomb.. But be wary, for a nomadic tribe of goat herders lurk nearby."
    },
    {
        "pos": 37,
        "terrain": "P",
        "features": "Grassy Land",
        "encounter": "Hidden among a stand of fragrant eucalyptus trees, you spot a leather-bound journal filled with sketches and notes glinting in the sunlight."
    },
    {
        "pos": 38,
        "terrain": "P",
        "features": "Calm Meadow",
        "encounter": "The ground is littered with a broken, rusted plow abandoned in a field. It appears a clan of nomadic gnomes skilled in earth magic were here recently."
    },
    {
        "pos": 39,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 40,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 41,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 42,
        "terrain": "H",
        "features": "Lonely Rise",
        "encounter": "With retrieve a lost family heirloom hidden in an ancient cave. On your mind, the sudden appearance of a dense swarm of stinging insects accompanied by the cawing of crows in the early morning becomes a challenging diversion."
    },
    {
        "pos": 43,
        "terrain": "H",
        "features": "Tree-covered Knoll",
        "encounter": "You encounter a family of owlbears making their home in the hills which are scouting for signs of approaching storms or threats."
    },
    {
        "pos": 44,
        "terrain": "F",
        "features": "Dreamy Clearing",
        "encounter": "The ground trembles slightly, and the soft fluttering of wings in the forest grow louder. It seems a group of bards singing songs of the forest are on the move."
    },
    {
        "pos": 45,
        "terrain": "H",
        "features": "Windswept Upland",
        "encounter": "A sudden gust brings with it the tangy scent of sun-warmed rocks. You spot a tribe of friendly centaurs skilled in herbalism that seem to be hunting for elusive game in the rocky terrain."
    },
    {
        "pos": 46,
        "terrain": "H",
        "features": "Whistling Descent",
        "encounter": "The way forward is blocked by a clan of territorial centaurs blocking passage, but you notice a concealed opening in a thicket of thorns that might lead around it."
    },
    {
        "pos": 47,
        "terrain": "P",
        "features": "Rugged Barrow",
        "encounter": "From the shadows of the a concealed opening in a dense hedge, you sense the presence of a herd of majestic unicorns grazing peacefully."
    },
    {
        "pos": 48,
        "terrain": "P",
        "features": "Timeless Downs",
        "encounter": "The tumbleweeds rolling across the plains rustles, revealing a nomadic group of skilled horse archers that are nurturing their young and teaching them survival skills."
    },
    {
        "pos": 49,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 50,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 51,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 52,
        "terrain": "H",
        "features": "Weathered Decline",
        "encounter": "The way forward is blocked by a massive, ancient burial mound, but you notice a well-hidden alcove in a canyon wall that might lead around it."
    },
    {
        "pos": 53,
        "terrain": "H",
        "features": "Remote Ascent",
        "encounter": "You notice a grove of birch trees moving subtly. Upon closer inspection, you see a family of owlbears making their home in the hills that are practicing their magical abilities in secluded groves."
    },
    {
        "pos": 54,
        "terrain": "F",
        "features": "Canopied Creek",
        "encounter": "A trail of a half-buried and forgotten forest shrine suggests that a clan of reclusive forest hermits have passed through here on a quest to help a group of lost pilgrims find their way to a sacred grove.."
    },
    {
        "pos": 55,
        "terrain": "H",
        "features": "Majestic Slope",
        "encounter": "You spot a collection of mysterious fossils nestled among wildflowers in vibrant colors, but the unsettling feeling of reverence makes you wary."
    },
    {
        "pos": 56,
        "terrain": "H",
        "features": "Foggy Foothill",
        "encounter": "An eerie the rustling of grasses in the hillside breeze resonates from a submerged entrance to an underground grotto, and the scent of the grassy aroma of freshly cut hay fills the air."
    },
    {
        "pos": 57,
        "terrain": "P",
        "features": "Rocky Bluff",
        "encounter": "You find a hint leading you to track down a rogue druid who has disrupted the balance of nature.. But be wary, for a pack of majestic wolves with alpha leaders lurk nearby."
    },
    {
        "pos": 58,
        "terrain": "P",
        "features": "Uncharted Meadow",
        "encounter": "Hidden among thick patches of clover, you spot a set of hand-carved wooden figurines glinting in the sunlight."
    },
    {
        "pos": 59,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 60,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 61,
        "terrain": "O",
        "features": "Epic ['Bight']",
        "encounter": ""
    },
    {
        "pos": 62,
        "terrain": "T",
        "features": "Abyssal Abyss",
        "encounter": "An eerie the gentle strumming of a town bard's lute resonates from a hidden chamber beneath a town's museum, and the scent of the salty sea breeze from a nearby town harbor fills the air."
    },
    {
        "pos": 63,
        "terrain": "H",
        "features": "Resplendent Plateau",
        "encounter": "Navigating through a dense, choking fog shrouding the landscape, you're surprised to find a hidden tunnel leading to a secluded cavern filled with a crumbling and half-buried tower.As you journey forward, you come across a stack of ancient and mysterious scrolls, with traces of the sweet scent of fresh honey in the hills around them."
    },
    {
        "pos": 64,
        "terrain": "F",
        "features": "Dry Creek",
        "encounter": "Ahead, there is a treacherous, rocky forest ravine blocking your path. Perhaps it's related to your quest to escort a group of pilgrims to a sacred forest clearing.."
    },
    {
        "pos": 65,
        "terrain": "H",
        "features": "Undulating Elevation",
        "encounter": "You hear the soft hush of falling snow in winter coming from a concealed opening in a thicket of thorns."
    },
    {
        "pos": 66,
        "terrain": "H",
        "features": "Solitary Rise",
        "encounter": "The ground trembles slightly, and the rustling of grasses in the hillside breeze grow louder. It seems a family of hill dwarves skilled in blacksmithing are on the move."
    },
    {
        "pos": 67,
        "terrain": "P",
        "features": "Sprawling Horizon",
        "encounter": "You feel an overwhelming sense of unity as you tread upon a half-buried, broken cart axle, hinting at a tale of a herd of graceful, horned antelopes."
    },
    {
        "pos": 68,
        "terrain": "P",
        "features": "Panoramic Lea",
        "encounter": "Surrounded by a field of sunflowers, a series of a hidden campsite deep within a forest reveal traces of a moss-covered, toppled stone obelisk, and the distant the gentle whistling of the wind through rock formations hint at more to discover."
    },
    {
        "pos": 69,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 70,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 71,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 72,
        "terrain": "H",
        "features": "Sunny Summit",
        "encounter": "You come across a decayed and mossy shipwreck on dry land of an old campsite, the scent of the clean, woody smell of the forest floor still lingering."
    },
    {
        "pos": 73,
        "terrain": "H",
        "features": "Harsh Heights",
        "encounter": "Deep in thought about investigate strange occurrences at an ancient temple on a hilltop., you're startled by the rhythmic thumping of a woodpecker's beak. It seems a band of hill giants causing trouble for nearby villages are near."
    },
    {
        "pos": 74,
        "terrain": "P",
        "features": "Open Bluff",
        "encounter": "Blocked by a patch of quicksand hidden beneath the surface, your attention is caught by the rustling of leaves in the trees. Upon investigating, you discover a network of underground tunnels used by creatures with a pair of intricately beaded moccasins inside."
    },
    {
        "pos": 75,
        "terrain": "H",
        "features": "Silhouetted Brae",
        "encounter": "Trails of a shattered and toppled watchtower wind through the golden wheat fields, revealing the past actions of giant eagles nesting in high cliffs and peaks."
    },
    {
        "pos": 76,
        "terrain": "H",
        "features": "Dewy Slope",
        "encounter": "A mischievous group of pixies playing tricks on travelers emerge from the a hollow beneath a massive boulder covered with moss, their intent focused on a stack of ancient, leather-bound books."
    },
    {
        "pos": 77,
        "terrain": "F",
        "features": "Enchanted Brush",
        "encounter": "The ground is littered with a half-buried and mossy forest stone well. It appears a family of beavers building a dam in the river were here recently."
    },
    {
        "pos": 78,
        "terrain": "P",
        "features": "Pristine Valley",
        "encounter": "You encounter a friendly clan of halfling farmers which are seeking guidance from wise and ancient elders."
    },
    {
        "pos": 79,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 80,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 81,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 82,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 83,
        "terrain": "H",
        "features": "Dominant Roll",
        "encounter": "The ground trembles slightly, and the distant hooting of an eagle owl grow louder. It seems a nomadic tribe of goat herders are on the move."
    },
    {
        "pos": 84,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 85,
        "terrain": "H",
        "features": "Silhouetted Ascent",
        "encounter": "You hear the cawing of crows in the early morning coming from a secret tunnel leading to an underground chamber."
    },
    {
        "pos": 86,
        "terrain": "H",
        "features": "Stony Tumulus",
        "encounter": "You stumble upon a set of decaying wooden fence posts indicating past battles."
    },
    {
        "pos": 87,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 88,
        "terrain": "O",
        "features": "Tidal ['Cove']",
        "encounter": ""
    },
    {
        "pos": 89,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 90,
        "terrain": "O",
        "features": "",
        "encounter": "You stumble upon the remnants of a sunken sea monster's scale indicating past battles."
    },
    {
        "pos": 91,
        "terrain": "O",
        "features": "",
        "encounter": "The air is filled with the smell of freshly baked bread from a seaside bakery. You feel a sense of joy."
    },
    {
        "pos": 92,
        "terrain": "O",
        "features": "Majestic ['Trench']",
        "encounter": ""
    },
    {
        "pos": 93,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 94,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 95,
        "terrain": "O",
        "features": "Calm ['Basin']",
        "encounter": ""
    },
    {
        "pos": 96,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 97,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 98,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 99,
        "terrain": "O",
        "features": "",
        "encounter": ""
    }
]