[
    {
        "pos": 0,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 1,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 2,
        "terrain": "O",
        "features": "Teeming ['Passage']",
        "encounter": ""
    },
    {
        "pos": 3,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 4,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 5,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 6,
        "terrain": "O",
        "features": "",
        "encounter": "Among the dense kelp forests, you discover a shipwrecked chest filled with gold coins. You can't shake the feeling of dread."
    },
    {
        "pos": 7,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 8,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 9,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 10,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 11,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 12,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 13,
        "terrain": "H",
        "features": "Remote Crest",
        "encounter": "Deep in thought about defend a sacred circle of stones from being desecrated by treasure hunters., you're startled by the soft hooting of an owl in the moonlight. It seems a group of crafty goblins hiding in rocky caves are near."
    },
    {
        "pos": 14,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 15,
        "terrain": "O",
        "features": "Silent ['Edifice']",
        "encounter": ""
    },
    {
        "pos": 16,
        "terrain": "H",
        "features": "Craggy Brae",
        "encounter": "With retrieve a stolen map leading to hidden treasure in the hills. On your mind, the sudden appearance of a herd of territorial and aggressive bison accompanied by the distant call of a solitary hawk soaring above becomes a challenging diversion."
    },
    {
        "pos": 17,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 18,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 19,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 20,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 21,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 22,
        "terrain": "O",
        "features": "Tempestuous ['Deep']",
        "encounter": ""
    },
    {
        "pos": 23,
        "terrain": "H",
        "features": "Jagged Incline",
        "encounter": "A sudden gust brings with it the fresh, clean scent after a rain shower. You spot a tribe of friendly centaurs skilled in herbalism that seem to be nurturing their young and teaching them survival skills."
    },
    {
        "pos": 24,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 25,
        "terrain": "H",
        "features": "Tranquil Ridge",
        "encounter": "Every step forward is met with the increasing intensity of the pungent smell of a skunk in the distance, suggesting the presence of a group of skilled miners extracting precious minerals."
    },
    {
        "pos": 26,
        "terrain": "H",
        "features": "Dense Escarpment",
        "encounter": "Your senses are overwhelmed by innocence as you uncover a set of intricate musical instruments hidden within low-lying groundcover."
    },
    {
        "pos": 27,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 28,
        "terrain": "O",
        "features": "",
        "encounter": "Ship-eating barnacles gives you a quest to escort a fragile, magical artifact through dangerous waters.In your path lies a sparkling pearl necklace surrounded by giant underwater mushrooms."
    },
    {
        "pos": 29,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 30,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 31,
        "terrain": "O",
        "features": "Soothing ['Strait']",
        "encounter": ""
    },
    {
        "pos": 32,
        "terrain": "H",
        "features": "Grassy Ridge",
        "encounter": "You feel an overwhelming sense of fascination as you tread upon a decaying and moss-covered treasure map, hinting at a tale of a clan of hill giants known for their stone-throwing abilities."
    },
    {
        "pos": 33,
        "terrain": "H",
        "features": "Craggy Descent",
        "encounter": "Trails of a ruined and overgrown castle wall wind through the wildflowers in vibrant colors, revealing the past actions of a clan of hill giants known for their stone-throwing abilities."
    },
    {
        "pos": 34,
        "terrain": "F",
        "features": "Thick Glade",
        "encounter": "The ground is littered with a collapsed and overgrown forest monastery. It appears a band of hunters tracking game through the woods were here recently."
    },
    {
        "pos": 35,
        "terrain": "H",
        "features": "Serene Ascent",
        "encounter": "Your path is illuminated by the glint of a collection of polished gemstones. However, a pride of ferocious mountain lions stand guard, their intentions unknown."
    },
    {
        "pos": 36,
        "terrain": "H",
        "features": "Golden Hillock",
        "encounter": "From the shadows of the a hidden chamber beneath a hillside tomb, you sense the presence of a nomadic band of skilled hunters and trappers."
    },
    {
        "pos": 37,
        "terrain": "F",
        "features": "Damp Stump",
        "encounter": "From the shadows of the a hidden trail leading to a remote forest waterfall, you sense the presence of a clan of gnomes with homes hidden in the forest."
    },
    {
        "pos": 38,
        "terrain": "P",
        "features": "Green Knoll",
        "encounter": "You spot a stack of handwoven baskets nestled among a dense canopy of oak trees, but the unsettling feeling of comfort makes you wary."
    },
    {
        "pos": 39,
        "terrain": "T",
        "features": "Sunset Oasis",
        "encounter": "A distant the clanging of a blacksmith's hammer on metal draws your attention. Following it, you discover a set of crumbling town ruins by the river of a past event."
    },
    {
        "pos": 40,
        "terrain": "O",
        "features": "Reflective ['Sandbank']",
        "encounter": ""
    },
    {
        "pos": 41,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 42,
        "terrain": "H",
        "features": "Tree-covered Elevation",
        "encounter": "A path surrounded by wildflowers in vibrant colors leads to a clearing with a partially buried and cracked sundial, indicating a group of crafty goblins hiding in rocky caves have been here."
    },
    {
        "pos": 43,
        "terrain": "H",
        "features": "Serrated Summit",
        "encounter": "The tall, slender blades of marsh grass rustles, revealing a herd of agile and horned antelopes that are performing sacred rituals to honor the land."
    },
    {
        "pos": 44,
        "terrain": "P",
        "features": "Parched Hollow",
        "encounter": "The ground trembles slightly, and the distant mooing of cattle grow louder. It seems a colony of giant ants with a complex social structure are on the move."
    },
    {
        "pos": 45,
        "terrain": "H",
        "features": "Rolling Ascent",
        "encounter": "The tall and slender stalks of bamboo rustles, revealing a family of griffins soaring over the hills that are exploring ancient ruins and archaeological sites."
    },
    {
        "pos": 46,
        "terrain": "H",
        "features": "Resplendent Incline",
        "encounter": "You feel wonderment as the distant howling of a wolf pack echo in the distance. Perhaps it's a sign of what's to come."
    },
    {
        "pos": 47,
        "terrain": "P",
        "features": "Boundless Orchard",
        "encounter": "A trail of a tattered and forgotten battle flag suggests that a clan of nomadic gnomes skilled in earth magic have passed through here on a quest to escort a diplomatic envoy through hostile territory to negotiate peace.."
    },
    {
        "pos": 48,
        "terrain": "F",
        "features": "Canopied River",
        "encounter": "Peering through the dense a grove of tall willow trees by a forest stream, you catch sight of a bundle of rare and magical scrolls. But be cautious, the rustling of leaves in the gentle forest breeze suggest a tribe of druids protecting the sacred forest are near."
    },
    {
        "pos": 49,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 50,
        "terrain": "O",
        "features": "Pristine ['Seamount']",
        "encounter": "The air is filled with the smell of pungent smell of seaweed drying in the sun. You feel a sense of empathy."
    },
    {
        "pos": 51,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 52,
        "terrain": "H",
        "features": "Leafy Hillock",
        "encounter": "Your senses are overwhelmed by peace of mind as you uncover a stack of ancient, leather-bound books hidden within sparse patches of desert wildflowers."
    },
    {
        "pos": 53,
        "terrain": "H",
        "features": "Cultivated Summit",
        "encounter": "You spot a bundle of rare and aromatic herbs nestled among sparse patches of desert scrub, but the unsettling feeling of serenity makes you wary."
    },
    {
        "pos": 54,
        "terrain": "P",
        "features": "Sprawling Yard",
        "encounter": "A colony of burrowing creatures building underground tunnels emerge from the a concealed alcove in a canyon wall, their intent focused on a patch of wildflowers in various hues."
    },
    {
        "pos": 55,
        "terrain": "H",
        "features": "Unspoiled Plateau",
        "encounter": "Ahead, there is a colony of giant, aggressive ants blocking your path. Perhaps it's related to your quest to retrieve a stolen tribe artifact from a rival nomadic group.."
    },
    {
        "pos": 56,
        "terrain": "H",
        "features": "Dominant Elevation",
        "encounter": "With help a group of hunters take down a dangerous beast threatening the hills. On your mind, the sudden appearance of a deep, hidden pit trap accompanied by the gentle splashing of water in a hillside stream becomes a challenging diversion."
    },
    {
        "pos": 57,
        "terrain": "P",
        "features": "Grassy Dale",
        "encounter": "From the shadows of the a concealed entrance to a subterranean labyrinth, you sense the presence of a nomadic tribe of human hunters."
    },
    {
        "pos": 58,
        "terrain": "P",
        "features": "Open Dell",
        "encounter": "Your journey leads you to a a swarm of voracious locusts devouring vegetation. As you approach, a mischievous leprechaun guarding its hidden treasure exploring hidden caves and caverns."
    },
    {
        "pos": 59,
        "terrain": "O",
        "features": "",
        "encounter": "The presence of a thick forest of kelp that entangles ships makes it difficult to proceed. Perhaps the giant sea turtles nearby can help."
    },
    {
        "pos": 60,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 61,
        "terrain": "O",
        "features": "",
        "encounter": "Your senses are overwhelmed by love as you uncover a ship's bell with a haunting chime hidden within bubbling hot seawater vents."
    },
    {
        "pos": 62,
        "terrain": "H",
        "features": "Windswept Dell",
        "encounter": "You stumble upon a scene where a tribe of reclusive druids living in hillside huts are engaged in organizing athletic competitions and races around a stack of hand-drawn maps and parchments, seemingly crucial for help a tribe of forest creatures negotiate a truce with a rival clan.."
    },
    {
        "pos": 63,
        "terrain": "H",
        "features": "Elevated Plateau",
        "encounter": "Your way is impeded by a clan of territorial centaurs blocking passage. As you contemplate a way around, you hear the humming of insects on a warm day from the shadows."
    },
    {
        "pos": 64,
        "terrain": "P",
        "features": "Flowering Acres",
        "encounter": "The small, gnarled shrubs rustles, revealing a tribe of friendly centaurs known for their healing abilities that are defending against natural disasters like wildfires or droughts."
    },
    {
        "pos": 65,
        "terrain": "H",
        "features": "Panoramic Hillock",
        "encounter": "A mischievous group of pixies playing tricks on travelers emerge from the a hidden cache of valuable gemstones and minerals, their intent focused on a collection of finely crafted jewelry."
    },
    {
        "pos": 66,
        "terrain": "H",
        "features": "Rugged Brae",
        "encounter": "You find a hint leading you to protect a sacred grove from being desecrated by loggers.. But be wary, for a clan of hill giants known for their stone-throwing abilities lurk nearby."
    },
    {
        "pos": 67,
        "terrain": "P",
        "features": "Rippling Meadow",
        "encounter": "You uncover a crumbling, overgrown temple entrance that tell a story of a time when a wise and ancient treant protecting the forest's edge pursued hunt down a notorious bandit gang that has been terrorizing the grasslands.."
    },
    {
        "pos": 68,
        "terrain": "P",
        "features": "Sparse Valley",
        "encounter": "Trails of a collapsed, long-abandoned homestead wind through the a stand of tall pine trees, revealing the past actions of a tribe of friendly and herbivorous lizardfolk."
    },
    {
        "pos": 69,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 70,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 71,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 72,
        "terrain": "H",
        "features": "Remote Tumulus",
        "encounter": "You come across a toppled and shattered stone monolith of an old campsite, the scent of the smoky aroma of a campfire at night still lingering."
    },
    {
        "pos": 73,
        "terrain": "H",
        "features": "Lonely Dune",
        "encounter": "Your path is illuminated by the glint of a bundle of rare and fragrant mushrooms. However, a family of giant hawks nesting in the cliffs stand guard, their intentions unknown."
    },
    {
        "pos": 74,
        "terrain": "P",
        "features": "Vast Field",
        "encounter": "The presence of a massive, ancient burial mound makes it difficult to proceed. Perhaps the a wise old owl with the gift of prophecy nearby can help."
    },
    {
        "pos": 75,
        "terrain": "H",
        "features": "Serrated Terrace",
        "encounter": "Strange a shattered and toppled stone archway lie scattered, painting a tale of a clan of centaurs known for their archery skills that practicing their magical abilities in secluded groves."
    },
    {
        "pos": 76,
        "terrain": "H",
        "features": "Foggy Bank",
        "encounter": "You stumble upon a scene where a group of elusive elves living in the deep forested hills are engaged in taming and riding surefooted mountain goats around a collection of rare and valuable gemstones, seemingly crucial for rescue a group of trapped miners in a collapsed tunnel.."
    },
    {
        "pos": 77,
        "terrain": "P",
        "features": "Rugged Dale",
        "encounter": "Every step forward is met with the increasing intensity of the warm, dusty smell of a dirt road, suggesting the presence of a band of traveling minstrels and bards."
    },
    {
        "pos": 78,
        "terrain": "P",
        "features": "Endless Ridge",
        "encounter": "You stumble upon a scene where a nomadic group of skilled horse archers are engaged in engaging in friendly competition and games around a stack of animal hides for crafting, seemingly crucial for escort a group of pilgrims to a sacred site in the plains.."
    },
    {
        "pos": 79,
        "terrain": "O",
        "features": "Spectacular ['Kelp Forest']",
        "encounter": ""
    },
    {
        "pos": 80,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 81,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 82,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 83,
        "terrain": "H",
        "features": "Hazy Upland",
        "encounter": "Peering through the dense tumbleweeds rolling across the plains, you catch sight of a stack of hand-drawn maps and parchments. But be cautious, the distant call of a solitary hawk soaring above suggest a family of hill dwarves skilled in blacksmithing are near."
    },
    {
        "pos": 84,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 85,
        "terrain": "H",
        "features": "Echoing Embankment",
        "encounter": "A reclusive hermit living in a hidden hillside cottage emerge from the a hidden trail leading to a remote hilltop, their intent focused on a hunting horn adorned with intricate designs."
    },
    {
        "pos": 86,
        "terrain": "H",
        "features": "Barren Rise",
        "encounter": "A tribe of friendly centaurs skilled in herbalism gives you a quest to protect a sacred grove from being desecrated by loggers.In your path lies a stack of ancient and mysterious scrolls surrounded by a field of sunflowers."
    },
    {
        "pos": 87,
        "terrain": "O",
        "features": "",
        "encounter": "You see a ship's sextant for celestial navigation that could be useful in your quest to help a shipwrecked sailor construct a signal fire to call for rescue.. But it's guarded by merfolk."
    },
    {
        "pos": 88,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 89,
        "terrain": "O",
        "features": "",
        "encounter": "The green string lettuce rustles, revealing sarcastic cephalopod that are rescuing shipwreck survivors."
    },
    {
        "pos": 90,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 91,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 92,
        "terrain": "O",
        "features": "Sweeping ['Bay']",
        "encounter": ""
    },
    {
        "pos": 93,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 94,
        "terrain": "O",
        "features": "Boundless ['Surf']",
        "encounter": "You feel an overwhelming sense of fear as you tread upon a damaged sextant with a cracked lens, hinting at a tale of floating market traders."
    },
    {
        "pos": 95,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 96,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 97,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 98,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 99,
        "terrain": "O",
        "features": "",
        "encounter": ""
    }
]