[
    {
        "pos": 0,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 1,
        "terrain": "O",
        "features": "",
        "encounter": "You're guided by the soft humming of a powerful sea enchantment. As you follow, you encounter giant sea turtles in the midst of creating storms to deter sailors."
    },
    {
        "pos": 2,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 3,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 4,
        "terrain": "O",
        "features": "Mysterious ['Basin']",
        "encounter": ""
    },
    {
        "pos": 5,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 6,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 7,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 8,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 9,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 10,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 11,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 12,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 13,
        "terrain": "H",
        "features": "Shaded Escarpment",
        "encounter": "Peering through the dense a stand of fragrant eucalyptus trees, you catch sight of a bundle of rare and fragrant mushrooms. But be cautious, the gentle whistling of the wind through rocky terrain suggest a family of owlbears making their home in the hills are near."
    },
    {
        "pos": 14,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 15,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 16,
        "terrain": "H",
        "features": "Rich Embankment",
        "encounter": "Your senses are overwhelmed by inspiration as you uncover a collection of ancient coins hidden within low-lying groundcover."
    },
    {
        "pos": 17,
        "terrain": "O",
        "features": "Sweeping ['Kelp Forest']",
        "encounter": ""
    },
    {
        "pos": 18,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 19,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 20,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 21,
        "terrain": "O",
        "features": "Uncharted ['Ridge']",
        "encounter": ""
    },
    {
        "pos": 22,
        "terrain": "O",
        "features": "Salty ['Flats']",
        "encounter": ""
    },
    {
        "pos": 23,
        "terrain": "H",
        "features": "Remote Pinnacle",
        "encounter": "You come across a crumbling and overgrown temple entrance of an old campsite, the scent of the clean, woody smell of the forest floor still lingering."
    },
    {
        "pos": 24,
        "terrain": "O",
        "features": "Spectacular ['Tidal Pool']",
        "encounter": ""
    },
    {
        "pos": 25,
        "terrain": "H",
        "features": "Silhouetted Tumulus",
        "encounter": "The air is filled with the smell of the earthy scent of fresh soil in the fields. You feel a sense of enthusiasm."
    },
    {
        "pos": 26,
        "terrain": "H",
        "features": "Receding Ascent",
        "encounter": "Deep in thought about solve the mystery of disappearing livestock in a farming community., you're startled by the rhythmic thumping of a woodpecker's beak. It seems a clan of hill giants known for their stone-throwing abilities are near."
    },
    {
        "pos": 27,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 28,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 29,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 30,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 31,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 32,
        "terrain": "H",
        "features": "Imposing Roll",
        "encounter": "Ahead, there is a vast, scorching desert with no water in sight blocking your path. Perhaps it's related to your quest to help a reclusive hermit find a rare and elusive herb for his studies.."
    },
    {
        "pos": 33,
        "terrain": "H",
        "features": "Dewy Foothill",
        "encounter": "Your journey leads you to a a swarm of voracious locusts devouring vegetation. As you approach, a colony of rock-dwelling bats honoring their ancestors through ceremonial rituals."
    },
    {
        "pos": 34,
        "terrain": "P",
        "features": "Arid Expanse",
        "encounter": "The ground is littered with a decaying, half-buried anchor. It appears a band of itinerant traders and merchants were here recently."
    },
    {
        "pos": 35,
        "terrain": "H",
        "features": "Foggy Peak",
        "encounter": "You stumble upon a half-buried and broken cart axle indicating past battles."
    },
    {
        "pos": 36,
        "terrain": "H",
        "features": "Vibrant Roll",
        "encounter": "You see a collection of finely crafted jewelry that could be useful in your quest to defend a sacred circle of stones from being desecrated by treasure hunters.. But it's guarded by a family of griffins soaring over the hills."
    },
    {
        "pos": 37,
        "terrain": "P",
        "features": "Vast Downs",
        "encounter": "Your path is illuminated by the glint of a hidden cache of valuable gemstones. However, a family of talking rabbits with magical abilities stand guard, their intentions unknown."
    },
    {
        "pos": 38,
        "terrain": "P",
        "features": "Uncharted Lea",
        "encounter": "A distant the crackling of a campfire draws your attention. Following it, you discover a set of worn, ancient road markers of a past event."
    },
    {
        "pos": 39,
        "terrain": "O",
        "features": "",
        "encounter": "A path surrounded by halophila seagrass leads to a clearing with a torn and waterlogged book of sea legends, indicating ghost ships have been here."
    },
    {
        "pos": 40,
        "terrain": "O",
        "features": "",
        "encounter": "A mysterious crisp, ocean-scented laundry on a line envelops you, drawing you towards an ancient, submerged temple with hidden chambers where shipwreck goblins are exploring a mysterious underwater cave."
    },
    {
        "pos": 41,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 42,
        "terrain": "H",
        "features": "High Escarpment",
        "encounter": "Your senses are overwhelmed by elation as you uncover a collection of finely crafted jewelry hidden within tall, swaying grasses."
    },
    {
        "pos": 43,
        "terrain": "H",
        "features": "Panoramic Escarpment",
        "encounter": "The air is filled with the smell of the sweet scent of ripening fruit in an orchard. You feel a sense of tenderness."
    },
    {
        "pos": 44,
        "terrain": "F",
        "features": "Shady Brook",
        "encounter": "Ahead, there is a wide and treacherous ravine in the woods blocking your path. Perhaps it's related to your quest to track down a missing forest guide lost in the wilderness.."
    },
    {
        "pos": 45,
        "terrain": "H",
        "features": "Slopey Embankment",
        "encounter": "You stumble upon a moss-covered and toppled obelisk indicating past battles."
    },
    {
        "pos": 46,
        "terrain": "H",
        "features": "Foggy Dell",
        "encounter": "A distant the soft murmur of a hidden stream draws your attention. Following it, you discover a set of decaying wooden fence posts of a past event."
    },
    {
        "pos": 47,
        "terrain": "P",
        "features": "Sunlit Vale",
        "encounter": "Hidden among bushy sagebrush, you spot a stack of intricately woven tapestries glinting in the sunlight."
    },
    {
        "pos": 48,
        "terrain": "P",
        "features": "Harmonious Vista",
        "encounter": "You encounter a wise and ancient treant protecting the forest's edge which are defending against natural disasters like wildfires or droughts."
    },
    {
        "pos": 49,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 50,
        "terrain": "O",
        "features": "Boundless ['Seabed']",
        "encounter": ""
    },
    {
        "pos": 51,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 52,
        "terrain": "H",
        "features": "Lonely Rise",
        "encounter": "The whisper of the soft splashing of water at a river's edge is accompanied by the distinct aroma of the sweet scent of ripening fruit in an orchard. It seems a group of nomadic merchants trading rare goods are involved in embarking on spiritual journeys to sacred peaks."
    },
    {
        "pos": 53,
        "terrain": "H",
        "features": "Fertile Descent",
        "encounter": "Your way is impeded by a steep and rocky cliffside. As you contemplate a way around, you hear the soft hooting of an owl in the moonlight from the shadows."
    },
    {
        "pos": 54,
        "terrain": "F",
        "features": "Tropical Brush",
        "encounter": "You see a well-preserved set of animal bones that could be useful in your quest to help a clan of woodland creatures negotiate a truce with a rival group.. But it's guarded by a band of forest outlaws hiding from the law."
    },
    {
        "pos": 55,
        "terrain": "H",
        "features": "Pleasant Incline",
        "encounter": "With protect a sacred grove from being desecrated by loggers. On your mind, the sudden appearance of a labyrinthine network of winding canyons accompanied by the soft hooting of an owl in the moonlight becomes a challenging diversion."
    },
    {
        "pos": 56,
        "terrain": "H",
        "features": "Silhouetted Dell",
        "encounter": "Your senses are overwhelmed by bliss as you uncover a set of intricately beaded necklaces hidden within clusters of pine cones on the ground."
    },
    {
        "pos": 57,
        "terrain": "P",
        "features": "Ancient Grove",
        "encounter": "You uncover a faded and illegible gravestone that tell a story of a time when a flock of colorful, exotic birds with mesmerizing plumage pursued help a group of hunters take down a dangerous beast that threatens the plains.."
    },
    {
        "pos": 58,
        "terrain": "P",
        "features": "Undulating Flats",
        "encounter": "Trails of a crumbling, old well with a missing bucket wind through the a grove of twisted juniper trees, revealing the past actions of a family of giant armadillos rolling through the grasslands."
    },
    {
        "pos": 59,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 60,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 61,
        "terrain": "O",
        "features": "",
        "encounter": "Your path is illuminated by the glint of a sparkling pearl necklace. However, sarcastic cephalopod stand guard, their intentions unknown."
    },
    {
        "pos": 62,
        "terrain": "T",
        "features": "Treasure Isle",
        "encounter": "You encounter a skilled blacksmith forging weapons which are praying at the town's religious shrine."
    },
    {
        "pos": 63,
        "terrain": "H",
        "features": "Isolated Ridge",
        "encounter": "You spot a set of enchanted crystals nestled among a field of sunflowers, but the unsettling feeling of freedom makes you wary."
    },
    {
        "pos": 64,
        "terrain": "F",
        "features": "Humid River",
        "encounter": "You're guided by the soft the gentle whistling of the wind through the trees. As you follow, you encounter a group of lost travelers seeking directions in the midst of farming and cultivating forest crops."
    },
    {
        "pos": 65,
        "terrain": "H",
        "features": "Whistling Heights",
        "encounter": "A mysterious the sweet fragrance of wild herbs on the wind envelops you, drawing you towards a hidden campsite in the midst of a highland forest where a wise and ancient treant guarding a sacred grove are guarding their territory from intruders."
    },
    {
        "pos": 66,
        "terrain": "H",
        "features": "Fertile Dune",
        "encounter": "Strange a set of decaying wooden fence posts lie scattered, painting a tale of a tribe of friendly centaurs skilled in herbalism that conducting trade with traveling merchants and caravans."
    },
    {
        "pos": 67,
        "terrain": "P",
        "features": "Uncharted Knoll",
        "encounter": "You stumble upon a scene where a tribe of friendly and nature-loving elves are engaged in mining valuable minerals and gemstones around a nest of delicate and ornate bird eggs, seemingly crucial for help a struggling farming family protect their crops from pests.."
    },
    {
        "pos": 68,
        "terrain": "P",
        "features": "Flowering Savannah",
        "encounter": "Every step forward is met with the increasing intensity of the sweet aroma of wildflowers in bloom, suggesting the presence of a group of reclusive and contemplative monks."
    },
    {
        "pos": 69,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 70,
        "terrain": "O",
        "features": "Ethereal ['Narrows']",
        "encounter": ""
    },
    {
        "pos": 71,
        "terrain": "O",
        "features": "Choppy ['Undercurrent']",
        "encounter": ""
    },
    {
        "pos": 72,
        "terrain": "H",
        "features": "Echoing Elevation",
        "encounter": "The presence of a wide and treacherous chasm makes it difficult to proceed. Perhaps the a clan of hill giants known for their stone-throwing abilities nearby can help."
    },
    {
        "pos": 73,
        "terrain": "H",
        "features": "Unspoiled Descent",
        "encounter": "An eerie the rhythmic thumping of a woodpecker's beak resonates from a hidden chamber beneath a hillside tomb, and the scent of the musty scent of old, weathered books fills the air."
    },
    {
        "pos": 74,
        "terrain": "P",
        "features": "Timeless Dell",
        "encounter": "You find a hint leading you to solve the mystery of disappearing livestock in a farming community.. But be wary, for a tribe of friendly and nature-loving elves lurk nearby."
    },
    {
        "pos": 75,
        "terrain": "H",
        "features": "Undulating Slope",
        "encounter": "Your path is illuminated by the glint of a well-preserved set of animal bones. However, a group of skilled miners extracting precious minerals stand guard, their intentions unknown."
    },
    {
        "pos": 76,
        "terrain": "H",
        "features": "Pleasant Crest",
        "encounter": "Your path is illuminated by the glint of a bundle of rare and enchanted trinkets. However, a clan of hardy dwarves mining deep in the hills stand guard, their intentions unknown."
    },
    {
        "pos": 77,
        "terrain": "F",
        "features": "Menacing Grove",
        "encounter": "Trails of a toppled and shattered forest stone monolith wind through the a grove of fruit-bearing apple trees in the forest, revealing the past actions of a colony of talking mushrooms."
    },
    {
        "pos": 78,
        "terrain": "P",
        "features": "Boundless Grove",
        "encounter": "An eerie the soft hush of falling snow resonates from a hidden meadow surrounded by rocky terrain, and the scent of the pungent odor of sagebrush on a hot day fills the air."
    },
    {
        "pos": 79,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 80,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 81,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 82,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 83,
        "terrain": "H",
        "features": "Low Dale",
        "encounter": "The air is filled with the smell of the earthy scent of fresh soil in the fields. You feel a sense of harmony."
    },
    {
        "pos": 84,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 85,
        "terrain": "H",
        "features": "Serrated Mound",
        "encounter": "Surrounded by clusters of wild berries, a series of a hidden tunnel leading to a secluded cavern reveal traces of a collapsed and overgrown homestead, and the distant the chirping of young birds in their nests hint at more to discover."
    },
    {
        "pos": 86,
        "terrain": "H",
        "features": "Craggy Embankment",
        "encounter": "Peering through the dense a stand of fragrant eucalyptus trees, you catch sight of a carved wooden totem adorned with feathers. But be cautious, the chirping of young birds in their nests suggest a group of elusive elves living in the deep forested hills are near."
    },
    {
        "pos": 87,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 88,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 89,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 90,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 91,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 92,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 93,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 94,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 95,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 96,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 97,
        "terrain": "O",
        "features": "",
        "encounter": ""
    },
    {
        "pos": 98,
        "terrain": "O",
        "features": "Pristine ['Seabed']",
        "encounter": ""
    },
    {
        "pos": 99,
        "terrain": "O",
        "features": "",
        "encounter": ""
    }
]